[
    "You under scrutiny too joy reid...for those hate emails towards the LGBTQABC123 Community sista! 🫵",
    "Trans affirming care is anti-science and anti-child. It is a perversion of both medicine and of love for children. Perverted people will push perversions.  I understand that. But the people who do the most damage are the useful idiots that cheer them on - like everyone at this network and nearly all the other networks.",
    "I don't get why Republicans are so fixated on persecuting transgender people. It's not popular. It's only going to make them look like shitheads in a couple of years. It's already cost them bigly in 2022 and will cost them even more in 2024. I don't get it! Who is this for? Fundies? They've got fundamentalists on a lock and they've never done anything for them before and the fundies always come back. I seriously don't get it. The only explanation is that Republicans are morons.",
    "Thank you Lawrence for your in depth and honest reporting of the news, the facts! No spin,  no opinion unless it's warranted as in the Uvalde shootings, something we all felt the sorrow and the shame of the GQP's inaction to save people's lives, especially little innocents! I am glad that you are of a few on MSNBC that doesn't try to gaslight your viewers or get involved in the whataboutisms of the Right! Thank you from an admiring fellow Massachusetts Yankee, transplant under duress 42 years ago to Red, Red Iowa! I am 73 and I would like to move back to the Ocean and a \"liberal\" real Yankee state. I was so proud of the kindness shown to the Kidnapped Asylum seekers that DeathSantis tried to get a Gotcha on the Coastal Elites, even though he is one! Anyway, I just wanted to thank you and love your show! ❤❤",
    "Except for Governor DeSantis\nSWAMP! \nDemocrat in wolf clothing haley, NJ traitor. Judas. \nDon't bring in the rookie translation, fresh eyes into DC,\nNot a racist comment NJ traitor, the guy with a strange name. \nLoL",
    "15:36 The region RM is talking about is called Transnistria, a region that has split away from Moldovia after the break-up of the Soviet Union. The region is bordering Molovia and Ukraine, not Russia, so it would be impossible to integrate it in the Russian Federation w/o integrating the complete Ukrainan South first. As of now,  it would be just another enclave w/o direct access route.",
    "I vote speaker McCarthy and McConnell positions to be paid $10 or $15 an hour and see them eat, pay for kids, “rent” which goes up each year, hygiene, insurance (auto, medical and life), gas, electricity, automobile (transportation and repairs), internet, take care of elderly parents all at the same time!  And when they can’t pay their bills have big companies go after them with all kinds of fees to keep their credit score poor!  Then big companies can discriminate against having you as a customer because who wants a low income customer in poverty?\nWhat is Kevin and Mitches definition of marginalized?  Discrimination?",
    "Why is people worrying about africa how they deal with  gays The middle east, China, Russia, few more countries is way worst then africa But the world don't worry about them they only focus on africa. Nobody saying nothing to the middle east, China, or Russia, How bad they treat there gays. If people don't like what africa is doing then move.",
    "The vast majority of Ugandans have never in their lifetime met an LGBTQ person. There's just this feeling that they threaten our existence in some way. This law is born out of an existential threat, real or imagined. I personally blame Liberals in the West who have gone out of their way pushing their agenda and demanding that other people recognize and even promote them as a human rights. Their local compradors in the CSO industry jumped on it and made it another meal ticket for themselves. In reality Ugandans have a lot more pressing needs and threats to attend to.",
    "There's one question that nobody is asking... Are the most secret documents in this country that unprotected that a person can remove so many of them that they need a truck (or several trucks) to transport them?",
    "As a Filipino I supported Uganda and their Country to Protect their Families for Outsider that imposes their Cults and Narrative that destroys society..Alphabet Colored groups destroys manliness of a man and Gracefullness of many women, Both are the main builder of a country .Alphabet Colored community can not defend a country for many wars or make a Revolution it is always Men and women..LGBTQ is an insult to both Men and Women that created a Nations.",
    "Trans Kids under a religious house hold: Your being swayed by the devil, this is afront to God!\n\nTrans kids in a Reps household: Your being grommed by the democratic and the woke crowds\n\nTrans kids in my house hold: I support your decision, now back to your chores",
    "Biden is not feeble, experimental covid shot stops transmission!",
    "Thank you Dems for standing up to the histrionics of the cult loving lying nazi republicans. All the men need to check they still have 2 as this seems to make them so nervous that they may lose them if they support trans kids.",
    "If.....the US defaults on its debt, the Republicans are totally responsible for that disastrous outcome.\nMake them own it.\nBiden sticks to his position, and if the economy is damaged, it is solely/totally down to the Republicans. This fact has to be transmitted nationwide.",
    "Biden effectively out-negotiated the Republicans, agreeing to small, near-term concessions in exchange for preserving a litany of major economic investments that make up the core of his case for reelection. He also got spending capped for the next 2 years including miliary spending, which was huge, instead of the enormous cuts Republicans wanted to everything except the military, which they wanted even more funding for, but didnt get any of it. Biden and Dems traded adding work requirements and raising the age from 49 to 54 for Govt assistance for single people without dependents (very few of whom qualify anyway), with NO work requirement AND an increase in coverage for all homeless and all veterans. \nAlso, the debt ceiling won’t need to be negotiated again until after Biden’s name is on the ballot one final time — effectively removing the main leverage point Republicans had before the next election, now it's off the table until 2025. Dems weren't going to add anything more to their gains for the rest of this Congress anyway, since they dont control the House. Biden and Dems took Republicans to school in these negotiations, which some argue should never have been agreed to, but those people just cant accept the reality of divided Govt and Dems not having control of the House, and only the Senate by one vote. Biden and Dems got a FAR better deal than most thought even possible. Biden and Dems get stuff done...MAGAs and Republicans attack LGBTQ people, the poor and working Americans, students, and women's bodily autonomy and reproductive choice.🤔🤷‍♂💯",
    "He loves Putin because Putin said he was 'very bright'. But it was a translation mistake. Putin meant 'bright' as in loud, colorful, tacky, kitsch.\nBy the time the truth emerged Trump had praised Putin too much to back down without revealing his stupidity.\nHannibal Lecter NEVER said 'I love Trump'. Not Anthony Hopkins (who has said he's not a fan). Not Brian Cox (who repeatedly announces his hatred of Trump)\nand not Mads Mikkelsen (who has voiced incredulity concerning how anyone could vote for Trump).  So one mistaken and one fabricated compliment BOUGHT Trumps love.",
    "If actions speak louder than words, then what do they say about people that vote for people that support open borders and the tens of thousands of deaths and rapes of women and children, that are directly linked to it each year? What does it say about people that vote for people that are have no problem with sacrificing our country's energy independence, its sovereignty and its ability to defend itself in times of war and at the same time force huge costs of living on the people of this country, just so they can feel good about themselves promoting electric cars or their so-called green agenda, which isn't green at all. What does it say about people that vote for people that promote the killing of babies as they are being born and even after they are born? What does it say about people that would vote for people that are fiscally irresponsible to the enth degree? And what does it say about people that vote for people that are war mongers and that are pushing our country and the world at large towards a nuclear war? And what does it say about people that vote for people that promote the belief its proper to force the LGBTQ agenda and how to be a proper racist on our grade school children. In my opinion, what it all says is they are  nothing but brainwashed bots, with a reality that has been implanted in their brain via subliminal messaging, via indoctrinating practices by our education system,  by the propaganda machines commonly known as the social media and news networks, by Hollywood and by corporate advertisements reaching into every American's home. You on the left have been brainwashed into believing in the absurd.",
    "I cannot believe how poor of a memory Americans have. They forgot why Trump was denied a second term by a landslide 7 million votes. Trump mishandled Covid-19, he failed to act on Covid soon enough and it resulted in a pandemic killing 600,000 Americans and destroyed the economy. There were 2.5 million jobs lost. Maybe if I asked Trump questions in debates people would see the failure trump is: Here are my questions:\r\n\r\n1. Mr. Trump if you are reelected will you promise to do a better job responding to a new virus? You were warned on Dec. 19th of a deathly virus escaping a lab in China while you were golfing and your only response was it was a democrat hoax and you did not do anything until Jan 13th 2020 when you put in a no fly order but 400,000 people already entered our cities from China from Dec. 19th to Jan 13th to infect the whole country.\r\n\r\n2. Mr. Trump when you ran for president in 2016 you said you would bring in the best to solve problems but you ended up firing over 50 of them. Will you, if reelected, make a better effort to bring in the best?\r\n\r\n3. Mr. Trump when Michael Cohen was released from prison he said he was releasing a tell all book so you ordered the DOJ to rescind the release and remanded him back to prison to stop the book release. If you are reelected president will you promise not to weaponize the DOJ to go after anyone you perceive to be a political enemy?\r\n\r\n4. Mr. president in 2020 you lost the election by 7 million votes and claimed the election was a fraud and stolen from you. Your team went to court with 59 cases but failed to show any fraud that would reverse the results of the election. If you lose in 2024 and you cannot find fraud will you again scream the election was stolen or will you respect the peoples vote and assist in a peaceful transition?\r\n\r\n5. Mr. Trump when you left the White House in Jan 2021 you took many boxes of top secret documents, and when the FBI asked you for their return you only gave them a portion of them and lied about having more. If reelected president will you follow the procedures for handling sensitive top secret documents?\r\n\r\n6. Mr. Trump, when Obama left office he warned you that Michael Flynn was a double agent working for Russia and Turkey, but you ignored that and hired Michael Flynn to head the NSA just to fire him two weeks later. If reelected will you promise to take the advice of prior presidents and not put double agents in charge of national security?\r\n\r\nDave Clark",
    "So far this year there has been about 3000 school shooting... Of all of those shooters only 3 have been trans... Republicans keep fixating on a single attack on a Christan school.",
    "The country has a profound responsibility to reaffirm its unwavering commitment to the rule of law and demonstrate, without doubt, that the idealized vision of America is not just a distant dream but a reality it is determined to protect. To achieve this, it is crucial to ensure that justice is served fairly and unconditionally, especially in the case of individuals like Trump.\r\nBy holding Trump accountable through a just and impartial legal process, the nation would not only uphold justice in this particular instance but also send a strong message to deter similar occurrences in the future. This would demonstrate the country's firm stance against any violations of its laws and principles, regardless of a person's status or influence.\r\nThe significance of this effort cannot be understated, as it would reinforce public trust in the democratic institutions that form the foundation of the American ethos. Upholding the rule of law and safeguarding core values are vital for preserving the integrity of the nation and ensuring that its citizens and the international community can rely on America's commitment to fairness, justice, and equality.\r\nTherefore, it is incumbent upon the country to embrace this opportunity to reassert its dedication to the rule of law and make a resolute stand against any transgressions. By doing so, the nation will not only strengthen its own democratic fabric but also inspire the world with the enduring power of justice, integrity, and the American spirit.",
    "Why did Israel benefited from a man like that including his grandson by marriage who is Jewish and Richer now from all that money he makes with Saudi's we are being deceived  and this is being staged to market to the next generation in stereotypical race baiting annoying movies I hated from I was a child and it's going to be said trump hated Jews he hated blacks he hated gays I can just predict right ahead of time and instead of explaining in a better way he doing and playing in all the narratives that it was designed which he is complicit it along with a party that I hated for destruction of my life  from I was a  child narrative this is a con and you guys know it you know it and is playing into this movie that real lives are being stunted loss and destroyed From it and you guys don't care",
    "When 1 person holds hostage a political process he's weakening the nation's safety & security, health & welfare. It's not democracy in action, it's selfishness. A Clear & Present Danger  & worthy of action beyond censure, now deserving of expulsion. It's a DTO move from a DTO. It's more proof of a \"Party\" no longer worthy of \"participation\" in American politics.\nThe GOP is an organization of PERVERTS:\nThey have PERVERTED, poisoned & polluted the political process by polarizing & politicizing everything they can to try & divide. They've diminished the legitimacy, integrity & credibility of Congress, the Presidency, and the SCOTUS & just about every Federal Agency & Department imaginable - including the Secret Service, FBI, DHS, Inspectors General & the Pentagon, the IRS.\nMore important: The complicity & culpability of the GOP - they are American democracy's cancer, Trump only a dangerous tumor.\nThe GOP brand has been damaged beyond redemption & rightfully so. They are responsible for the downward spiral of civility, ethics & morality in American politics over the past 60 years. They are the primary source of disinformation, distortions, distractions, subversion, obstruction, sabotage, and selective \"law\" that only benefits their party in spite of what's best & desired by the majority of Americans.\nDecent \"Conservatives\" need to find a different Party to join that can legitimately participate in American democracy. This means they must be willing to lose gracefully & accept the peaceful transfer of power IN ADDITION to demonstrating a connection to truth, logic, facts & reality - MIA from the GOP which is now a DTO worthy of expulsion via an attempted coup resulting in insurrection - both acts of sedition - and treason.\nThe reluctance or inability of \"Conservatives\"  to acknowledge facts, truth & reality in a timely manner is what makes them a Clear & Present Danger to the safety, security, health & public welfare of America - and human existence on Planet Earth.\nThe majority of the GOP has clearly indicated that they are endorsing cheaters (& cheating) to win elections. And \"Party over Country\" as their philosophy. And that rot extends from their corrupt greedy, hypocritic \"leadership\" at the top to their brainwashed, blindly allegiant, ignorant, gullible, duped bottom. THE BARREL IS ROTTEN TO THE CORE.",
    "Maybe now he can get that brain transplant that he so desperately needs.",
    "There is also an underlying assumption which should be called out - that the transfer of skills could only have been in one direction. This is false, but also unsurprising as racists tend not to be knowledgeable people. \n\nTo give an example directly responding to DeSantis unsubstantiated reference to slaves learning to be blacksmiths. Metallurgy has been practised in Africa for thousands of years. In traditional West African societies blacksmiths make up a caste. See New Scientist article from this month: \"English industrialist stole iron technique from Black metallurgists. A process for converting scrap metal into high-quality iron, which was crucial to the Industrial Revolution, was devised by Black metallurgists who were enslaved and transported to Jamaica by the British.\" A non-paywall Guardian article (\"Industrial Revolution iron method ‘was taken from Jamaica by Briton.’ Wrought iron process that drove UK success was appropriated from black metallurgists, records suggest\") contains a link to the study.",
    "\"Stultus spectat ad res, sapiens spectat ad experientiam.\"  Translated: \"The fool looks at superficial things, the wise look at experience.\"\nActions speak louder than words.  Biden emphasized, \"Our actions must lead the way.\", but so called \"journalist\" are not interested in action and facts, they prefer controversy and rumours: better for the audimat.",
    "Focusing hatred on gays is an age old distraction. That gets peoples attention away from the real troubles in society. Such as rampant hunger and corruption. It is not based on religion or morals. It is all bread and circuses and a real danger to the globe.",
    "NOTE: The death penalty was ORIGINALLY supposed to apply to ALL LGBTs but the Ugandan government faced enough backlash to \"reduce\" it to the HIV positive and those having relationships with minors.\n\nWhich also means two LGBT teens seeing each other are ALSO subject to the death penalty. Only right wing trolls and fundies find nothing wrong with that.\n\nBrought to you by American Evangelical missionaries in Uganda.",
    "He’s probably the only one who buys into his own lies! It’s another transfer of wealth from the poor and middle class to the wealthy, like his donors. No one’s buying it!",
    "Here's what ChatGPT gave me. You're already doing a great job, MSNBC &  other honest media. AND the courts are now on board too, helping to expose and stop it. Let's keep up the good work. =)\n\n\"Past examples of successful defeat of verification reversal by politicians have involved various methods, including:\r\n\r\nFact-checking and evidence-based rebuttals: Independent fact-checkers, journalists, and experts have played a crucial role in debunking false claims made by politicians. By providing verifiable evidence and presenting factual information, they can challenge and counteract deceptive tactics.\r\nExample: During the 2020 U.S. presidential election, numerous fact-checkers and media organizations extensively debunked false claims related to voter fraud, which helped to clarify misinformation and prevent its widespread acceptance.\r\n\r\nTransparency and disclosure: Demanding transparency and accountability from politicians can help defeat verification reversal. Requiring politicians to disclose their sources of information, provide evidence for their claims, and be transparent about their motives and biases can highlight potential deception and create public awareness.\r\nExample: In the Watergate scandal in the 1970s, investigative journalism, legal investigations, and demands for transparency exposed the deceptive actions of politicians involved in the scandal, leading to resignations, indictments, and significant consequences.\r\n\r\nIndependent investigations and inquiries: Independent investigations conducted by non-partisan bodies or commissions can uncover the truth and provide evidence-based findings, reducing the impact of verification reversal by politicians.\r\nExample: The 9/11 Commission Report in the United States, which conducted an independent investigation into the September 11th attacks, provided a comprehensive analysis of the events and debunked conspiracy theories, helping to counteract misinformation and deception.\r\n\r\nPublic engagement and awareness: Educating the public about critical thinking, media literacy, and the tactics used by politicians can empower individuals to question and verify information, reducing the effectiveness of verification reversal.\r\nExample: In various instances of political propaganda and disinformation campaigns, public awareness and vigilance, including grassroots movements, social media activism, and community mobilization, have helped to expose deceptive tactics and prevent the spread of misinformation.\r\n\r\nCollaboration and cross-validation: Collaborative efforts among different stakeholders, such as journalists, fact-checkers, experts, and the public, can enhance the verification of information and provide a more comprehensive and accurate assessment.\r\nExample: The International Consortium of Investigative Journalists (ICIJ) collaborated with journalists from around the world to uncover the Panama Papers scandal in 2016, which exposed widespread tax evasion and corruption by politicians and elites, using cross-validation of evidence and information to verify the claims made.\r\n\r\nOverall, defeating verification reversal by politicians often involves a combination of evidence-based rebuttals, transparency, independent investigations, public engagement, and collaboration among different stakeholders to uncover the truth, promote critical thinking, and hold politicians accountable for their deceptive tactics.\"",
    "As a transwoman myself I am so proud of these leaders and thankful for their tireless work. \n\nTrans people exist and deserve the same respect and human decency as all other people expect and deserve.",
    "If enough Americans vote in extreme right wing MAGA candidates... isn't America just deciding that they choose fascism over democracy?  Maybe the country SHOULD split into Red or Blue states.  Red states would ban abortion 100%.  Mandate that all its citizens MUST carry firearms 24/7. Close libraries, redefine the 1st Amendment,  scrap every social program; social security,  medicaid, medicare, all of them.  Overturn any and all regulations.  Go it alone.  BUT they would not get a dime in transfer payments from the Blue states.  Liberty is what you make it.",
    "I’ll never understand why they are targeting trans kids. They are not doing anything wrong and to deny health care to anyone is cruel. The gop is nuts. Just a bunch of white males feeling scared about anyone not confirming to them.",
    "I think the only remaining “ ism”in America is ageism.  People just mock older Americans in every way that would not be acceptable if it was about race or being overweight or being LGBTQ etc. they don’t talk about Warren Buffett. They don’t talk about Anthony Fauci they don’t talk about Joe Biden‘s accomplishments, so disrespectful and non-evidence based.",
    "It is surprising to see Democrats using tactics Republicans have been using since the 1990's.\nMost Democrats hold to the quaint \"old rules\" where they expect give and take. Republicans have been using scorched Earth tactics since Newt Gingrich and the radical wing took over the Party. Interesting to see some new Democrats deciding to take the battle right back at them. \nUnfortunately, I didn't know there were enough Democrats in Nebraska to support any kind of inclusion of trans people. Let's hope they don't get hammered in the next election.\nI would never expect using Republican tactics against them to ever teach them anything, because they will just double down and use anything the Democrats do as an excuse to do worse. But at least the Demos won't get pushed around so much.",
    "The GOP have literally nothing else on their minds but hating on women, trans kids, and the underserved. Just because you don't agree with something, or even have an aversion to it, should not mean every one else has to go along. This is called \"Dictatorship.\"",
    "Obviously everyone needs healthcare and stopping people from obtaining it is not OK. But then again healthcare is paid for by insurance companies and if being trans or helping with trans transitions or trans complications then just like any healthcare insurance, they are stated as cosmetic healthcare. Maybe they should explain in detail what is stoping healthcare for trans people rather than just pointing a petty finger. And if what is being stopped is purely cosmetic or problems caused by transitioning to trans, then this pettieness needs to stop. If i cant afford teeth whitening by a dentist, maybe i should just take better care of my teeth in the first place.",
    "Lets get down to the MEAT 🥩 of this. HE BEGAN WITH ASSAULTING WOMEN; then villains said let’s make it LAW! SEEK & DESTROY PATHOLOGY: ISAW THIS IN 60 SECONDS! There is a Criminal Consevative Paying him also; EXACTLY like Clarence Thomas. It is cheaper to BRIBERY SOMEONE THAN IT IS TO BECOME MORALLY, ETHICALLY ACCOUNTABLE FOR OIL SPILLS & TOXIC DUMP SITE CLEAN-UP. Why are they screaming about gays abortion rights and owning liberals human beings?😮🦖🥸🤬😭🫣🤥🤢🤮🤢🤮🤢🤮🤢🤮",
    "Re: no \"legitimate goal.\" There is a \"manifesto\" of Putin I saw reported, a year before his invasion, citing reunification of the Moscow Orthodox Church over the Ukrainian Orthodox church, especially to end the \"horror\" of, in essence anything LGBTQ. In addition to the typical invader script, they are Russian anyway. Which raises the question, but they are LGBTQ Russians?",
    "Yesss!!!💯\nI pray for Uganda.\nI salute Uganda.\nMy highest respect to Uganda.\n\nMeanwhile so called powerful countries are getting shyt everyday by their alphabet ppl, already so many confused and butchered children and teens, and they're still debating, still figuring out, still wondering what to do 💬🙄💬🤔💬 and yet...\n\nBreaking news: Uganda just enforced extreem anti-lgbt law.\n\n💬🙄💬🤔💬\nHey let's talk about that! I think we must unite against it!🎉🎉",
    "Legally, under the 14th amendment, trump as a participant/antagonist of an insurrection/riot and trying to block the transition of power of an election cannot run for president. Plus pardoning oneself should not be allowed. still thinks he's untouchable🤡",
    "This is an excellent example of how to peacefully make a point.  The Israeli protests is another great example and we may have to follow their example in order to get meaningful legislation passed in the House and the Senate.  Shut the country down with peaceful protests for gun control legislation, for a woman’s right to choose her own medical care, and for the LGBTQ communities around our country to be able to have the medical care they need.",
    "Uganda is not the first country opposed LGBT rights most American businesses partners middle eastern countries ( Saudi Arabia Qatar etc ) passed rule LGBT panfish by death 🤔 why America silence for those countries?????",
    "Rachel, you're a bit behind the times, love. Transnistria broke away from Moldova in 1990. Putin is to the Russophile separatists behind the breakaway, what Trump is to MAGA. Ditto the separatists in the self-proclaimed republics in Ukraine's Donbas, Luhansk and Donetsk, who have been trying to break away since 2014 in the wake of a popular uprising that kicked out a Kremlin puppet who sabotaged Ukraine's application for EU membership in favour of closer ties to Moscow. Meanwhile, Georgia's civil war with Abkhazia and South Ossetia first flared up in 1992. In 2008, it led to a Russian invasion and the short-lived Russo-Georgian War after a number of deliberate provocations by the South Ossetians.\n\nThe fact is that after the break up of the Soviet Union, majority ethnic Russian regions of the newly independent (or in most cases, once more independent) countries refused to accept that they were no longer Russian citizens. Putin, for his part, has always refused to accept the demise of the Soviet Union and wants to reconstitute it. Over the last quarter of a century, the two things have converged as Putin has supported the separatist movements to both keep the former Soviet republics in a state of instability and to provide him with a _casus belli._",
    "Janet Yellen was the moron who incorrectly called the inflation transitory when most others were saying it wasn’t. She failed as chairwoman of the Federal Reserve and she has failed so far in her job as a Biden economic official.",
    "I love it! \"Established as fact\". Like Rachel going on TV and telling everyone: \"The vaccine is 100% effective. It stops the virus dead in its tracks. It makes it impossible for you to transmit it to someone else\". Apparently you positive commenters have a very short memory, or her lying to you is acceptable because she reinforces your beliefs. \n\nRothschild, Bronfman and Oppenheimer financed Murdoch to build his media empire. They are fiercely loyal to the Likud party in Israel. Other Jewish internationalists own all of the other main stream media. They are loyal to the Labor party in Israel. No one in the legacy media will dare to criticize Israel. \n\nGlenn Beck and O'Reilly were war mongering Neo-cons. Tucker admitted on air that he was wrong to support the wars in Afganistan and Iraq. Has Rachel ever apologized for lying about the vaccines? FOX is a pretend opposition to the other media outlets. Firing Tucker reveals the sham. Big Pharma is the biggest advertiser on ALL of the networks. They can't have Tucker interviewing RFK jr. and tell the truth about covid and the vaccine scam. The lawsuit between Dominion and Fox was an act of collusion. Dominion voting machines are connected to the internet and not only can be hacked, but were hacked. Mike Lindell's \"Absolute proof\" exposed it  The video \"2,000 Mules provided other evidence of fraud. FOX wanted nothing to do with \"Absolute proof\" nor 2,000 Mules. They are in on the fix. You and I are the target of the corruption.",
    "There's no good to be found in dehumanising and criminalising entire communities of people, i.e. LGBTQ people, who have done no harm to anyone.\n\nThe Ugandan government are proving their are full of monsters.",
    "I' just turned 62 ,I admit that i don't understand a great deal about Transkids or adults , but I do know that being Trans does not make you any less a human being, it doesn't make you any less deserving of being treated with basic humanity. in other words I just shut up and treat Trans people like .......well like people because that is what they are .",
    "If there is no man above the law, this includes the Supreme Court.  There must be oversight and transparency with the personal and professional dealings for the membera.  They must be held to the highest standard as they are the highest court.",
    "RON DeSANTIS 2024.\nWE NEED AN PRESIDENT WITH VALUES AND PRINCIPLES NOT AN🇵🇰 LGBTQ🏳️‍🌈 SUPPORTERS. \nROMANS CHAPTER 1 VERSES 25/32.\n↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️\n\nJOHN 3:16⏳👈 \n2 PETER CHAPTER 3⏳👈\n((( GALATIANS CHAPTER 6 VERSE 7)))\n👆👆👆👆👆👆👆👆👆👆👆👆👆👆👆👆",
    "What a joke can’t be bought !   He’s transactional…it’s all about the money…follow the money…",
    "America’s Image Abroad Rebounds With Transition From Trump to Biden : Pew Research Center \nThe election of Joe Biden as president has led to a dramatic shift in America’s international image. Throughout Donald Trump’s presidency, public's around the world held the United States in low regard, with most opposed to his foreign policies. This was especially true among key American allies and partners. Now, a new Pew Research Center survey of 16 public's finds a significant uptick in ratings for the U.S., with strong support for Biden and several of his major policy initiatives.\n\nDonald Trump ? Well  he's going to prison .",
    "Age is no reason for attacking Joe Biden's mentality or abilities. I'm a 90 year old woman and am depended on to transport others in my own car and help in many other ways. I'm just a small example of strengths different people have regardless of their age! \nBiden loves his fellowman and will continue doing the best for our democracy --  AND he isn't a narcissistic, demanding absolute loyalty to himself as Trump does!!!\r\nNews reports re. Biden's mentality BECAUSE of his age, give the younger Trump a pass regardless of what he says or does is ignorant. News programs shouldn't highlight Biden's mentality, while saying practically nothing about Trump's mentality!!! It's obvious who has the sharpest brain! Trump is given a pass on what he said about Classified Documents, and THEN in the end of his POTUS, fought to keep tons of Classification Documents he'd stolen, claiming they belonged to him!  Age is relative...we all age differently!",
    "All we hear is politicians and press talking about trans kids and never hear or see parents and kids. I suspect before high school and kids reach 16 and pre-adult status there are few that are clued in on it and the press and DeSantis probably are responsible for cluing in most. And there are far fewer who actually qualify and parents probably are involved in most of these (probably less than 100 nationally) cases, there are probably more sub-16 year olds killed by violence annual than there are trans kids of this age total, not added to the total annually.",
    "As an African man who has been raised as a Christian, I knew how gays feel because I'm one, it can only be god who made people to be homosexuals, if it is not god then it is aliens. Lack of knowledge from African leaders is the downfall of a nation. Homosexuals should be left alone, they bring no harm and also reduce overpopulation by not procreating, wrong move Mr president",
    "First they attack LGBTQ then they come after you! They are not pro life they are all about book burning, guns and bigotry. School shootings mean nothing to republicans. If it did they would make proper back ground checks mandatory and they would restrict automatic weapons and assault weapons.",
    "Think about this. British PM Boris Johnson was kicked out for violating covid quarantine laws and lying.\nThe US needs electoral reform with disbanding Electoral College and centralized fed elections, a stronger press, and a better educated electorate. This would transform to better candidate quality. Oh yeah, and a will to honestly serve the people, although I accept this is a novel concept!",
    "Transgender LGBTQ+ Activist Charged For Sexually Assaulting Two Boys Under 13",
    "Most countries consider it transparency, something we don’t get with the Biden administration.  The media just wants one side of the story out, but we do have a first amendment in the country, also innocent until proven guilty. Their election interference is not right.",
    "All you people are so proud that democrats are shutting down their  legislature because an “anti trans” bill bans the genital mutilation of children…. Right? Stop calling it “anti trans”, stop calling it an “attack on trans kids”… you think a law against cutting off your child’s genitals is attacking them??? Kids can’t smoke, drink alcohol, engage in relations with adults, join military, rent cars, drive, sign contracts… BECAUSE THEY’RE KIDS!!! They don’t know what they want yet! This bill only backs up everything else that I listed. Because kids don’t know what they want, and even if they did, they cant make those decisions until they become adults. You people are fighting to make kids adults. Kids with tattoos, kids with drug problems and kids engaging in sexual conduct. You people make me sick! And if you don’t support kids doing any of the things i listed, then draw the line between what you do support and this bill. Enlighten us as to how genital mutilation is good, yet driving a car, getting a tattoo, smoking, doing drugs, drinking alcohol, sexual relations with adults, or joining the military is still bad.",
    "In, The United States of America Vs Donald J Dunce,\r\nthe only chance Dunce has of winning this case is to\r\nconvince a court that, Antifa, Black Lives Matter, \r\nremnents of CRT, and LGBTQ militias funded by George\r\nSoros dark money funded through Venesualian dark sites\r\ncolluded to steal classified documents and plant them \r\nin Mar-a-Lago with the intent to discredit Dunce and\r\ndestroy his chances of being reinstated in the White\r\nHouse. And, being represented by the renowned counsel of \r\nAttorney Clarence Darrell. As, I have stated in previous \r\narguments before the court, and to quote an equally \r\nreknowned Attorney:  \"If it don't fit, you must not have \r\nput it on right.\" And, I have every confidence that the\r\nformer, ex-man will come out of this like any other former\r\nside show geek who endeavored to pull himself up by his\r\nown bootstraps.\r\n                              -- Denny Craine",
    "gee whiz why? don't they know what bootstraps are and how to pull themselves up by them? trump fixed everything about healthcare within days of taking office just like he promised! all of his work must have been sabotaged by transtifa, the Transexual wing of the militant grooming wing of those terrible people that don't like fascism",
    "All this crap just shows that the US is not a democracy but a kleptocracy. There is zero accountability for all the people causing the real problems in the country (the wealthy, the politicians, etc.) Those in leadership positions (religious, financial and political) have completely and utterly failed the citizens of the country due to their own arrogance, greed and lack of integrity. Disgusting! Why are taxpayers having to pay their hard-earned dollars to pay the salaries of incompetent politicians, especially ones who are using that funding to tear apart the country?? We need leaders that are wise, knowledgeable, empathetic, intelligent, caring and thoughtful with a high level of integrity, self-discipline and a high-level focus on truly serving the community, city, country and world we live in.  We need judicial systems that dispense justice without obstruction from political parties and laws that are completely transparent and applicable to everyone regardless of their financial background.",
    "First n foremost... Trump - the vile excuse of a tangerine human being - had forewarning of what his BFF Vlad - who he still has on speed dial, along with Kim!!! - was going to do, and I would Love to see evidence to the contrary, that Vlad Did Not tell Trump what his plans were .... Remember that meeting they had when Trump ordered his staff to leave the room and so it was just Vlad and His staff translating etc... ????? But if course there will never be evidence to the contrary because Trump was alone with Vlad and his staff. \n\nThis guy needs to be silenced!!! And Quick! Irrespective of the fallout. He and his words need to be considered as a terrorist organisation and one of potential violence. When will the US wake up n smell the coffee!?! It's infuriating from my side... One of those judges needs to grow a pair and lock him up!!!",
    "Just move out of the way and allow a REAL proven leader to take over the helm: RFK. this redundant overplayed democrat-republican BS is just that... and it gets us deeper into division and corporatocracy while RFK begins to transition us away from this left-right waste.",
    "bigotry in all its forms is what drives Republican voters, and the blacks that support Trump hate the LGBTQ movement, and misogyny among black males is enormous (ever listened to some hip hop lyrics?). \n\nWithout bigotry there would be no Republican Party. This was never difficult to figure out.",
    "Does that mean that if a trans person is stabbed the hospital would \"legally\" be able to refuse to treat the stabbing? Or the gunshot? Or the ruptured appendix? They didn't specify only refusing to provide trans procedures, I noticed that. This means that if they come in following an accident, the hospital could refuse to treat her wounds. Whatever happened to \"First, do no harm!\"? Hippocrates is spinning in his grave. Aescalapeus is shaking his head in wonder at the stupidity on display in this bill. This is legislatively sanctioned murder for hire.",
    "Black voter here, just came from watching Greg Foremans video on this. You democrats really believe this? Biden has failed America, things were better under Trump. It's not that hard. We have worse crime, worse economy, dei being a priority over merit, a joke of a border, and awful woke policies affecting children in the name of uplifting the lgbt community? All that's going on and you actually think it's about race? Why does someone like me want Trump in office then? Learn some critical thinking people.",
    "\"YES! AND YOU DON'T HAVE THE RIGHT TO VIOLATE DEMOCRACY, Rudy, LIKE YOU DO WITH YOUR LIES AGAINST THE PEOPLE OF THE USA AND DEMOCRACY! THEY SHOULD PUT UP WITH YOU TOO!\nTHEY LIE, WITH LIES TO DESTROY THE USA AND ALL THE SOCIETY THAT LIVES IN THE USA! HYPOCRITES! DONALD AND OTHERES, WHO WANTS TO TRANSFORM THE USA INTO BANANA REPUBLICS, WITH LIES AGAINST DEMOCRACY! THE BEST THAT COULD HAPPEN TO THEM WAS TO PAY MILLIONS IN FINES AND PRISON! SCOUNDRELS",
    "A contested convention is a sign of the serious dissatisfaction of party members.  That dissatisfaction results in the inability of people to align behind a candidate and that causes the contested convention.  That dissatisfaction and inability to align behind a candidate results in people being unenthusiastic about voting, so they stay home and the party's candidate loses the election.  \nThere is a fair amount of misinformation in this.  There is also a fair amount of voter shaming.  \nI am a Bernie supporter.  In 2020, after the DNC put their hand on the scale for a second time, I switched my party affiliation to the Green Party in protest. I fully intended to vote for Howie Hawkins until Trump would not commit to a peaceful transfer of power during a Presidential Debate.  Then I relented because we could not allow Trump to stay in office regardless of how I felt.  \nThat said, Biden has been better than most people have given him credit for.  The Biden admin has forgiven several billion dollars of student debt for several million people.  While Biden stopped the railroad strike, his administration continued negotiations between the railroads and the unions and got many of the concessions for the unions.  Not to mention, Biden's department of labor has been fantastic for workers and unions.  The infrastructure bill, while not perfect has been great for the economy.  The biggest current problem has been in the middle east where a spoiled child has been abusing it's poor neighbor for generations and the spoiled child is unwilling to stop because they are used to their favored status that caused them to be spoiled.\nI appreciate the people that running in the Primary against Biden (not RFK Jr. though) but they were always going to lose.  Cenk Uyger is plainly ineligible though, the Constitution the same way a 20 year old is ineligible for office.  I like Marianne Williamson, but she lacks the job experience that Biden has.  Both of them running and the votes they get send Biden a message about what people want.  I will likely vote for Marianne Williamson to strengthen that message.  But in the general election I will vote for whoever has the best chance of beating Trump, even if the candidate that had the best chance was a unsliced loaf of bread.",
    "Lol we do know there is proof of you trying to cover up the lab leak theory.....lol \"for reasons that are complicated we don't have the answer today\" translations \"I dont want to go to jail so they won't give up the evidence\"",
    "One of the Popular Mottos amongst Trans Activists is “Trans Rights or Else” with guns emblazoned on their shirts in a clear threat of violence to anyone who dares oppose their beliefs! \r\n\r\nThis is not a ‘kind’ ‘inclusive’ movement. This is a Terrorist Organisation and should be treated as such!",
    "What it represents is big tech backing Biden, will be paid back 10 fold after Joe elected again. Just like Warren Buffetts railroad was when Biden shut down the oil pipeline, now that oil is transported by rail. Buffett gave MILLIONS to Biden campaign.",
    "It just shows a number , a lage number , of Americans wanna tear down the foundations of our country. I've been in court. I've payed the price for my transgressions, sometimes I feel like I've been unfairly treated because of my youthful ignorance of the law. That said, I don't think tearing down the legal system is any answer. Reform ? Sure... all cops ain't great,and early education on what you're rights actually mean at the High school level would be a great idea. I'm 63, retired, and living on my sailboat. I got covid 3 times and recently broke both arms ,which precipitated my retirement,  life has been tough and because I use to get into trouble I'm kinda stuck, but I still believe in what America stands for even though we haven't achieved perfection. Who has ? I hope we can get past the hate the GOP and the criminal former \"President\"**** have normalized since 2016. Nothing I've ever done has come close to the damage done,and being done , by ignoring obvious corruption and , likely the security of our country, previously by Trump, his children (the adults. Guess the next generation can determine what Baron learned from his father) ,and his \"R friends in Congress \". I don't have a vote. They say I do, but with DeSantis as Governor of Florida? I ain't chancing it. Time to root out the criminals that \"lead\" this anti-law ,pro-dictator , from the inside of our Congress, and off the ballot. I faced my music. Capt.Bob, SV ( Sailing Vessel) 27th Chance, Tampa Fl, USA 🇺🇸",
    "Translated to English - we are gonna make money on the 90 million dollar bond, but with the 500 million bond we wouldnt, because TRUMP DOES NOT HAVE THE CASH OR COLLATERAL TO COVER IT. Period. These companies KNOW",
    "Transphobia is a mental disorder and it’s completely Anti Christian. \n       Jesus would have zero problem with Trans people. But not everyone wants to be like Jesus. Hate must be very satisfying for those folks.",
    "The gays always say wher will we go ? Thy must move to an island or america that loves them so much..😂😂😂😂.\n\nGive them an island....or the west must give them visasa...United states and the west must take them in thy love abnormality\n\nThe western countries is their defender thy must Give them visasa",
    "Thank you, Republican Trump staffer Cassidy Hutchinson, for your brave testimony regarding the Jan. 6 2020 insurrection.  With your testimony you honor your oath to protect the US constitution and the constitutionally protected transfer of power. 🇺🇸",
    "The first to coin-“Let’s make America great again!” :\n\nRONALD WILSON REAGAN 666\n\nDONALD JOHANN DRUMPF 666\n\n“THE NUMBER OF A MAN”\n \nONE AND THE SAME-SYMBOLIC OF CAPITALISM \n\nAMERICA IS MYSTERY BABYLON \n\n“WRITTEN” ON HER “FOREHEAD” ~ MAGA \n\nTRUMP IS REVIVED FROM REAGAN \n\nPUTIN IS REVIVED FROM GORBACHEV \n\n“HE WAS, IS NOT, YET IS”\n\n“HIS DEADLY WOUND HAS HEALED”\n\n(Do you remember the birthmark on “Gorby’s” head that looks like he was killed through the head with a sword?)\n\nCOLD WAR IS BACK-THIS TIME RUSSIA WINS \n\nREMEMBER-THE HARLOT “RODE” THIS BEAST \n\n“Conform no longer with the pattern of this world, but be transformed by the renewing of the mind.”\n\nThe Holy Bible \n\nWhen Trump gets back in the White House, he will “CONFIRM” the Abraham “Peace” Accord he started in Israel. Then he will proclaim himself God-ABOMINATION OF DESOLATION-“THEN SUDDEN DESTRUCTION”!\n\nHe is Israel’s awaited messiah. THE Antichrist. \n\nNetanyahu (false prophet) is back ~\n\nBOOK OF REVELATION IS COMING TO PASS \n\n\nAntichrist “will be destroyed, but not by man’s hand, but by the brightness of His coming.”\n\n“Behold, I come quickly.”\n\n“Watch, therefore, and pray always that you may be accounted worthy to escape all these things that shall come to pass, and to stand before the Son of man.”\nLuke 21:36🕊\n\nMay God be with you.",
    "Republicans are not anti-trans…. They are just plain morons that can’t wrap their tiny minds around the fact that people are different. We know they are not actually worried about children’s well being…. Just look at the way they legislate gun laws.",
    "I am a white guy in Portland, and EVEN I think people I do not understand or with whom I do not agree can both EXIST and MATTER and am NOT under the impression the lives of these strangers has ANYTHING to do with ME. And I have multiple trans friends and exes, but if I ever decided they did not deserve to marry or even exist? That is not me having a POLITICAL DISAGREEMENT with them. That is me not getting basic human dignity and framing the people in my life as subhuman- and that would be a ME problem. If you think GOD may not approve? Let GOD handle it. He may NOT need your help, Karen.",
    "\"under Trump\" - someone needs to explain to Drumpfenstein's Monster, presumably with flash cards and Big Macs, that Israel never was nor will be that. This is a creature that met with Putin and Putin's translator without a single other American, including a translator, present, and destroyed the notes of an earlier translator who had attended his one-on-one with his handler.",
    "These people are all worried about kids being trans. How about you work on obesity??\nThere are too many overweight kids!!! How about we address their nutrition needs???\nHow about everyone minds their own business???",
    "I have seen and known we would get to this point even since 2016. It should’ve been put at the forefront in the media that Russia was using the Republican Party as a propaganda mouthpiece and encouraged them to advance culture wars. \n\nNo matter how much republicans rage against “woke” (which they can’t seem to define”) you can follow the same ideas back to Russia.\n\nYou can see how Russia treats its non compliant citizens. Or anyone who is even slightly different (POC, LGBTQIA, etc.). Russia, or more specifically Putin wants us to reflect them.",
    "Immunity without accountability nor transparency is a ticket for corruption",
    "\"where are we suppose to go\"?\n\ncanada, usa, german, france, australia... just choose, they like people like you there. \nor make your own country where everyone is lgbtv fukko. take a chunk of canada like jews take palestine",
    "MY TRANS POEM\r\n \r\nCan a lemon be painted green and then be called a lime? Or is it still a lemon?\r\n \r\nCan a horse be painted with black and white stripes and then be called a zebra?  Or is it still a horse?\r\n \r\nCan a grizzly bear be painted white and then be called a polar bear? Or is it still a grizzly bear?\r\n \r\n Can a man have his appearance surgically altered to look like a woman, and then be called a woman?  Or is it still a man?\r\n \r\n \r\nIn conclusion, never underestimate the awesome power of stupidity for those who think a lemon can be turned into a lime just by painting it green  \r\n \r\n\r\nFor the sane people, lets come together and pray for the innocent children:\r\n\r\nDear God, Our Lord:  Please prevent and protect the innocent children from having their bodies butchered and mutilated by their psychotic parents, insane politicians, deranged public school teachers and unethical, malpracticing doctors - all of whom are afflicted with  OTD  ( Obsessive Transgenderitis Disorder ).   In Jesus name, Amen.",
    "Today the dirty little secret of the whole Republican party became.\nSeen As they all voted on the same issue. Although they let the magna Wing, bring up the part. They don't wanna step up to hoping to hide themselves for when voting comes for their positions. They can double speak. Oh, we aren't the Magna end of our party. While they participate fully in the Magna.\nAgenda Deceit does have its transparency And it's always been there for the American people to see. And they blind them with their antics within the party",
    "🎯 Key Takeaways for quick navigation:\n\n00:00 🌐 *Trump's Business Pledges and Ethical Concerns*\n- Trump's promise to address concerns about business dealings and potential conflicts of interest.\n- Trump's assurance to step back from companies without divesting, allowing his sons to run them.\n- Ethical concerns and criticism regarding the lack of independence in Trump's plan.\n02:18 🏛️ *Risks of Corruption and Legal Implications*\n- Trump's plan did not ensure independence, leaving room for foreign money to reach him.\n- White House ethics veteran Richard Painter's concerns about Trump's global businesses.\n- Potential legal violations and corruption risks associated with Trump's financial entanglements.\n05:31 💰 *Evidence of Foreign Money Inflow*\n- Overview of the newly released report detailing over $7 million in foreign funds to Trump.\n- Foreign governments, including China and Saudi Arabia, directing funds to Trump properties.\n- Discussion on the dangers, bad policy, and potential illegality of accepting foreign payments.\n08:57 📈 *Trump's Transparency Issues and Legal Challenges*\n- Trump's refusal to release tax returns and challenges to his financial transparency.\n- Legal battles, including Supreme Court cases, over the disclosure of tax returns.\n- The flouting of tradition, history, and legal norms in Trump's financial disclosures.\n11:21 ⚖️ *Constitutional and Corruption Questions*\n- Examination of the legality and constitutionality of Trump receiving foreign funds.\n- Questioning the legal implications and potential violations of the Constitution.\n- The public's concern and the need for a separate analysis from political opposition.\n16:38 🔄 *Roger Stone's Involvement and Exclusive Video*\n- Overview of Roger Stone's involvement in plotting to overturn election results.\n- Exclusive video of Stone discussing Trump's failure to act during protests in Portland.\n- Stone's role in the efforts to challenge the election results and his influence on Trump's decisions.\n18:02 🔗 *Potential Link Between Militias and Trump Team*\n- Exploration of the possibility that Roger Stone was informed about militia plans.\n- Discussing the potential coordination between militias and the Trump team.\n- The ongoing investigation and efforts to establish a connection between the two.\n\nMade with HARPA AI",
    "This is part of the bigger plan and no one is paying attention to what is going on. The GOP has cause half of our nation that the voting system doesn't work and trying to blockade certain people to vote (if they had their way women wouldn't be able to vote either) so there goes our democracy, they took away over half of American's rights to bodily autonomy, they target the LGBTQIA community, now they are trying to weaken our military. All of these steps are weakening our Nation and making it easier for a dictator to seize control.",
    "She has done such a wonderful job. My bank account is filling, 401k record highs, food prices low, fast food cheap as ever, gas prices havent been this low in ages. We love you and hope you continue being stunning and brave. We need more trans rights though, this should be the next segment.!",
    "Nebraska is yet another very rural state that tends to vote overwhelmingly for Republicans, yet Republicans are only two seats short of having a supermajority. That's the reason why they can't pass that anti-trans bill which Gov. Jim Pillen would probably sign.",
    "We should have a Russian delegation to congress so that the KGB will not have to sneak around in the shadows and republicans can get their disinfo more quickly and on demand, so to speak, because the denials of Comer and the rest of the Russian agents have become tedious and transparently false. Having a Putin mouthpiece in congress will put the fascists at ease and make them complacent for when they are summarily arrested and dragged away.",
    "Full disclosure. I used to vote Democrat as did my hard-working parents. But *this is no longer my father's Democrat party! They've abandoned the middle class and push race and identity politics - and Socialiam - which is fundamentally un-American! Cancel culture, woke,  trans athletes making a mockery of Title 9 in girls/women's sports - Americans are sick of it! That's why Trump is leading in virtually every poll in virtually every swing state!*",
    "Sorry but is everyone crazy! This is not an easy issue to decide in 1 single bill and throwing a tantrum to block the work of everyone just because you don't get what you want is childish.\nI had a trans classmate in the UK she had to first get at least 2 years of therapy to see if she was sure she wanted the transition, they did that because she was young. \nThen at least 2 years of living as a woman and only when the doctors deemed her ready did she start on the injections. And I heard that she's had her operations done when she was 23 or 24.\nTransitioning isn't an easy process, children might decide to be non-binary, or they might want children later in life. It must be easy at an age that you think everyone is yucky and babies are gross to say that you don't want any, but how will a parent deal with a trans child blaming them that they can't have kids later on. And when it comes to parents, how do you separate the parent that sees a tomboy and decides she is a boy, or a boy liking dresses being called a girl. Nowadays when a post about a trans child gets so much views, whats stopping the family vlogger mom to start manipulating her child in some new form of Munchausen by internet? \nIt's not politicians but doctors that deserve to have their voices heard.",
    "I'm not surprised to see this and not surprised to see how the left media ignores anything about Biden corrupt deals. All we need to do is wait patiently because people who believes men can get pregnant and that trans are real women can't last forever and eventually they'll get more depressed confused and medicated and destroy themselves.",
    "The Republicans want to step on trans kids... nice to see someone stepping back... you don't give in to bullies... and the Republicans are being bullies... America is a nation with lots of Christians... but it is not a Christian Nation... Christian values are not law... nor can they be law... \nThe First Amendment: Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.",
    "Why are people fighting so hard to make children take life altering médecine ? Why is it so important to have trans kids ? There's a constant effort to bring into a young child these sexual decisions. They're just kids.",
    "So he says Newsom has no money but also if someone like Newsom was nominated Biden’s money could be transferred to Newsom. Kind of ruins his argument that someone like Newsom wouldn’t have any money.",
    "Metaphors, Arch Angel Micheal and the WORD of god, at war with the WORD of the devil 😈. The big WORDS that strike fear into the hearts of the perishables the chicken littles. It is a war and most common sense folks are fearful. WORD and the narrative of the warring oversight committee. Transgenderism and the cult elixir. Devil worshipers command the authority of the cult elixir. A drama 🎭concoction.",
    "Chris Christie has a great point about Trump sorting through the boxes instead of golfing. \nWhat about all the time Trump spent holding up the transition process, running the fake elector scheme (for which there also should be prosecutions of all involved) on December 14 2020 and preparing for that rally on January 6 2021?",
    "How come Maddow has never apologized to the American people (mostly black) for mocking them about jab hesitancy, saying if you get the shot, “you’ll never acquire or transmit the virus”??",
    "Russia cannot do anything with Moldova and Transnistria, it's a landlocked country between NATO and Ukraine, the part of Ukraine that borders Transnistria(Moldova breakaway region) is nowhere near the front lines and Russia was pushed further away from it last year adding the Dnipro river as an obstacle to get to it, At the current pace of the war without US provided rockets and artillery shells it will take Russia 20+ years to get to Transnistria so they could deploy the military. The most Russia can do is send soldiers to Transnistria on civilian planes in their civilian clothes and without weapons by the most roundabout flight plan.",
    "What is worse than Trump retaining \"military secrets\" as a profiteer? Well...\n\nOne thing's for sure. What does the public know today, thanks to transactional Don and Joe and Milley and Austin?\n\nBehind closed doors, the mil / intel establishment and both Presidents have clearly been planning for more war with even more potential for \"unanticipated developments\" and \"unforeseen consequences\".\n\nHere comes the bill!",
    "No surprise to see DJT using specific terminology to manipulate the public yet again. Lies can only  be combatted and squashed  with truth.  As soon as these entertainnent industry  strikes are done,  someone needs to step up to the plate and produce the acrual Enemy of the People play for televisions so the American people can actually learn what this phease means, and have the ability to learn when its being misapplied and misused as a  way to manipukate them. That aside, DJTs constant stoking of political violence continues to make him a clear and present danger to the  United States  The man must be held  luable for his transgressions in a court of law and his political aspirations ended",
    "Why are we trying to rehabilitate the guy who unleashed Trump on this country.  To his everlasting shame everything that's transpired since 2016 is on his head !!  Live with that Comey.",
    "MAGA Translation: 'Why are you so desperate and petty to be going back to Trump's OLD unresolved scandals when he already successfully buried them under hundreds of NEWER unresolved scandals in his relentless swamping of the brain with TOO many unresolved scandals to count? TDS?'",
    "Someone here please, Please, PLEASE! Tell me that what we're really seeing played out is the GOP having \"Projected and Transferred, this whole time.\" What you fear and what YOU would do, you cast on/ blame others for; it's your OWN playbook... is it just ME?",
    "HOW DARE THE U.S. THREATEN A COUNTRY WHO DOES NOT ACCEPT lgbtq WAYS...JUST MAYBE THEY HAVE HIGHER STANDARDS OF MORALS THAN THE U.S....LEARN FROM UGUNDA...THEY HAVE NO PROBLEMS WITH lgbtq..BUT WE SURE DO IN THIS COUNTRY!!!.",
    "Republican voters: you’re voting your own sovereignty away. This trans kid stuff is a set up so you’ll keep voting them in enough so Republicans can strip away your voting rights. It’s happening in Florida, it’s happened in Missouri and it’s happened in Wisconsin (amongst others). Republican legislators and state supreme courts continue to stack the deck in their favor. When I say their deck, I mean *Republicans* deck so that no one, not even their own voters can vote them out.",
    "This was obvious to anyone who pays remote attention to the arrests (Lev Parnas worked closely with Guiliani and he isn't shy about his involvement at his behest). That we're actively calling it is the only thing new. Evangelicals have long admired Russia's anti-lgbt totalitarianism, they're speaking a very similar language to Putin on nationalism and willing to overlook the trojan horse.",
    "THIS IS NOT REALLY A FIGHT AGAINST TRANS RIGHTS.\nIT'S A FIGHT TO KEEP THE OLD FAMILY VALUES GOING.\nTHESE PEOPLE ARE ALL FANATIC CHRISTIANS WHO DON'T WANT ANYTHING DIFFERENT TO THE PAST BEING ALLOWED.",
    "Do you guys remember when Alvin Bragg gave 40 different charges for the same exact transaction? 😅 this is pure comedy at this point watching how crazy this announcer is our performer, news anchor whatever you wanna call him you guys really do need to stop this is messing with your brain badly",
    "There is a video showing trump in an ice cream parlor having just got out of court, ranting hysterically about EVERYTHING and scaring the daylights out of preteen girls and boys. He doesn't care about anything other than himself. He's already proven he's no leader. The least of his transgressions is that he's a Draft Dodger and Tax Evader.",
    "If Biden did not support by the CCP donations and lack of transparency in elections from some states, 100% he will be lose. I pretty sure he will also win next election because of vote buying, ccp donations and corrupt bias  mainstream media support biden.",
    "Good thing all that crap and all that nonsense is in another nation and isn't in America. It doesn't need any of this crap infecting anymore even though religion already has corrupted many people into acting like the sinners that they claim gays are.",
    "11:00 that entropy was the result of selfish motives united toward no common values when \"conservative\" was understood to \"conserve\" that sense of (moral) values (since Edmund Burke).  Then those same media respond to the entropy by seizing the left for the content of its \"message\" in order to profit from populism, not statecraft. \n\nConaider, for ezample how American media served the Saudi Royal Family's public relations-interests when the Crown Prince was designated as the King's spokesman when MAGA was fresh for the White House.  The interests were therefore global where MAGA implied a more provincial perspective--and see what happened to the Public Relations/Political factors when Khasshogi was murdered. The pattern doesn't repeat itself entirely; it evolves out of the back rooms into the uses (not the valuyes) of morality for Fox News (think Monica's dress not Stormy's  NDA)..\n\nThat pattern seems to explain for me why Tucker Carlson and Rush Limbaugh may be disposable for those media interests. As the medium devolves into a completely reactionary approach to translating current events into professional journalism, the matter loses relation to the public in the nature of ordinary lives.  The pattern may well end where the global interests have excluded local problems from that \"programming\" in favor of reacting--not reasoning--=against the other party for power, lacking any opposite perspective about government.  The left failed to realize how long ago the right stopped listening in order to weave their \"narrative\" of politics in a way that absolves the wealthy of any responsibility for politics, then used nedua  to engage other factions by deceit, for whatever reason.  Just don't contradict a postulated need to defend tax shelters in a process of insisting on a military empire made of subcontract law, then budget federal authority for military authority, not police jurisdiction, so that states-rights grounds of argument are free to  distort  the  emergence of fascism through \"expert\" constitutional interpretations.\n\nPerhaps the current state of Conservative Media has reached the same crisis that brought Lenin his path to sovereign power by making the population forget that \"democracy\" means government by the majority, not merely by the mob.  There's a system that goes with the distinct values, which is nihilism for the motives toward anarchy, including the \"get the government off my back\" demand of most successful capitalists. They won't need the schools and roads as soon as they retire to  gated community, safe against the left (whatever that means lately).",
    "But didn’t the GOP just re take the house in 2022 by promising to fix the economy and lower gas prices and what not? I mean if your educated at all, you know that government can do very little with gas prices. However, they promised to lower prices and make their election about “kitchen table issues.” Instead all they’ve done is went after Bidens son, who holds NO POSITION in our government. Unlike Trumps children who got upwards of almost 3 billion dollars from the saudis as soon as they were out of office, because Kushner and Ivanka were selling classified American information. And how about the thousands of trademarks Ivanka now has in China? And all of the Trumps extremely shady business dealings with foreign countries. Any who, the GOP ran on lowering prices. They’ve had control of the house now for almost 2 years. So tell me why I am now paying MORE for gas under the GOP than I was when Dems ran the entire government? What exactly has the GOP done to improve your life? Dems are trying to pass legislation to help save our children from being shot in their schools, while republicans focus on gas stoves and these bogus, completely fake culture wars. We have a governor who is running for president who is now forcing public schools to show videos from a conservative CHRISTIAN group, he is trying to change our history and say that “slavery benefited some folks and helped them learn skills.” Are we serious? This is the America you all want? Between a complete racist, hateful man who believes gays and blacks should exist, and the other option for the GOP is a man who has 40 some federal charges pending against him, there is irrefutable proof he committed numerous crimes, on camera, on Audio, you name it and the proof is overwhelming. Yet at the same time they say the “Biden” family is the most corrupt? Excuse me. I saw Bidens taxes. He actually paid his fair share. Over 1.6 million to be exact. While trump, who has ten times the amount of money the Bidens have, pays 700 in federal taxes? Really? People are so brainwashed and sick it’s unbelievable at this point.",
    "The extreme Mega Republicans, are obviously the descendants of the Confederate of the original American Civil War. Their are seething with hatred of American democracy obviously more towards non-white skinned communities, and now primarily the LGBTQ plus community. Wanting to end freedom of speech, diversity, equalism, women's rights, creativity, expressionism, multi spiritual beliefs, and multi cultures.",
    "🇺🇸RON DeSANTIS 2024🇺🇸\nWE NEED AN REAL PRESIDENT NOT AN 🇵🇰LGBTQ🏳️‍🌈 SUPPORTERS. \n\nLEVITICUS CHAPTER 18 VERSE 22.🏳️‍🌈\nROMANS CHAPTER 1 VERSES 25/32.🏳️‍🌈\n👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿👆🏿\n\n\nGALATIANS CHAPTER 6 VERSE 7.👈\n👆👆👆👆👆👆👆👆👆👆👆👆👆👆👆👆\n\nJOHN 3:16⏳👈 \n2 PETER CHAPTER 3⏳👈",
    "UAE , Qatar ,Russia  have been always straight , none of you complained .Uganda come out shouldn't be an outrage , that is purely a double standard at full display from the USA stance  and the rest of the majority LGBTQ. as you preach always that diversity is a paramount  in free world societies, we must respect the right and well being of the minority , of course the straights community.",
    "We all know the smear campaign wouldn’t be happening if the court leaned left. It’s just so transparent.",
    "So the gays are the sacrifices Ugandan give to god. Make sense now.\nI think we worship a different God. Their god come after human sacrifice, just like what Idi Amin did. \nIt's not Christianity, it's a Kumbaya in disguise.",
    "Nuclear information can not be declassified by a president thinking about it. Nor can a body guard have access to them having no clearance or need to know.  Nor do any of the companies or employees he enlisted to help him transport them. \n\nIt will be fun to watch as he gets informed of the fine arts of a plead deal. Admitting guilt and testifying against the former president would be the deal to avoid a century of sentences.",
    "When Trump says \"Not really\" and \"Not that I can think of\" he means: 'Absolutely I did. But I'm just going to lie about it like always.' His conning is so transparent.",
    "A trans health bill in Kentucky might have saved the 3 nine yr old girls, the older lady, and the 2 males. Mental health help is a big part in reducing mass shootings in school I would think",
    "Magaspeak To English Translation.\n\nMake America great again=\nDestroy the democracy that made America great\n\nStop the steal= an excuse to try to steal an election\n\nTrump Truth post=a lie.\n\nCommie, Marxist= anyone not in the magacult\n\nStrong, powerful leader=A dictator.\n\nFree speech absolutism= speech that the cult absolutely endorses.\n\nElection integrity=elections that Maga wins\n\n A tourist trip that got a little out of hand=\nJanuary 6th vandalism and terrorism of our nation's Capitol\n\nIt's a work in progress. I'm sure there could be a lot of additions.",
    "Lawrence O'Donnell is an excellent,experienced speaker,whose experience shiws through in each spoken word, his givernmental experiences surpasses that of everyone else,and his innate histiricsl kniwkwdge of what,of how a president actually dies theur job,wuthout the gaydy facades,but with wuse knowledge and a mind open to realistic opinions,and intelligence based final decisions,without the gaydy cdmwra lights, the shouted questions....a presudents real job is always( as it should be done) behind closed doors,out of public view. A real president diesnt seek camera made ego boosts,or fake scenarios as photo ops,while soewing lies,and nonsense. Biden's mind is still sharp enough to handle the job he was elected to do,and he does it with the kniwkedge that he doesn't do it alone,his supports are those who surround him, instead of those people feeding his ego at every turn of the head. A real POTUS doesnt need that.",
    "America’s Image Abroad Rebounds With Transition From Trump to Biden : Pew Research Center \nThe election of Joe Biden as president has led to a dramatic shift in America’s international image. Throughout Donald Trump’s presidency, public's around the world held the United States in low regard, with most opposed to his foreign policies. This was especially true among key American allies and partners. Now, a new Pew Research Center survey of 16 public's finds a significant uptick in ratings for the U.S., with strong support for Biden and several of his major policy initiatives.",
    "Everything happens here before it lands in the US. After planting documents on 2 sitting Presidents of the USA, this is not good enough. So what are they ( the cartel ) up to then ?  Well they trying to push this through Parliament right now. So.. Culture Secretary, Michelle Donelan, has announced plans to make it a criminal offence to publish films of illegal immigrants arriving in this country !!!  I have told you this 4 years ago, the damage the BBC is doing in Washington is colossal. Remove them from the US, and stop ALL transmissions from Britain. They own the BBC which corrupted the American media !!!",
    "3:55  '' trump needs to praise our allies...''\nTrump will\nJust as soon as the money is in his bank account...\nTransactional\nOf all the derogatory words aimed at Trump,most of which Trump wears as a badge of honour, the one incontrovertible fact about Trump is his inability to recognise Acts  of Kindness. Performed from the heart...\nTrump in France '' I'm not going to a cemetery its full of losers.'' \nJohn McCain '' He's a loser''\nTrump '' What's in it for me''",
    "RON DeSANTIS 2024.\n\nWE NEED AN PRESIDENT WITH VALUES AND PRINCIPLES NOT AN 🇵🇰LGBTQ 🏳️‍🌈SUPPORTERS.\n👂LIBERALS:TRUMP; AND GAYS👂⤵️\nROMANS CHAPTER 1 VERSES 25/32.\nLEVITICUS CHAPTER 18 VERSE 22.\n1 CORINTHIANS CHAPTER 6 VERSE 9.\n\n\nGALATIANS CHAPTER 6 VERSE 7.\n↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️\n\nIS LATE. \nIS GETTING TO LATE ⏳✍️\n2 PETER CHAPTER 3🔥✍️",
    "Something every single American should be thinking about. While the Democrats want to distract attention away from the failures of Biden. His administration and the democrats. Divert attention away from the corruption of this administration. Here is a reminder of what Biden and the Democrats are doing to **interfere and influence an election, hide corruption**,  divert attention away from their corrupt and incompetent ways, and keep sticking it to the hard working American tax paying citizens. Remember this. \nBiden repeatedly said \"let's finish the job\". What that means is. He. His administration and the democrats will finish the job of destroying America. Making the American people suffer. Ruin lives. Finish the job of wanting to have complete and total control over the American people. Biden and the Democrats don't want to represent the people. They want to rule over the people.  The mainstream media continues to lie, misinform and censor the truth. \n\nSouthern border = Failure \nAfghanistan = Failure\nCovid = Failure\nEnergy independence = Failure\nCost of gasoline = Failure\nCost of food = Failure\nCost of building materials = Failure \nCrime and public safety = Failure\nSafety and education of our children = Failure\nTransparency = Failure\nUnity = Failure \nUkraine = Failure \nNational security = Failure\nChinese surveillance balloon = Failure\nThe security of America and it's people = Failure \nMultiple transportation problems. Worst being Ohio train crash. = Failure \nBanking and finance = Failure. \n**Hunter Biden and Biden family involvement in influence peddling and pay offs from China, Russia, and Ukraine. A thorough investigation and prosecution was a joke. Two tiered justice system in the Washington swamp. **\n**Weaponization of the DOJ and FBI against the American people and political opponents. **\nBiden/Harris. The Democrats = Failure and destruction of America. \n\nThe failures and corruption keep stacking up. While the hard working citizens of America keep suffering.",
    "Transgender LGBTQ+ Activist Charged For Sexually Assaulting Two Boys Under 13",
    "There is no presumption of innocence to have here. We've seen & heard his admissions about committing crimes.  It's sad the GOP continues to cling to this traitor. It's more proof of a \"Party\" no longer worthy of \"participation\" in American politics.\nThe GOP is an organization of PERVERTS:\nThey have PERVERTED, poisoned & polluted the political process by polarizing & politicizing everything they can to try & divide. They've diminished the legitimacy, integrity & credibility of Congress, the Presidency, and the SCOTUS & just about every Federal Agency & Department imaginable - including the Secret Service, FBI, DHS, Inspectors General & the Pentagon, the IRS.\nMore important: The complicity & culpability of the GOP - they are American democracy's cancer, Trump only a dangerous tumor.\nThe GOP brand has been damaged beyond redemption & rightfully so. They are responsible for the downward spiral of civility, ethics & morality in American politics over the past 60 years. They are the primary source of disinformation, distortions, distractions, subversion, obstruction, sabotage, and selective \"law\" that only benefits their party in spite of what's best & desired by the majority of Americans.\nDecent \"Conservatives\" need to find a different Party to join that can legitimately participate in American democracy. This means they must be willing to lose gracefully & accept the peaceful transfer of power IN ADDITION to demonstrating a connection to truth, logic, facts & reality - MIA from the GOP which is now a DTO worthy of expulsion via an attempted coup resulting in insurrection - both acts of sedition - and treason.\nThe reluctance or inability of \"Conservatives\"  to acknowledge facts, truth & reality in a timely manner is what makes them a Clear & Present Danger to the safety, security, health & public welfare of America - and human existence on Planet Earth.\nThe majority of the GOP has clearly indicated that they are endorsing cheaters (& cheating) to win elections. And \"Party over Country\" as their philosophy. And that rot extends from their corrupt greedy, hypocritic \"leadership\" at the top to their brainwashed, blindly allegiant, ignorant, gullible, duped bottom. THE BARREL IS ROTTEN TO THE CORE.",
    "I'm going to embrace \"woke\" if it means that I'm not a homophobic, transphobic, racist bully. If \"woke\" means that l'm a bleeding heart liberal, that l'd rather help the needy than the greedy, then l'm woke woke woke. 👍",
    "Stop idolizing Ronald Reagan when he was the first one to inact the gun laws against blk people owning guns he was racists against Puerto Ricans ok stop it! Reaganomics was the beginning of the downfall of America well Nixon played Ted the deceptive seed by lieing to American ppl about Vietnam war but Reagan was a war monger n wanted to clean sweep blk folks n gays in sanfransico",
    "I will never  understand how it is that Trumpists and right wing media can possibly defend a US president who attempted to thwart democracy. The peaceful transfer of power is the most important part of our democracy. People can go vote but if the loser decides not to leave then the voting didnt matter. Thats what Trump did, he literally decided that he wasnt going to leave.",
    "I have a father. He said I could watch Dragon Ball Z. But. If I watched anything else anime I would be grounded and be forced to watch nothing but news for 10 years. He also said if he saw furry or LGBTQ in his house I would be orphanized. I respect that man and am glad he passed to other world and no longer has to live in this place of eternal torment and suffering.",
    "Curiosity. And asFeymam said, just trying to figure things out. Forget MAGA. As a increasingly concerned UK observer, as we are all interconnected. Trump, from the day he came down the elevator, drip fed his intention. Jan 6 and his incitement was the test. His ideal of dictatorship and a theocratic state - he as a con man, has utilised the fundamentalist Christians for his goal. They know he has not a drop of religion. It is horribly, just horribly transactional -. Does he actually have a chance. Systemically, if we are given an easy option, to not think, to not be curious, we take it. I get it, I get the need. It takes work and a bleeding load of agitation to live life with curiosity. So to eventually get to my question, will voters who are undecided, struggling, just say feck it. There is a certain relaxation in that. To move to a dictorial paridym. I understand it in myself but know in my 55 years, that life is so much expansive with the itch. Are there enough to get Trump elected, to ease into that relaxation. Sorry for the long post, but this came up for me walking the dog today. From the UK, Merry Crimbo everyone.",
    "Destroying the (white christian) fabric of our country. He's nothing if not transparent.",
    "\"Russians make up a pretty disproportionate cross section of a lot of our assets. We see a lot of money pouring in from Russia.\"__ Donald Trump, Jr.__USA Today\n\n\"In 2015, the Taj Mahal was fined $10 million-- the highest penalty levied by the feds against a casino-- and admitted to 'willfully violated'anti-money- laundering regulations for years. Throughout the 1990s, untold millions from the former Soviet Union flowed into Trump's luxury developments and Atlantic City casinos. But all the money wasn't enough to save Trump from his own failings as a businessman. He owed $4 billion to more than 70 banks with a mind boggling $800 of that debt personally guaranteed from Trump. Trump's in a hole from bankruptcies, so this is what he does: as Bloomberg Businessweek reported, it wasn't long before 1/3 of the units on the towers priciest floors had been snatched up-- either by individual buyers from the former Soviet Union , or by limited liability companies from Russia. This was in 1994-1995 with Trump claiming he never did business with Russia or Putin.\" \"We had big buyers from Russia, Ukraine, and Kazakhstan.\" __ Debra Stotts __Trump World Tower Sales Agent __ Bloomberg \"Trump had found his market.\" After Trump World Tower opened , Sotheby's International Reality teamed up with a Russian real estate company to make a big sales push for the property in Russia. The tower full of oligarchs , as Bloomberg called it, became a model for Trump's projects going forward.\"__ Trump's Russian Laundromat __ Craig Unger __ New Republic 2017\n\n \nThings to read on how deep Donnie's connection to Russia is and how far back this connection started with Donnie and Russia;\n\n1.)Married to the Mob: Craig Unger Investigative Journalist on What Trump Owes the Russian Mafia __ Democracy Now \n2.)Following the Money: Trump and Russia- Linked Transactions From the Campaign to the Presidential Inauguration __ Diana Pilipenko + Talia Dessel __ CAP 20 Report __Dec.17, 2018 \n3.)Cracking the Shell: Trump and the Corrupting Potential of Furtive Russian Money __ Diana Pilipenko __ CAP 20 Report __ Feb. 13, 2018\n4.) Donald Trump Was Everything Vladimar Putin Could Have Wished For __ Craig Unger __TNR (The New Republic) __ March2, 2022",
    "We need transparency first!",
    "Perhaps there is another way to go about this, illegalize any pro-lgbtq propaganda (especially aimed at children), any parades, any acts in public, and any lgbtq discussions in schools or classrooms. However, i wouldn't call for imprisonment/death penalty for what people do in their houses. Personally, I'd still let them recieve medicine, attend school and obtain an education, have shelter, and other basic human needs. However, i wouldn't extend those rights to child predators, if you make a child a victim then you should pay the heavy consequences.",
    "Its because Trump has verbal agreement with Turkey last weekend, to go easy on the \"transition\".\n\nThese countries all need to be educated by the Japanese and Korean patriots of 50 years ago.",
    "Isn't it time we start addressing that Trump and these MAGA monsters are the best most transparent representative of who the republicans really are?.. He is akin to the Republicans' favorite dirty magazine just shipped without the plain brown wrapper so that we're all getting a better look at what they're really about. In many ways his only difference from any other Republican politician is that he's just more willing to say what his base wants to hear loud enough for the rest of us to be insulted by it and they eat that up. As one who has always considered myself a moderate independent (with the voting record to prove it) it seems to me that the real question is since it seems fairly obvious that the Republicans have given up on the idea of democracy or even rules based ethics what does America look like when the Democrats are finally forced to reckon with that and will they eventually be forced to follow suit? Does the American experiment go silently into the night or do those who hold onto their idealism roll up their sleeves, get their hands dirty, and push back?.. I'm afraid that if the democrats can't build the coalition necessary to keep the MAGA wave in check we will see that the constitution and our systems of checks and balances have failed to meet their intent.",
    "45 is an embarrassment to mob bosses. He is clumsy, transparent and ham-fisted, without a scintilla of subtlety.",
    "Joe Biden: I ruined your life, made you poor, made you and your baby starve, took you guns, took away your social media accounts, forced vaccines and masks on you, ruined the border, stoked racial division, brought war to Europe, raised your taxes, let men dominate girls sports and locker rooms, transed your kids, and wasted all your taxpayer dollars to Ukrainian oligarchs and fighting the weather…..\nBut, Orange Man Bad! 🧟‍♀️🧟‍♂️🧟",
    "It's a huge major flaw in the \"American Experiment\", the dependence on a President that \"transcends his own values for the good of the country\" (i. e. acts honorably), as Chump grossly exposed.",
    "Mme. Vance, every time she speaks, ensures her eminence as a National Living Treasure of the USA. Minimum number of words, maximum of accurate information transfer. Succinctly divine. Thank god she is not the only credible American supporting the experiment in democracy, but fhanks for her work!",
    "Sounds like a false flag to me all they have for evidence is tweets that have nothing to do with the crime and him being a election denier? If you believe anything on the news you’re in a trans",
    "U.S. MARSHALS SPIED ON ABORTION PROTESTERS USING DATAMINR\nTwitter’s “official partner” monitored the precise time and location of post-Roe demonstrations, internal emails show. \nThe Supreme Court just handed down a ruling;\nIn one of the two cases, Twitter v. Taamneh, the Supreme Court ruled Twitter will not have to face accusations it aided and abetted terrorism when it hosted tweets created by the terror group ISIS.\nThe court also dismissed Gonzalez v. Google, another closely watched case about social media content moderation – sidestepping an invitation to narrow a key federal liability shield for websites, known as Section 230 of the Communications Decency Act. Thursday’s decision leaves a lower court ruling in place that protected social media platforms from a broad range of content moderation lawsuits.\n\nThe Twitter decision was unanimous and written by Justice Clarence Thomas, who said that social media platforms are little different from other digital technologies.\n“It might be that bad actors like ISIS are able to use platforms like defendants’ for illegal – and sometimes terrible – ends,” Thomas wrote. “But the same could be said of cell phones, email, or the internet generally.” {let me translate for you; if you want to be a criminal use social media, cell phones, email, or the internet, SCOTUS just provided Protection!} \n\nFYI, PROTECTIONS ARE ONLY IN PLACE FOR BILLIONAIRES AND CORPORATIONS, FOREIGN STATES, POLITICIANS, JUDGES, FRIENDS OF...ELECTION INTERFERENCE IN 2016, 2018, 2020, 2022, AND THE FLOODGATES HAVE BEEN OPEN FOR 8 YEARS!",
    "America desperatly needs another 87.000 armed IRS agents, like a hole in the head, and 500 million to investigate transgenderism in Pakstan, Has anybody even read what  Biden wants to do wirh all these extr trillionsof dollars?",
    "Nebraska, Nashville, plus the unrelenting attack of conservatives on trans kids, last year in the form of 50 million dollars spent on attack ads.  I'm seeing a connection beyond the \"N\".",
    "Omg where are we going kids is a kids and have no idea about been so call Trans please leave our kids alone you trying to protect someone and destroying our kids you my not understanding now 15 to 20 from you will see it this should stop letthem be adult and make them on there on decision it's sad to  see  our kids been played like a toy they have no clue for is going on",
    "I blame the American and Canadian LGBT community for this. When places like Uganda look at other countries' examples, they see the true colors of these communities and what they do when they have power",
    "Red Hats are wishing America would be under Putin's rule so they can be his Brown Shirts beating minority groups such as blacks and LGBTs to death when in reality they'll be his disposable Red Shirts instead.",
    "I see that Trump is still living in their heads rent free.  Now that the narrative of \"absolutely had to be natural spread\" to could be a lab leak, they redirect from their previous narrative and start the, \"but Trump\" deflection.  The whole idea that it was natural spread was to avoid conflict with China and that's what Trump did back then.  Transparency back then was in the context of talking about how the virus spreads and it's impacts... not it's origins.  Good job, MSNBC!  Bravo.  You've earned your DNC donation again.",
    "I don't get it, I had an older \"brother\" ever since I was born. He came out as trans when he was 40.....She seems much happier now, but it doesn't mean that she doesn't have to deal with idiots who somehow believe that how she identifies is all about them...Trust me, my former brother, now sister and I had a super difficult relationship and her identifying as a woman doesn't erase the many conflicts we had growing up, but she seems to be a lot happier now and I feel nothing but joy for her. I won't lie, it took a bit of time to adapt (I 100% support her, but just going from one name to another for someone you've known your entire life isn't easy), but at the end of the day, I wish her nothing but happiness and if I can wish that to a member of my family with whom I've had a very complicated relationship, I don't see why random strangers make it a point to go on a crusade against her or any other transgender individuals. She knew full well that she was going to have to endure hate coming from loved ones (fortunately that part didn't really happen) as well as complete strangers (unfortunately, that part keeps happening on a weekly basis). Just think about this, what do you have to gain from coming out as transgender if you know that a bunch of complete strangers are going to make a point of hating you? Doesn't it show how sincere transgender people are? What the f**k do they have to gain except finally feeling like they can be who they truly feel they are? Who are we to tell them \"Nah, you don't have the right to do that\"? Is it so hard to imagine that someone feels like they identify more with a different gender than the one they were biologically assigned at birth? How is it suppose to affect my life or yours? Can't we let people just take the decisions they want to take and do the best they can to be happy? I'm not saying \"I get it\", I'm not trans, I don't feel the way a transgender person feels......I'm also not an accountant, I don't see why someone would choose to be an accountant, I'm not a cop, I'm not a painter, I'm not a vegan, I hope to be a father someday but I am not one yet......My point is, we all are different, why can't we let each other do whatever it is we have to do to be happy? Why do so many of us insist on telling other people what they should and shouldn't do? As long as it's not hurting anyone else, what's the problem? How are transgender people hurting other people?",
    "blacks destroy everything like a black devouring void of the universe, and whites create like starlight, even if it is bad - it's like creators and destroyers, and by helping or weakening one of them, you can regulate life and the system around...\r\nI understood this while thinking through the solar panels and what color the phosphors and active absorbing mass should be and came to the conclusion that even if there are working options for a bright white mass or a transparent color and other light colors, this does not mean that the color is not important...\r\n\r\nnature suggested shades in the form of darkness and transparency of space, which means dark transparent glass is the best absorber of light energy! it is light as the basis of life and the ability to see with the eyes and not with sensors...\r\n\r\nthis does not apply to radiation or heat microwaves etc as base metals are always gray in color and gray is a mixture of white and black...\r\n\r\nnot necessarily blacks can be black, the whole point is in their soul and soul energy, their character and actions - if you understand them, you can find similar creatures in the universe in any animal and alien form ... also with whites!\r\nit’s just that life bends and limits in mental and physical abilities also a limited variation of natural minerals around - but it will always be stable as a black transparent void of space...\r\n\r\nalthough I thought so, it can generally be taken as a basis that even gray is worse than black, since radiation and microwaves with heat are better caught by dark tones and matters - but I have a double war for gray...\r\n\r\n- as if they are changing the rules in the universe with an internal program of the strength of matter - like a tug of war but the forces are always equal to the total sum of the mass of metrics in the universe!\r\nthis can be described as a war of angels and demons...",
    "RACHEL LET IT BE KNOWN THAT GOD IS IN CONTROL. IF GOD BE FOR YOU, WHO CAN BE AGAINST YOU? ON THE FLIP SIDE, IF GOD RESISTS YOU, YOU WILL NOT BE GOING ANYWHERE. TRANSLATION OF WHAT THIS MEANS. YOUR NETWORK IS FIGHTING AGAINST GOD. YOUR NETWORK AND YOU ARE SAYING THAT THE BIBLE IS WRONG. A GLOBAL ONE-WORLD GOVERNMENT USHERS IN THE ANTICHRIST. BUT YOU SAY THAT A ONE-WORLD GOVERNMENT IS THE ONLY HOPE TO STOP GLOBAL WARMING AND WE ARE AT A TIPPING POINT, A POINT OF NO RETURN BECAUSE OF CLIMATE CHANGE. IT IS A LIE.",
    "If given the choice of Biden vs. Trump, I will be forced to vote for Biden.  Am I happy about this?  Absolutely not.  Where are the primaries?  Where is the choice?  I witness signs of dementia in both Trump and Biden.  Biden is head and shoulders above Trump in knowledge and intelligence, but that does not seem to be a characteristic important to half of American voters.  America's elections are more like beauty pageants than serious political discourse, and worsens by the year.  Stupidity is no longer a source of shame, but a point of pride among America's bottom third of the population.  The DNC leadership is jeopardizing the return of Donald J Trump in a rematch that never should have happened.  Trump's cult will never be swayed, combined with the votes of thoughtful conservatives, the balance is terrifyingly close. Unless all voters are invigorated, especially minorities, and get out to vote, seriously handicapped by Republican chicanery, the return of Trump will result in a civil war.  Once the US falls, Putin will take at least eastern Europe and China will make a play for Taiwan while simutaneously making the Yuan as the global standard of currency.  We are at a crucial crux in history where our real problems are the coming disaster of global climatic change, the rise of Putin's reign of terror, and something that the news agencies are not giving the degree of urgency on China's export ban on rare earth elements.  This will cripple America's high tech industry for ten years as we gear up our own capabilities.  How this National Security issue has gone on for so long is frightening.  If Taiwan falls, 90% of IC chip production that runs every aspect of modern technology, including our defense systems, will become unaccessible.  China's dominance in high tech is part of a long term plan to neutralize a very volitile US in world matters, once our capacities are nullified, then world finance will fall under Beijing's firm grip.  Meanwhile, we are a feckless superpower, with a House of Representatives controlled by trailer trash candidates arguing about pressing issues like which party gets credit for what, Hunter's laptop and transgendered bathrooms.",
    "Oh yes, the Inflation Reduction Act was a great success for Manchin, he succeeded in GUTTING the $3.5 TRILLION Build Back Better Act and transforming it into a pathetic $500 billion bill! Biden should have thrown Manchin and Sinema out of the Democratic Party back then, now he's going to pay the price for his weakness!",
    "Protect all children from mutilation. Once they're adults, they can do whatever they want. Everyone should agree on this. And by saying that, no, I am not attacking trans kids nor am I transphobic.",
    "Janet for Wisconsin ✅️👍🙂 (abortion rights, gun laws, LGBT) will fight against the radical conservative candidate Dan Kelley 👎❎️😠 (abortion law, gun rights, anti-LGBT). Wisconsin voters🗳 go and support the liberal squad justice Janet Protasiewicz. You're Welcome!!",
    "Trump is a cheater, manipulator, narcissist. Nothing, transparent. He is not interested in the welfare of the country. Good for the United States of America. Trump wanted to defraud the citizens. Trump should not run for president again. It's finished!",
    "Adolf Hitler called German journalism \" Lugenpresse \" which when translated literally means \"Fake news\" because he didn't want the German people to know the truth. Trump is following Adolf Hitler's playbook almost exactly....and we know what happened to Germany..",
    "I grew up under a Russian communistic regime in Poland and I can't believe it took America years to figure out that they are (republicans) on Putin's payroll! I mean trump been paid by him since 2013 you have  enough proof he kicked out American translator and staff when he was meeting Lavrov! trump took Putin side over his own security agency need more clues?",
    "Good. Those ‘fake electors’ knew they were contravening the electoral regulations: guilty of interference, impersonating an electoral official, and everything else in the rule book that should be thrown - hard - at them.  Also conspiracy to prevent the peaceful transfer of power: aka insurrection.",
    "I have transmitted energy free radical poisoning. 20 surgeries too caused by it this is barr ktrh berry all ktrh and after long time add Donald trump cover-up for them against background of barrcia mental fraud kiniage to early 1980s",
    "Wouldn’t you think this honest and transparent network would cover the Ron/Gav debate?",
    "\"BOTH PARTIES ARE THE SAME\" lazy people cry, the ones who can't take a few hours out of their life while black, native, and Hispanic folks in red states take days out of their lives every year to vote.\n\nHere you have it, plain as day in Nebraska, where Democrats are taking on transphobia while the Republicans are working to ram it through. The worst part if it is, this isn't even something they really believe in. This is just a cynical attempt to feed more red meat to their hateful base who only care about the harm they can inflict.",
    "it's refreshing to see that a nation that would normally be considered 3rd world, taking such positive steps to protect their children and their future from the homosexual agenda like that. \n\nGood for you Uganda for doing the right thing and standing by your people and especially protecting your children from LGBTQ Indoctrination efforts.\n\nSTRAIGHT PRIDE!",
    "I’m from Nebraska and not particularly liberal (by liberal standards), but happy to see this happening.\n\nIf you’re more concerned about trans rights (or lack thereof), than doing literally anything else, then we just will do nothing. Your choice.",
    "I understand french scientists were sent back to investigate their own work .. The lab Funded by faucci. And bats have to use another animal to transfer to humans. Mouse rat or camel can transfer directly but not bat. A proffessor criticised faucci 2 years ago and her post was taken down . she wasnt prosecuted for slander",
    "Civilization is a physical manifestation of psychopathy which is why it causes mental illness.\n• Everything relies on Ad Baculum. \n• Everyone but you owns your time.\n-- Instead of lashing out at those who claim to own you, you react at others who are owned (Road Rage).\n• Money is a device designed specifically to limit access to energy (debt: housing, medicine, education, transport).\n• Take a number, sit still, pushover is a virtue, speak only when spoken to, self-defense is violence (offense becomes defense/defense becomes offense), equivocations Ad Nauseam, rights are just allowances, hierarchy = equality...\n\n• From the foundation, your building materials are Logical Fallacies. Don't expect apples from orange seeds. \n----------\nMalum In Se\nMalum Prohibitum\n\nNothing moral requires authority. Authority is the claim to the exclusive exemption to morality. It is a monopoly on violence. Violence is a violation because it is the initiation of aggression, not self-defense. Offense/defense are ontologically distinct. All crime has a legal equivalent (ie, taxation is extortion).\n\nWarren v. District of Columbia\nTown of Castle Rock v. Gonzales\nDeShaney v. Winnebago County\nLozito v. New York City\n\nYou are legally compelled via the logical fallacies Ad Populum, Ad Baculum and Ad Verecundiam to pay for protection that they are not legally obligated to provide. That's a mafia.",
    "Rachel is America's biggest LGBTQ voice for the neo cons",
    "It gives me the creeps somehow. My memory is short but werent Russian diplomats in mar a lago once? Or was the White House? Can't remember.. the time he was alone with nobody else than I Guess translator. He invited Kanye West and Fuentes to mar A Lago.. maybe he shown the documents to White supremacists like them... IS guilty for me there's no doub and he is a national security danger as Putin or Kim Jung Un IS.. exactly in the same measure",
    "STOP PUTTING YOUR LIBERAL SPIN ON WHAT TRUMP SAID! President Trump said they were “smart”, as in coyote smart, he did not “praise” them, he was making a point. \nAND THE LIBERAL TRANSLATION OF SENTENCES IS AWFUL !\nYou remind me of Martin Luther aka Volodymir Zelensky aka Skirgailia 666",
    "Never trust any of MAGA GOP because they are just a bunch of liars.  They welcome Santos because they just want to have a control power. They don't care about honesty, integrity and transparency.  They never learn a lesson from the loser Trump, who is a \"born liar\" and a \"born manipulator.\"",
    "If the Radical Left knew when to stop being so “progressive”, this most likely wouldn’t be happening. Other countries are taking note on how their influence has affected the US and want no part of it 💯. I feel for the LGBTQ community there having to deal with this.",
    "Trump in a second term will go further than you think. He will become a Pinochet (Chile) style president. He will lock up all persons who oppose him or opposed him in the past. He will open concentration camps to lock up thousands of individuals. The plans exist, the lists of people to put in jail exists......listen to C. Pattel and Steve Bannon. The fascists  are going in full steam mode. The fake press, the left, the progressives, LGBTQ people, the unions, coloured people, immigrants........They are all targets. You can definitely say goodbye to democracy.",
    "Fan of your show for many years.  Over 3K previous comments, too many for me to read but, Lawrence,  when you spoke of the trans Atlantic flight, somehow I thought of another flight that was in real trouble that was saved by a veteran pilot who used all the knowledge and experience he possessed to save that flight from a very bad end.  When  it was all over it was that knowledge and experience that was praised, not his age.  I think the pilot's name was Sullenberger.  I hope this tiny thought can get noticed because IMHO it cuts to the issue favorably for President Biden because we all need a very experienced pilot right now.",
    "It is about time the Dems fought back. Gop has most of their priorities wrong. Who cares if Hunter Biden showed his junk. If you don mot like it do not like it, do not look at it.\nWhy are they afraid of trans kids? Have every one of them been threatened or hurt by a trans kid? Selfrigious hypocrites one and all.",
    "RON DeSANTIS 2024.\n\nWE NEED AN PRESIDENT WITH VALUES AND PRINCIPLES NOT AN 🇵🇰LGBTQ 🏳️‍🌈SUPPORTERS.\n👂LIBERALS:TRUMP; AND GAYS👂⤵️\nROMANS CHAPTER 1 VERSES 25/32.\nLEVITICUS CHAPTER 18 VERSE 22.\n1 CORINTHIANS CHAPTER 6 VERSE 9.\n\n\nGALATIANS CHAPTER 6 VERSE 7.\n↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️↗️\n\nIS LATE. \nIS GETTING TO LATE ⏳✍️\n2 PETER CHAPTER 3🔥✍️",
    "All this does is make liberals hate him more. Donald trump news is all they ever talk about. Even after joe Biden became the president, MSNBC and CNN HAS NOT let up on trump even after his hiatus from being the president. Funny thing about this is ... they never admit when they are wrong. Then never tell the truth. they never cease to amaze me. Might as well call this the trump hate network. There is never any transparency or accountability from the news. YOU LIED ABOUT RUSSIAN COLLUSION. YOU LIED ABOUT HIS TWO IMPEACHMENTS .YOU LIED ABOUT JUSSIE SMOLLET. YOU LIED ABOUT WEAPONS OF MASS DESTRUCTION. YOU LIED ABOUT UKRAINE; YOU LIED ABOUT THE VACCINES, YOU STAY LYING MSNBC. WHY DOES ANYONE WITH A BRAIN STILL WATCH YOU? OH, MAYBE THATS BECAUSE EVERYONE WHO WATCHES THIS CRAP HAS LITTLE TO NO BRAIN.",
    "Kevin McCarthy doesn't realise that his obsession on keeping the gavel;   giving George Santos a free pass to hoodwink members of his Constituency and bask in this transitory lunacy. May have a deleterious effect to elect another Republican candidate in the New York 3rd congressional district come 2024.",
    "Remember there are, like, not that many trans people. The GOP is so out of legislative ideas that they've latched onto this as the OVERWHELMINGLY most important issue. \"Protect the kids?\" How about you protest the Christian Youth Ministry in your town?",
    "🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸\nThere should be absolute rules about honesty vs lies with regard to our public servants.\nAll of them! They swear an oath, an oath that should hold them accountable to we the people in every way with severe reprimands, fines or punishments for ethics violations regarding absolute transparency & honesty. Period!\n🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
    "So far this year there has been about 3000 school shooting... Of all of those shooters only 3 have been trans... Republicans keep fixating on a single attack on a Christan school.",
    "Ms. Maddow. I was viewing one of your vidios last and noticed that it had been tampered with.  Instead of your continued talk, a lady’s hands appeared and she was crocheting.  Confused, I checked to see if I had unwittingly  moved to another channel. I had not. I was tired so I didn’t take any action. I can’t recall which talk you were giving but you may want to check it out.  I read the transcript. and your words became disconnected where she appeared on the screen.",
    "Looks like the general CONTENT of the unsecured documents is key to explaining why the docs were carried away to here & there.\n\nMy money sez Trump - a known transactional thinker - is also an opportunistic criminal who makes Jonathan Pollard look devout.\n\nHe retained the documents to identify mil / intel community objectives, as well as tactical nuclear deployment strategies. Why?\n\nHe is for sale, as long as he feels he understands his real-time and potential strategies to extricate and run for Prez.",
    "Can you imagine the sh*tstorm if this was a democrat holding up promotions for climate change or lgbtq rights with a republican president.  Democrats need to stop acting holier than thou and get in the mud with the GOP.  Otherwise nothing will get done.  They think they are setting the example that others will follow, no one is following that, just get it done democrats.",
    "🦆 Facebook is CENSORING the Nashville Trans Manifesto, it is full of Anti White Propaganda.\n\n🦆 The Indoctrination the Democrats are shoving down our children throats is very real and very dangerous . This is proof.",
    "Yes, I even remember McCarthy and his Republican trials to rid this country of the communists, when I was in school. I thought this was a great idea until I learned that it was just another plot to rid them of people who were opposed to them, sort of like today. When you have to lie for a living the truth eventually comes out that condemns you to the dustbin of history. I remember Mussolini, standing on that balcony, with a multitude of Italians yelling and cheering him, during WW2. At the end of that war we see him hanging upside down from a lamp post beaten to death by an angry mob for all of his transgressions. On 1/6 they wanted to hang Mike Pence they had the wrong man.",
    "DOJ in dealing with an insurrectionist riot & the person(s) responsible is attempting to defend American democracy. \nOne of two American political parties denied that the deliberate refusal to recognize the outcome of a fair election & transfer power peacefully is not treason. Republicans seek any means to retain power. Democratic voting, unmannipulated is their least favourite way of maintaining power. One person one vote is far too risky for them.",
    "the democratics are the only ones doing honest work that will aide the working class,they put real people before all the childish B.S.whiny hidden agendas the repugs work on behind closed doors.the republicans are like a dog with a bone at the moment,I am a Tennesseean by birth,the school shooting in Nashville had nothing to do with trans gender,it had to do with evil,yet the repugs are giddy with excitement,they forget we arent stupid and have not forgotten all the mass shooting to date....one shooter out of all them was transgender.....please don't fall for their slanderous lies,innocent people get hurt for no reason.",
    "Wait u cant be serious u 🤡s\nHave you ever been to an Evangelical church?😂\nLike a 3rd of those churches are black, majority of black Christians are conservative or independent and do not love TRUMP, but they totally DO NOT SUPPORT LGBTQ and Abortion. This is what we are voting against, its not for trump, but against FILTHY POLICIES!\n\nAnd a president who says “you aint black if you dont vote for biden”",
    "Not a fan of the Democrats as a political organization, but the GOP are not helping America by this fixation trans people. Their fight against trans boogeymen and boogeywomen isn’t helping me pay my mortgage, curing my type one diabetes, nor fixing my pothole ridden street.\nIt’s just a distraction so they can continue to not govern, but to steal our tax money.",
    "It's frustrating that mental health institutions are not given the importance they deserve. The Mental Health Systems Act of 1980 (MHSA) was signed by President Jimmy Carter to provide grants to community mental health centers. However, in 1981, President Ronald Reagan reduced funding for mental institutions, repealing most of the act. This was a significant setback for mental healthcare policy.\n\nThe closure of state psychiatric hospitals has led to an increase in incarceration of people with mental illness. In the event of a mental health crisis, peace officers often respond to the 911 call instead of a therapist, social worker, or psychiatrist. But most officers aren't trained to handle mental health emergencies, and while laws protect civil liberties, it's challenging to hospitalize people against their will. As a result, policing and incarceration have replaced emergency mental health care. Currently, nearly half of the people in U.S. jails and over a third of those in U.S. prisons have been diagnosed with a mental illness, compared to about a fifth in the general population.\n\nThe justice system's intervention in mental health care has often resulted in fatalities. According to statistics, almost one-quarter of fatal police shootings involve people with mental illness. Mental health care in jails or prisons is usually inadequate or abusive. Jails and prisons have now become the new asylums.\n\nThe transfer of mentally disabled people from psychiatric hospitals back to their families or community in the 1950s is responsible for the deinstitutionalization movement. The closure of hospitals resulted in patients being discharged without appropriate psychiatric care. Consequently, people in need of care were left to roam the streets and live among the general public. \n\nCommon sense suggests that if more community mental-health hospitals were built, there would be fewer mentally ill individuals on the streets and living amongst the general population.",
    "TDS makes for good distractions for MSNBC not showing ONE second of the est 100k radical democrats attacking the White House over the weekend, in pro Hamas riots. (Or the LGBTQIA+ TRANifesto now leaked).",
    "\"Protect kids' right to be trans\" has the same ring to it as \"protect kids' right to be child brides.\"\nNo such right exists. Kids cannot consent to adults abusing them. It's all cope and cover by adults to do sick things to kids.",
    "There is a rumour allegedly that Joe Biden has decided that he now wants to be his true self and come out as a Transgendered women by the name of Josephine Biden, this in a last ditched attempt to prop up his falling poll numbers and abate criticism from the extreme left of the Democratic party... Josephine wants voters to know that if you don't vote for him your a facist.....lol",
    "Many democrats managed to rationalize that exceeding expectations in the 2022 midterms was some kind of victory.   Unfortunately losing the \"'people's\" branch of the government to a party that doesn't give a whit about their country is not my idea of a victory.   It's important to understand with crystal clarity that a party the lines up, almost to a person,  behind a man who is a treacherous grifter and which refuses to denounce his constant lies has shed every vestige of integrity and does not in any way stand for the interests of their country.  At least if treason, corruption and deceit are contrary to even completely craven definition of good government.\n\nI find it shocking and sickening that a *single* person would even *remotely* contemplate, even transiently, voting for  Donald Trump (if I were his mother I would not vote for him), or anyone who has enabled such a vicious criminal imbecile.... I would rather see a cockroach sitting in the Oval office.   The fact that 48+% percent of the electorate voted for him, (twice!) and for such a slime brigade as we find in control of the US House of Representatives ( and so close to a majority in the Senate )... is astounding, and does not bode well for the future.",
    "🍑🫒Just finished the indictment. Exhausted, horrified, infuriated & so completely saddened.  Heard an excellent line 'trump has lived his entire life on Grift & Grievance.'  My new fav quote. My previous one 'He speaks only in brutal   transactional arrogance & in his native Americans Victimese,'  Love words when they fit in a space I didn't know was quietly waiting..",
    "I keep thinking about how important clear evidence is. Make sure you have solid evidence. Be very clear and transparent about it and the necessity for others that have opposing arguements to have clear evidence. If they don't they are blowing smoke. \nAlso, a thorough review of the right of free speech is in order. As it is NOT OK to yell \"fire!\" in a crowded theater it is not ok to incite to a riot, which is exactly what Trump is doing. He shouldn't be allowed to get away with it.\nBeyond that, how do you break people out of a cult? \nLast but not least - revisit the Mueller report. My limited knowledge is It was really pretty clear about Trump's involvement with Russia. It was a massive tome, difficult for many to read. I would hope a clear review of its main points and evidence involved might be helpful. People need to understand reelecting Trump would hand our country to Vladimir Putin on a silver platter.",
    "Council for National Policy was founded in 1981, at the dawn of the Christian right and the beginning of the Reagan era. And it really represents what Jerry Falwell, an early founding member, called the big guns of the Christian right, who set the battle lines; 300 people who really comprise the entire leadership of the Christian right, and the conservative movement in general. These people kind of call themselves ‘grasstops’ leaders. You know, they kind of shepherd the Republican grassroots to the polls on Election Day. But they also kind of decide what the wedge issues are going to be and what the narrative is for the party. They have anointed the past two Republican presidents; Donald Trump back in 2015, and George W. Bush back in 1999, when they were just emerging as the figures that the Christian right would back. They also helped make Sarah Palin John McCain’s vice presidential pick\n\nJust days before she resigned as UN Ambassador, Nikki Haley delivered a private speech to the Council for National Policy, a secretive group of influential right-wing figures. Journalist Max Blumenthal obtained exclusive access and reveals shocking details — including Haley’s admission that she threatened the Chinese ambassador with a US invasion of North Korea.\n\n\"And I went to the Westin Hotel in Charlotte, and walked into the auditorium, or this giant ballroom. Ginni Thomas, the wife of Clarence Thomas, walked by me. Frank Gaffney, you know, the kind of foreign policy hawk who inspired Donald Trump’s Muslim ban brushed shoulders and sat sat nearby. And I was surrounded by basically the vast right-wing conspiracy, about 300 people settling into their chairs to hear Nikki Haley speak at noon.\nThey hold these meetings three times a year, in secrecy. The location of the meeting is not told to anyone who isn’t a member of the group. The membership rolls aren’t provided outside of the membership’s inner circle. And these are closed door meetings, press is not allowed\"\n\n{Documented Has Obtained a New Council for National Policy Membership List\nCNP members range from the leaders of the Heritage Foundation and the Federalist Society, to the Southern Poverty Law Center designated anti-LGBTQ hate groups Family Research Council and Alliance Defending Freedom. The heads of major foundations on the right, including those of Donors Trust and the Bradley Foundation, are also members.\nThe list appears to be dated January 2022, includes former Vice President Mike Pence and other new CNP members...}",
    "if only they had the same outrage when 20 school children were torn to pieces with a GUN.....but yea,   we have to deal with all the dangerous trans people...no doubt after they sort thew whole Toilet outrage which has completely disappeared",
    "His lies and deception are breathtaking. And let's not blame the media. The media has been reporting on Trump's lies and deception for years, even uncovering past lies and deception that go back decades. Fundamentalist Evangelicals held their nose and voted the pathological liar into office. Santos's well documented lies and deception and piled on top of more lies and deception haven't moved the needle an inch in terms of his accountability. The end justifies the means.The media does its job, and the new norm of lies and deception piled onto more lies and deception continues, because it is politically expedient for all the lies and deception to be overlooked, and otherwise excused and rationalized by a political party that should know better, but refuses to act. If we ever wondered why our schools are often the undisciplined hellzapoppin messes many have become ... it's because so many of the adults are missing in action ... missing in action, gaining political power by looking the other way, and never disciplining those whose egregious lies and deceptions got them into office, and whose very presence and votes they stand to benefit politically. Farce has become the new norm. Cheap, transparent, unaccountable, old-boys-club farce. The party of law and order is a hypocritical mess of expedience and cowardice ... The new norm ... and all the reporting by the media hasn't changed the outcome. it is simply recording the pathetic history of the new norm.",
    "Hey RePUGNANTcans yall realize one day you will no longer be and all LGBTQ community will still be in these streets, I can bet there are children or family members of yours that wanna come out and the continued rhetoric weighs on them",
    "All the trans adults you see today did make it without any help as children. We all suffer for it... those of us who are still around, that is. It brings me to tears to see what Machaela Cavanaugh has done. She didn't even have skin in the game. So many random people are willing to hurt trans kids. It's wonderful to see one pure ally stand up. It's also so sad that it's so few.",
    "You don't have to agree. But Republicans are not interested in protecting ANY children....cis or LGBTQ. If they cared, they would vote for expanded Medicaid, childcare, taxing the rich, free school lunches, holding banks accountable, funding for FDA to enforce safety regulations for baby formula, etc.",
    "Republicans despise America — look at what they are trying to do; ban the teaching of Black history, subvert tenets of American democracy, they are against the rules-based international order, finally they don’t believe in the peaceful transfer of power from one duly elected administration to the next.",
    "Yeah right, take it from a serial liar 😂😂😂, schiff was the one who made up an entire conversation then when the transcripts were released and he got caught said it was parody 😂😂😂😂",
    "Joe, I love your programme but you cut of everyone before they can complete a sentence. And you need to give Mika a chance to make the transitions and read headlines before you and the other men cut her off. Fantastic programme otherwise!!!",
    "“1 in 4 high school students identifies as LGBTQ” - The Hill",
    "Trump also wanted to shut down our giant military base in Germany and bring every service member home . The largest American military base located right there in central Europe .\nAnd as usual he announced it on Twitter before ever talking to his Chiefs of Staff ?! Also redirecting an American military aircraft to land at a fledgling little civilian airport in a little town in Scotland to give it business because it's the closest airport to one of his golf clubs . The crew has to be transported to his golf resort to stay overnight because The civilian airport didn't have the fuel needed for an American military plane and it had to be purchased at an outrageous price and trucked in , while the crew ( dressed in military fatigues ) at first felt underdressed while they partake d in 5 star dining , full cocktail lounge , and 5 star hotel rooms , All courtesy of the American tax payer . Trump is good with other people's money , Especially when he's using it to purchase unconditional loyalty and to further finance his business interest by keeping a civilian airport open near his resort .?! Nothing nefarious happened to the military aircraft while it was parked overnight on the civilian airport b/c no-one would expect it to happen ( the first time ! ) .\nThis is just a couple of dozens and dozens of examples that should be talked about . But Joe Scarborough is loud and he talks a lot And rambles on to where  many people will lose their train of thought or what they wanted to add . At least I would like to think that I'm not the only person remembering this !"
]