[
    "Why do so many refugees have to be transplanted all over these countries. It's a non stop stream of people. Are they trying to empty the whole middle east. The number of people involved points to something weird going on??",
    "Piers demonstrates poor Allyship in this interview by talking over the marginalised person and also expecting some kind of reward or pat on the back for being a merely decent human by supporting trans rights.",
    "even i can translate the turkish faster than the translator. AND IM 17 Y/O",
    "coming from a bisexual person, this isn’t the acronym and never has been. lgbt and lgbtq are fine and acceptable. lots of people like to make fun of us for using absurd acronyms but honestly a good 99% just say lgbt, adding q and/or a +.",
    "If your upset the south lost then why are people crying. waaaa waaaa that piece of fabric hurts my feelings I support gay marriage. and I'm like oookayyy what the hell is wrong with these people.",
    "This is what happens when you empower the unpopular kids from high school ( safe spaces, lgbt rights, political correctness, trans bathrooms, etc etc ). Once you unlock pandora's box, this is the evil you get.",
    "Trying to take an impossible situation and turn it around. What would be Democrats worst nightmare? Republicans and Christians finding ways to convince legitimate immigrants from the southern border to speak English and assimilate as proud Americans. And to vote FOR The United States, which translates to voting Republicans/Conservatives.",
    "She is looking up in the corner of the room to read a transcript CNN gave her.... Obviously!!!!",
    "I fell Trump's meetings with Romney were more about talking about the transition from businessmen to politician.",
    "Trans people have been in the military before, they haven't done a fucking thing to hold it back\\n\\nWhy the fuck should they be banned when they just want to serve the country",
    "So it's a problem when it's on the other side? Weren't you guys just cheering for that baker? So it's ok to refuse service to gays and Muslims? Sucks doesn't it? They want this guy to loose his job but not Rosanne?",
    "you all are missing the point! I dont care about somebody's affairs,  just like i dont care what gays or anybody else does in their private lives.  Just want somebody to run the country like a business not a banana republic!",
    "This is because trump is a sore loser and doesn't let things go, this is part of his revenge rampage for being sued when he kicked the Transgender girl out of the Miss Universe Pageant.",
    "The part were the dude said \"you cant stop us from eating them\" is actually a false translation. What he actually said was dog mean is leaner, pork meat is fattier.",
    "Mae Joan Rivers rest in hell eternally what a hater she is to call Michelle Obama a transgender she got nerves well no nerves in her face with all of that plastic surgery and glue melted in hell",
    "Anderson Cooper  is such a gay freak. Always looking or the negative - he must be a very unhappy gay man, wants everyone miserable just like him. There's a special place in hell waiting for you Coop!",
    "As an LGBTQ supporter, this PC nonsense is ridiculous and this is a FAD, plain and simple. This is about invading WOMEN'S spaces.  Men are INVADING women's spaces. Growing long hair and wearing nail polish, because they envy ACTUAL women. INVADING WOMEN'S SPACES!",
    "One extremely wealthy (given to him), one getting wealthy (\"reality\" TV?)--\"gay\"? what is \"gay\" in 2018 and who cares? this 1989 TV. yawn. complete absence of talent at anything. this is American culture and why change has to take place--and is taking place.",
    "Now they want you to be a spokesman for gays and come on his show.",
    "Guys she didnt copy Michelle's speech, shes just presenting a soft-translation for Telemundo",
    "My first thought of who lies behind the masks are homosexuals, trans extremists, and femboys",
    "This is horseshit. Why don’t they just have a gender neutral club for the weirdo parents who want their kids to grow up transgender and let us have our boy and girl Scouts???",
    "why are conservatives so adamit about getting the government out of our lives yet don't want to let people smoke weed, and don't want gays married? i don't get it let people live there fucking lives.",
    "This is exactly why I couldn't watch these liberal channels during the campaign.  It was so transparent how they had become cheerleaders instead of journalists.  Being nonpartisan, I like to watch more unbiased news.  I can't stand SNL either.",
    "At 4:30 Gutfield suggested we shouldn\\'t use the word, \"hoax.\" But, it IS a hoax. The whole thing is a plan to transfer more money and control from the private sector to the government.",
    "Leave it to CNN to take a real honest moment and turn it into crap. Why does it matter if Kim speaks or understands English? There's people called translators. Also bringing up the past while people are trying to move forward.",
    "U.S. Know thy self. Do not be swayed. Be unmoved, achieve inspiration, test and endure all thing to transform.",
    "I thought I’d never agree with the same party that tried to stop gays getting married. Wow, Ford must really be scum. As a liberal Democrat, I’m ashamed of my party today.",
    "Barack Hussein is gay and his wife is a shim",
    "North Korea is gay and so is Kim Jong oinks haircut",
    "Rodmans gay drag queen ass and Kim jung ill? =Stupidity",
    "Interesting that liberals are upset about locker room talk, but have no problem with LGBT the dancing on Pence's lawn with their dicks hanging out and others prancing around naked or pooping on the sidewalk to make a statement. HYPOCRITES!",
    "If any South Koreans are here please tell me if the translations are accurate, I don’t trust the cnn",
    "Is he aTransgender witch? Males are supposed to be warlocks right?",
    "The guy on the right is a sexist cunt who probably is trans himself",
    "wtf is non binary lol the LGBT coming up with new names next uo covalent non celestial transgender",
    "I am a teacher in an Orthodox boys school.  The school strives hard to give the boys an excellent secular education without too much emphasis on all that is bad in the world.  Do we want our children learning about transgenderism and homosexuality when they are five?",
    "There is literally nothing wrong with being transgender. All of the arguments against President Obama's actions here are invalid and the product of hate from misguided faith. Good on you Obama, you're doing the right thing.",
    "How about do away with insurance and let the market decide the price? There is no transparency in medical pricing, thats why the  prices are so high. Socialism never works bill",
    "I still don't know what trumps trade policy is he says he wants good deals, but left out the part on how he's going to accomplish that. please can a trump supporter translate his incoherent rambling for me?",
    "What ever happened to hitting puberty and finding out what your attracted to. It's like now days they're practically teaching kids you can be gay at 5 or 6. This is why as a gay man im fairly quiet about it because really it's no one's business.",
    "May Almighty God bless their souls\\nbut i think this is also a result of america introducing gay marriage and marks of the beast in a medical way\\nMay Almighty God help america",
    "a mental disfunction ???? WTF??? hahahahaha man you just destroyed your credibility with that. Please read a little about Human Conduct and you will learn that LGBT conditions were discarded from Medical Disfunctions A LONG TIME AGO. Too Ignorant your comments",
    "Really Fox News... We hate identify politics. Also Fox News- Gay Conservative Journalist Chadwick Moore",
    "He is clearly using his people as an excuse! I bet their is a large portion of people especially the LGBT community in Kenya who want this topic raised in their government.",
    "CNN would love some subtitles on this. The hearing impaired would VERY greatly appreciate them especially on a video like this. Please if anyone is able to transcribe or do CCs, it would be highly appreciated.",
    "I don't like woman anymore cuz they like men and thats super gay",
    "It's mental abuse and it's disgusting and it's sad... Leave gays alone man... Damn it's so fucked up... ",
    "i like her.she is so brave.i see hat girls are more tolerant with transgenders  than men. i guess thats because they have a stronger sexualtity..but there is more than penises and boobs and so on..More important is what sie has in her mind...she is she..",
    "President Trump did not berate Chuckie, he was honest and up front...they were caught off guard and every one saw who he and Nancy and Chuckie REALLY ARE!!!  Nancy wanted to be transparent but not now of course!!!",
    "Yo this bitch is lying all she does is talk about one transfix event after another in her life that we will never know if they really happened just her word fort it fuck that she lame n all the butches lying about Cosby is lame I nelsons he's innocent",
    "Let's pretend Lindsey is not gay for a moment and actual conservative and not a rino.\\nI know it's hard...😂",
    "KATHY'S LOGIC:  I'm only famous because the LGBT community are fans of my crap comedy... I know!  Maybe I should make a mock ISIS murder video.... while ISIS is currently murdering people in the LGBT community???  WTF?!?",
    "Elon Musk will probably create a flawlessly proper working gender bender medicine in the next few years. He has enough bravery to do it. Until that happens, I'm afraid the Transgender people have to be in real life and live how they were born.",
    "I can wait though for when people say being part of the LGBTQIA+ community is bad like if you were to say segregation between colored and white people should be legal",
    "why did Kevin space  and the gays hide around there narrative and how they slander on black folks",
    "Cattle audience direct concerning transaction mention credibility outdoor Canadian quarter possession fist.",
    "We don't like gay people in Kenya...God created a woman for a man not otherwise...he did with purpose...why want to force the gay thing in Kenya....we don't want...it's not even scientific.... their never a thing like u feel something for fellow man",
    "Good Mr: President, west have to respect other people views and ways of lives. What is good for you doesn't mean it should be good for everyone else.\\nRESPECT GAY AND RESPECT NON GAYS. INDEED",
    "Trump?  That's the name of a new kind of fecal transplant, isn't it?",
    "Man I wish when they were translating the North Korean words it would be in sync",
    "Uhuru is actually intelligent than what most pple think....u put it very well mr. President....this might be an issue in the west but in our country our society doesnt recognize gays....",
    "Manafort will not flip, and Trump will pardon all his transgressions . . . I believe that, if Manafort flips, he will meet the same fate as the Russian spy and his daughter. One does not cross the Russian/Ukanian 'machine' and live to tell anything more about it.",
    "If \"Hell\"ary gets an assigned rope for the neck (I am not holding my breath) please feel free to use my front yard as the stage.. I will transplant a Dogwood for just such an occasion",
    "the black guy is gay.  nice guy, but obviously gay",
    "Oh, you say your God labels gay sex/marriage as a sin?\\xa0 Ok, that's an interesting my religion my friend, and I hope you enjoy believing that.\\xa0 Unfortunately, this is country built on laws - and in terms of lawmaking: your god and your sins can suck my balls.",
    "Is the lesbian herself, why is she interested in homosexuality, evil thoughts.",
    "The homosexual/transgender gets out in a few months. Why is everyone so shocked about this coming from Obama\\n\\nThen they\\'re both gonna come out on the Ellen Degenerates show laughing and dancing.  Liberals cheering when Obama calls it \"a beautiful thing\"",
    "Time to \"Drag\" out the wrestling mat.... Get it????In all seriousness though, trans people shouldn\\'t wrestle. They should seek therapy. And since when did they start having girls wrestling?? I don\\'t ever remember this growing up. Crazy things we do with tax money",
    "Hannity, your lack of disclosure about your ties with Cohen, even if minimal, is highly suspect and  dishonest on your part. Don't pretend it's about the headhunting for Trump; it's now also about YOU, and your lack of transparency.",
    "CHRIST! Why don't you MUTE the translator, and put some subtitles on this video?",
    "This woman is at her core a gold digger. how can people not see that when its so transparent.",
    "It’s BEAUTIFUL!!!! The Demo-Rats still have not figured out WHY THEY LOST.  They are out of touch with reality. WHO CARES ABOUT TRANSGENDERED REDTROOMS WHEN YOU CANNOT AFFORD A ROOF OVER YOUR HEAD OR FOOD ON THE TABLE????",
    "Brings your kids in Africa where boys are raised to be men,  You can't have a strong voice,  beards,  good d*k and give all that to a man. To be Gay is a choice you Idiots.",
    "I cant claim to know what transgender people go through but at the same time this person is full of shit,he is deluded! he was born with a dick so deny it all you want or go through whatever superficial body changes but biology does not agree with him!",
    "The truth of it is Mexican  government  have facilitated  transport to this invaders something this reporter from Univision is not willing to admit\\nThe reached Tijuana  and its citizens fought to kick them out....",
    "*The only thing I didn't like about this story was the woman keep calling it THE GAY BOOK*",
    "“What are they saying?” Trump asked, referring to photographers who were speaking Japanese. “Please look at me,” the Prime Minister translated. Trump appeared to take the translation literally, and began to stare at the Prime Minister.",
    "This absolutely absurd they are wiping their ass with the Constitution gays and immigrants",
    "Batman senses a movement to undermine North America. First they push gay rights, then gay marriage, then transgender rights. What's next pedophile rights? This shit has to stop. Russia has their shit together as far as Batman is concerned. They even outlawed microwaves.....because it causes f##ckin cancer.",
    "proud of this POPE, and what he represents for my church, haters gonna hate anyways, he respects everybody... APOLOGIES shows HUMBLE and non judgemental towards gays and all those who has been mistretaed by other dring all this years",
    "What we are seeing here is the consequences of what America is\\nArms transfer agreements with the world in 2015\\n    1. United States: $40.1 billion\\n    2. France: 15.3 billion\\n    3. Russia: $11.1 billion",
    "In Afghanistan, Nato Forces pay money to Afghan Taliban for using transit route. On the other hand, It fights with Terrorists in Afghanistan. Then anyone can tell me, Whom terrorists, The US forces are fighting with ???  US is funding Taliban and accuse others for Harboring terrorists.... #WTF",
    "who in\\xa0their right mind would make that kind of joke\\xa0\\xa0\"I could stand\\xa0on 5th ave. in middle of day and shoot some one Translation I could\\xa0\\xa0take the life of another human being in cold blood\\xa0before witnesses... and not lose a voter\\xa0 Translation and not be held accountable\\xa0\"",
    "Americans also didn't allow gay marriage, now they accepted it and all of a sudden they want the whole world to change too. \\nIf most Americans didn't want same-sex marriage it wouldn't be a thing.",
    "God bless the gays and lesbians and I feel bad for the country for those idiots people and ignorant woman that are out there hugging and smiling ....and the cnn disaster chanel",
    "If you listen to the Helicopter transmission, he basically was justifying the Murder in advance.",
    "Welcome to Kenya, no gays here... Bitch. (Wish Pr. Uhuru had a mic)",
    "Can anyone help me? what speech is this, and is it possible to find a full transcript? :)",
    "...and yet Piers STILL never asked her about the issues facing transgender people. \\xa0The WHOLE interview was about how his feelings were hurt. \\xa0Just because you're an ally doesn't mean you are educated on the issue. \\xa0The BEST allies educate themselves. \\xa0Did he even read her book?",
    "there is nothing  wrong  with being  gay  but being  stupid  and ignorant unacceptable  so fuck you juan hernandez. .....",
    "Before he says \"I\\'ll cut you head off\", he said something which they didn\\'t translate. I\\'m being damn serious. He said \"I\\'ll fuck aghori\\'s mother.\" cuz he\\'s not an aghori. He eats dead people.",
    "STOP HARASSING LAW ENFORCEMENT!\\nWhy would anyone provoke a cop? \\nThis guy is so excited to push this officers buttons.\\nTry leaving him alone so he can protect you when you call him one day, crying that your feelings were hurt by your gay lover.",
    "Whadoya wanna bet that half of the translations aren’t actually what they said",
    "Why translate to Korean? The Korean president and his diplomats understand and speak English. What a strange formality",
    "''I accept you, and you get the same respect from me whether you are black, white, gay straight, Asian, bisexual, Australian, tall, fat, whatever it is. We are all people, and I look at the people of the world the same way, as my brothers and sisters.''",
    "I think some of the US troops stationed overseas or at countries where the US shouldn;t be, can be transfered back to the US and deployed at the Mexican borders. You don't need a real wall,\\xa0border patrols and security is the 'wall' he can mean.",
    "The book is about his transition from Michael to Michelle. From the male Michael to the female Michelle",
    "I didn't think that the joke was offensive.\\xa0 I thought that it was funny.\\xa0 My best friend is part of the LGBTQ community and even he thought that it was funny.\\xa0 He pretty much said the same thing that Judy Gold did.",
    "Sexual orientation is not a choice. Identifying as \"gay\", \"bi\" or \"straight\" is a choice. Engaging in sexual relations is a choice. But a person\\'s underlying sexual orientation isn\\'t a choice.",
    "The guys who feed chips, are they a gay couple?",
    "Wake up people\\nThey are complaining about gays being executed but some time earlier they told us that moderate syrian rebels who oppose goverment need to be supported. \\nGuess what. These rebels are now Isis",
    "Both Kim Jong Un and this Assad boogeymen, really do give off a gay mafia actor vibe.",
    "Package had Florida spelled\\nWrong.\\n\\nFake Arabic lettering that translates to “get Er done”\\n\\nSilhouettes of naked woman. \\n\\nI bet the next package will have a bud light sticker and confederate flag on it.",
    "I fully support Homesexuals and Transgender .But Furries and Otherkin is where I draw the line.",
    "She should\\'ve said \"Put some respek on my name when I come out as non-binary ya heard me\". But seriously I don\\'t have nothing against trans and if they want to have the right to go to any bathroom so be it, but what about the kids.",
    "It's true people in jail that have sex choose to be gay. What's the big deal",
    "What about people who are abused and exploited with internal devices like wireless ear implants, neurotransmitters, neurostimulators, electrodes etc.",
    "at 7:09 ........about the lack of his transformation was hilariously put",
    "You people are horrible. How would them being gay change the story at all? That doesn't need to be mentioned in the story. Does it just make you feel happy and satisfied with your hateful religious views because they got burned?",
    "cnn fucking sucks i dont give a damn about if he was gay you guys are useless and dont help any situation. So if he is gay what next what kind of help is that fucking news stations smh guess that money keeps you going",
    "it's fine don't pass the bill but businesses should not discriminate against anti-gay customers. if Christian businesses can't refuse to make gay marriage cakes, Gay supporting businesses can't refuse to make anti-gay event cakes. How about an anti-hypocrite bill?",
    "Translation: Republicans would love to have atheists voting for Republicans, even though most Republicans hate atheists.",
    "Everybody relax, hes ok. Hes having a sleepover at dennis rodmans house. theyre wearing matching transformers feety pajamas!",
    "All because some lgbt employees felt their safe space was threatened. They caused it by calling her. I would not want to eat there in fear of spit in my food. Some of those relatives were liberals, lol.",
    "Why on TV talking so fast? I can't translate that fast :(",
    "A lot of homophobes are deeply closeted gays. It wouldn't surprise me...",
    "\"If you read the transcript, you\\'ll see I\\'m boringly consistent\" ... that sounds awesome",
    "love Justin Bieber's girlish face,\\nwhich made his romantic stories in music video seem like lesbian true love!\\xa0",
    "This guy literally woke up and tweeted Transgenders are no longer allowed in the military. Didn't bother telling anybody in the Military, DOJ, his Ivanka nobody. Trump doesn't take his job seriously and acts like this only shows that!!!!",
    "Black babies were and are killed at birth for being black, you can't find out whether a person is or wants to be a lgbt until they make that clear once there old enough.. There is no comparison between blacks and lgbt at ALL.. So stop with the comparisons..",
    "President Trump doesn\\'t want a stenographer present or a recording made, because it is a routine tactic of his to make wildly false claims about what he has said. He won\\'t ever say, \"check the transcript\", because the transcript will prove he is lying.",
    "Where did they find the translator? He could barely keep up with Putin and missed many things he said. Kept stuttering and dropping words. Next time use a more experienced translator who doesnt have so much trouble with fast paced  speech pattern of putin",
    "Spoiler Alert: Transgender people don't actually exist. You're still whatever you were born as! There's no such thing as a mix between a man and a woman without an outside force changing it.",
    "Why are whites trying to push the disgusting gay agenda so hard?",
    "The CDU is a fairly conservative party. Also Merkel voted against gay marriage if that helps any of u homophobes and racists understand that she is not that much of a \"libtard\". She\\'s not quite as AMAZING as the GREAT Donald Trump though.",
    ">kids get shot repeatedly \\n>Kids protest guns because they're tired of getting shot \\n>ITS DA VIDEEOH GAYMZ BAN THEM",
    "I'am wondering. \\xa0Why is there not the same outrage against Islamists. \\xa0Who behead, stone, hang gays everyday in the middle east. \\xa0Muslims will not serve gays entering their places of business here in the U.S.. \\xa0Not a peep . \\xa0Why?",
    "Any moron that would sign on to the Democratic Party now. Has to be gay, black extremist who don't want to be successful, crimin, illegal aliens, and worse of all a Pedophiles. I hope I covered all the shot holes. Which sounds like this guy.",
    "Screw the gaytriots they are a bunch of cheats XD",
    "if sex outside marriage is a sin then God should already have brought His judgement on us a long time ago and we should all be fucking dead. but yeah, gay marriage is the problem, i get it,  #fucklogic",
    "HAHA, good job liberal media in mistranslating Putin's words!!! Putin did not say that he directed his government officials in interfering in US elections, he only said that he wanted Trump to win, because he believed Trump would better US/Russia relations.",
    "She needs serious mental help as well.  To ruin someone\\'s life by using accusations of rape as power over those boys.  \\n\"Girls\",  I won\\'t say women,  stop lying on good guys. They are already few & far between,  or Gay.    😉",
    "Anderson Cooper your gay.this is biased this is bullshit feminazi bullcrap",
    "Stfu everybody 96.87% people watching this is in the U.S talking shit about these niggas stoning a bitch. Be glad ur lazy is not there.\\nY'all complaining about being called female and male transgender bullshit.",
    "So apparently a gay, jewish catholic married to a black man is a nazi.",
    "His campaign slogan was YES WE CAN but after 8 years was more like I DIDN'T DO SHIT EXCEPT USHER IN THE TRANSGENDER MOVEMENT WHILE MURDERING MILLIONS AND CONTINUING THE ZIONIST PLANS TO DOMINATE THE MIDDLE EAST",
    "I searched T Gay. Like if you did to LOL!",
    "También hay que tener en cuenta los proyectos secretos de países avanzados tecnológicamente, que son reales por cierto. El tema ovni debe ser tomado muy en serio ya que es transversal a todo el planeta. Nos afectará a todos.",
    "One of you tries to translate the word \"Al jihad\"",
    "He's not gay. He just likes the way it feels.",
    "So you are telling me that Russia approved to clear their air transit without question so USA could fire missiles to Syria where Russia has their Air defenses set up? Keep in mind that all of this happened in 12hrs",
    "Insubordinate CIAs who may be either \"the Calvary\" necessary to eradicate the NWO or comply\\xa0with enslavement policy....Are presenting a danger to meat and tidy unwanted transition for future mind-controlled contraband....ref: .\"Apocalypse This Minute Redux\"\\xa0\\xa0 (in ball park?)",
    "Male female straight gay lesbian that's all there is not all that other shit",
    "Guys in life just be yourself don't be something your not. I can understand if your gay but transgender really? if your a guy your a guy that's all there is to it. If your gay at least u admit your a guy",
    "There's a black panther party still? I don't think so. You gay dude.",
    "wow check the comments   america   gayest place on earth!!!",
    "Dont chu touch her!! Lmao gay guy have a gf and a bike",
    "like his crack conspiracy?\\nIMPEACH TRUMP FOR GAYNESS AND BLACK MAGIC. war is on the brink.",
    "Why is it that Joan Rivers can call Obama a gay and Michelle Obama a transexual, but when someone ask her something she gets mad? What if someone calls her a cat and not human?",
    "I need to sit down holy shit, I thought giving them gay marriage was enough. \\n\\nOh she's done talking, fuck man I'm almost out, I'm just gonna pass the buck and dip.",
    "capitulato cabaretuto kra kre mijano banano for abiezjano,u masajuto buroki rozpierduto transformerso",
    "quick answer to the title? yes.i hope you republicans are proud of the fear ur spreading throughout America for the lgbtq+ community. we're humans just like you, you take away our rights, we protest. equality is for everyone, not just the straight and cisgender. fuck you trump.",
    "You gotta know he’s using the arguments that transgenders did\\nWhy van You change your gender but not your Age?",
    "Just have trump negotiate a great price for the great wall of china and have them transport it here.",
    "Why doesn't Obama tell the people the truth that this transferring of jobs to third world countries was a deal made in the UN. The idea is to make superpowers like the USA into third world countries. Obama says has no control, he made the deal without us knowing it.",
    "This idiot is an embarrassment to his religion. We live in a country with religious freedom so everyone has different beliefs. How the hell this idiot going to go on CNN a leftist platform that is ok with abortion and gay marriage and talk about gods law. Just stupid.",
    "Wasn't it possible to turn down the volume of the translator a bit more? I'm still almost able to understand what she is saying without getting a headache while trying to filter out Shinzo Abes much louder and more dominant voice. ... almost.",
    "Any christian here that believe that god is ok with gay marriage?",
    "Has anyone ever heard of national Security. But I have a transcript which I read Trump and Putin were setting stagy for NK and trading covert information on terrorist leaders  lets put our countries at risk and share our conversation with the world.",
    "When the FISA documentation is finally released, I guess America will know for sure what happened.  Rod Rosenstein certainly is putting up a fight and has ignored all the subpoenas mandating the release.  I guess he wants to maintain the FBI's lack of transparency.",
    "I wonder if the interference could be manufactured to prove or disprove the theory. Perhaps they caught part of a transmission or it was the sound of space itself or the wavelength of God? So many possibilities!",
    "megyn Kelly looks like a Transgender woman (born as a man) or in other words, disgustingly gross. fuck her",
    "God Bless You President Trump! Hardest working most transparent President we have ever had!",
    "So now that she's behind she wants more debates? So transparently despicable.",
    "i love this Tina really transformed what could have broken her...inspiration beyond music!",
    "he seems like he is gay secretly the way he talks (i don't hate gays)",
    "the day when brain will be transplanted. Whom will that person belong to !!",
    "BUT TRANSGENDERS AREN\"T WORTHY TO BE IN SERVICE?!?!?! YOU SHITHEAD!",
    "Sometimes president Trump erks me BUT this was soo great here!! Transparency at it's finest! Pelosi and Smucky looked like what they are, slimy creatures oozing around in the swamp!!\\n\\nThey gave 150 billion to Iran IN CASH and all of the sudden they're worried about wasteful spending?? Hilarious!!",
    "Oh no the bald lesbian is crying. Burn the constitution!",
    "I'm around a lot of gays and the show was hilarious and he shouldn't have to apologize for that....it makes me sick....so i guess comedians cant make jokes anymore.....im with kev !!!",
    "Image if the guy is a female lesbian black passenger......",
    "happy to see her great transformation to a beautiful lovely dog... Hope U find forever home soon...",
    "Use your military  medical benefits that you get for real illnesses, such as physical therapy, diseases, mental illness, etc. Use the money that you save up in the military for your own good, such as transgender operations.",
    "Proud to sin and proud to be Catholic? No, you're not gay. You're disordered. Your mind is perverted. You need help. There is a group in New York called Courage that can help you overcome this perversion. https://couragerc.org/",
    "RHC does not say, I was having lesbian affairs as Bill was off with Lewinsky.",
    "jan brewer vetoed a anti gay bill but passed a anti Hispanic bill in 2010. lol.",
    "Heyy he was translating wrong!!! I speak Arabic and that is not what they said!! That guys is fake!",
    "Biden voted for NAFTA in 1993. In 1993, which transferred millions of manufacturing jobs to foreign countries.",
    "What is wrong in our country? Its so transparent! Trump is a pathological lier, sides with Russia, changes his stories over and over again. He's transparent! Why don't people see this? Is America that blind and ignorant?",
    "Van Jones is a racist. And, I think he's gay for Jay-Z",
    "What's true and what's not? Was not Hillary Clinton against gays, lesbians etc? Then she changed her mind. Guess she need their votes. Was not Hillary Clinton for the re-segregation of the USA? Then she changed her mind. Guess she need their votes too.",
    "No offense... dis lady looks like a transgender Barbie doll :/",
    "hey do you know who owns RAPLER ??? dig it deeper before you accuse. MSNBC if you only rely on the data being fed to you by the LP and YELLOWTARDS.. Then you're reporting are FAKE.. Be transparent.",
    "in dublin they knocked down tower blocks to build housing.  I said that's great for the gay people because there's no were realy that high now for the Muslims to chuck yea off . they went mad lol . pc shit .",
    "Let me pose 2 questions:\\nHow do I compliment someone if everyone has this attitude, or do I need permission to compliment someone?\\nAnd\\xa0\\nHow would this type of feminist feel about a lesbian women giving her a compliment in the street, is it also wrong?",
    "''I accept you, and you get the same respect from me whether you are black, white, gay straight, Asian, bisexual, Australian, tall, fat, whatever it is. We are all people, and I look at the people of the world the same way, as my brothers and sisters.''",
    "Congressional hearings are phoney grandstanding platforms designed to create sense of transparency. The questions are generally asked to place replies on record. The answers are usually obtained prior to a hearing.",
    "Excellent, excellent, excellent!!... Probably the most concise, honest, and balanced take on the reality of Trump vs. Clinton supporters, ever! ... I want to copy and past this transcript into my Facebook feed for all my idiot Liberal friends to see... Thank you, thank you, thank you!!",
    "To \"UNFAIRLY\" give trans people right???? How is it unfair to give human beings basic rights?!!!??",
    "Meh, I'd rather have her as First Lady than the Transylvania transvestite we have now.",
    "It just goes to show that these people are confused, and no matter how hard you try to agree on the devils play ground you will always loose. This man did all that he could do to support this so-called woman, she and the transgender community still put\\xa0 him. down.",
    "WITHOUT USING BIBLICAL REASON TELL ME HOW BEING GAY IS BAD?",
    "He is showing support for Hillary, who support LGBT. He supports LGBT, why is there resentment towards a man who didnt the crime. Hatred can be taught by parents yes, but then again it can also be taught by other people in the streets, just like sex, drugs, bullying is.",
    "Lmfao I am suppperr gay and my best friend is a black girl. She encourages me to say stuff like “deadass” and “nigga” around her she finds it hilarious and of course I say it jokingly but of course I’m cautious about it.",
    "Tracy Morgan and his (or is it her?) supporters are losers. he is not funny. He made remarks that he would kill a child who was gay. well, he is the one who is almost dead now and it is exactly what the pig earned",
    "oh and he has a peace sign and bisexual pin on his hat wow \\nanother thing he shouldn’t be alive i do not care if his “still a kid” HE KILLED SO MANY HE DOESNT DESERVE TO LIVE !!",
    "God Bless them, they have all the rights to refuse, because gays didn't have the majority vote, so how is that constitutional, just because some judges decided to make it constitutional????? Then where is my vote?????",
    "We love him for it. He is real. Not pompous. Not grandiose. Refreshingly Transparent.  Unlike you, MSNBC.",
    "+Rick Beekman. I am an atheist and I do not believe in sin, gays can't sin. Religious liberty is bullshit I am perfectly happy for you to believe the crazy bullshit in the bible (including dragons) so long as it doesn't impact on the lives and liberties of others.",
    "I've just confirmed with my sources that this does look like a cloudpeople mode of transportation. You can clearly see they have superior technology from the way it moves in the air, since nothing rotates as fast that it seems to move in steps like a clock hand.",
    "PIERS.....How dare you not cater to this WIENERLESS FREAK'S INSANITY...What a transformer hater you are :((((",
    "Looks like being a feminist lesbian makes ya go crazy",
    "coming from a bisexual person, this isn’t the acronym and never has been. lgbt and lgbtq are fine and acceptable. lots of people like to make fun of us for using absurd acronyms but honestly a good 99% just say lgbt, adding q and/or a +.",
    "Why do almost all of these college kids speak like gay men?",
    "This is bullshit I hate the fact we want to help but are not allowed because I am gay",
    "Is that Kimberly a transgender......? she looks like a man and that one asshole is gay and I would smack the shit out of his frutty ass if I ever catch his punk ass on the street. Fake ass news......!",
    "Ahahaha syrian gay guy is talking in english with no accent stop lying Liar media",
    "Only thing this station and lesbian witch pushes is lies and deception...SMH",
    "4:40 So if a gay guy says hey girl its cultural appropriation but when a straight black woman says \"shade\" (Which was originated by the gay community and drag queens) it\\'s nothing?",
    "Obama is a total fraud. Hillary Clinton sold her position as Secretary of State for millions of dollars. There is no transparency from either. They both promote fictional narratives for PR and care nothing about the truth.",
    "if you can be transgender, you can be transrace, right? No wonder America has so many problems when you accept people into college because of their skin color, instead of their intelligence.",
    "They should have it always preloaded to nonlethal first! if it's already set it would transition to lethal as fast as you could press the trigger but if the threat is neutralized after the first shot then no need. Stun guns work well in many situations too.",
    "this is all the left has .......Donald Trump took all the issues that the left used to run on....... but they cross the line with the transgender bathroom issue and there's no turning back for them......",
    "Does a transgender have a 6 inch penis or a 6 inch clitoris ?",
    "Why do they think it's a good idea when world leaders talk about important issues to translate on the fly? I know both languages and so much was missed. Translation for the views should be recorded later.",
    "Landslide vote on legalising gay marriage and landslide vote on women's choice GO ON IRELAND!!! :D :D :D",
    "putang ina (son of a bitch) is like when you say fuck. it is not directed at anybody.   putang ina MO is when you direct it at a person.\\n\\nget better translators !!",
    "The kid was obviously standing with an adult while that transaction was made.",
    "Hey, let's get the most transgender, lesbian, shaved head to imply cancer looking kid we can find to speak so the public is afraid to say anything in opposition to her.",
    "Umm... gay or not, a male is a Warlock. Not a witch.",
    "The biggest trick the devil ever pulled off was convincing the world he wasn't gay",
    "what the fuck are all of these comments??? Piers Morgan is a piece of shit and SHE WAS NO BORN A FUCKING MAN. Gender is an identity. Everyone here is so fucking transphobic and needs to learn so much more. This pisses me off",
    "Funny enough the lesbian woman sounds more Christian than a “Christian” \\n\\nLove and Kindness. God forgive us all. 🙏🏾",
    "The height of hypocrisy is a president who humps the flag, and cheers people who wear the flag as clothing, calling other people disrespectful.  The right wing bias of the media is made utterly transparent by refusing to call out the republican party for their disrespect of the flag.",
    "Famous 1960s Motown singer Tammi Terrell suffered from this same disease.\\xa0 She song those duets with Marvin Gaye like 'Ain't No Mountain High Enough', 'Ain't Nothing Like The Real Thing' and 'You're All I Need to Get By'.\\xa0 Beautiful woman, youtube her.",
    "You will be a winner as you have transformed the Americans into formidable winners.",
    "Donald trum tiene justos y movimientos de gay miren como mueve la boca y las manos",
    "You know what for ya dumbass people saying that it a choice to be gay look a guy and see if you would even try to be attached BEFORE you even reply to me.",
    "Why would a gay man would want to be right wing?",
    "He was ashamed of being gay and it drove him to the breaking point.  Very sad that do called religious people of all religions cant accept that god made gay people too.",
    "you can't go to Gay Headquarters after you've been talkin shit about gays",
    "Two completely different things being black and being trans.  They don't belong in the same sentence.  Just saying.",
    "When r they going to blame Obama, gays, or the transgendered?  ",
    "Wow, I didn’t know that he’s gay. Tim is such an awesome person! Go Tim!!",
    "Why is this transexual newscaster covering up for the monster?",
    "People still do not realize Rachael Maddow is a Trans Sexual.",
    "Every country has their own right bruhh.and LGBT no ones really alowed as a good thing .LGBT they should being rehab...now imagine how if your father is a Gay .are you  guys accept him?? i bet you guys must be feel",
    "How the heck didn’t I know that Tim Cook was gay?? This makes me so happy!!",
    "Cnn is crap fake news. Cnn women transgendered. Watch Russia Today 4 real news.",
    "I was gonna post my opinion here, but the amount of transphobia in these comments is literally so fucking disgusting. It's actually scary that people as bigoted, self-righteous, and overall nasty exist. ",
    "What is USA doing in Korea if not for warmongering reasons.south Korea and Japan are well capable to defend themselves there are no need for an army of transganders from USA there.USA is threat to the global world and must be stopped.",
    "Pure extremism right here bois, they're taking a law right out of the islamic state. Good job let's just keep regressing, stop using god and gay people to try and justify your sadistic urges.",
    "He's a non binary transgender pansexual bisexual  muslim latino Hillary supporter refugee and vegan.",
    "We have no idea who is doing this. We do know that they are a very sick person be them Muslim, Christian, Black, white, Latino, gay, str8. Sick SOBs can come from any background. Why in a city were everyone for the most part gets along?",
    "It looks fairly obvious that this man had already had some type of injury to his spinal cord before being placed in the van. \\xa0He can barely move his legs and is screaming in pain. \\xa0Further injury could have occurred during transport but something happened before this event.",
    "Why so many dislikes?? I really don't get it and this comment section gives me headaches.\\nWhat is so wrong about gay people being able to finally marry? It honestly took Germany long enough to legalize it. I think it's great news :)",
    "There weren't any problems before being lesbian, being gay , being bi . Except the fact that we always thought we were better , and now it led to these things . It has to stop, we need to take a stand that we are all equal.",
    "People getting outraged about western civilization imposing its ideologies upon African countries although gay is not a western concept, it’s a global one and this interview isn’t about putting Kenyan people under the pressure of changing their constitution it’s about to what extent LGBTQ rights are respected globally",
    "I ate goldfish 30 years ago and now I'm gay",
    "my advice,don't be going to Syria and say you are gay",
    "As an airman. This sounds awesome. Maybe I’ll transfer over",
    "she translated it all wrong to create more drama.CNN=Fake news.Lost all credibility a while back",
    "Kevin hart had that \"stop that\\'s gay\" bit on his stand up... why\\'s this coming up now",
    "No disrespect intended but, why are so many white men gay ?",
    "Go Rand! Muslims and gays have the right to keep their phone convos secret!",
    "I think they tested some sort of nerve or cardiac agent on him. Kim seems to be fond of them, take how he killed his brother for instance. This might be a response to the movie \"The Interview\", where they attempt to kill Kim with a transdermal ricin patch.",
    "Omg I thought the person talking was a gay man 😂   \\nBtw I love Gay people 🌈🌈🌈🌈🌈🌈🌈🌈",
    "Trump is truly a terrible human being. Trump is anti gay, racist, and anti lgbtq+. He is scary and he needs to be stopped. I hope to god he gets sent away far away",
    "I'm offended as a teacher who happens to be Caucasian.  I treat All my kids as my own, no matter the color of their skin or male/female/ transgender,  etc...Everyone of my kids are equal in my classroom.  ",
    "I don't understand, aren't transwomen former gay men who no longer like dressing in drag?\\nOr at least gay boy's who want the female role in a male/ shemale relationship?  I guess my question is: Aren't all transwomen former gay men.",
    "Gays will not change people's hearts no matter how much they push their agenda. It's still deviant sex acts.",
    "hey texans, while the national guard is saving your asses.from noahs flood why dont you ask the kind service member if they are transgender. im sure they would be glad to leave you off the ark.",
    "Where is the TRANSPARENCY wall prototype?!! That would be the best and smartest choice",
    "The fact that this gay couple was molested by a gang of muslim youths (mostly Moroccans & Turks) is carefully omitted from most headlines. They are \"protesting against homophobia\", but in reality they should be protesting against islamic violence, because that is what is really going on.",
    "Love Jazz! She's a strong, positive roll model for the trans community.",
    "wait so ya'll support a Baker not baking a gay person's cake, but Twitter must allow everyone to use their services even if they breach their TOS...? what happened to we reserve the right to refuse to do business with anyone at anytime...?",
    "Thank you Anderson for asking this political opportunist why she suddenly is standing with LGBTs.\\nAnd then ask why she dropped her lawsuit against Trump University after receiving a hefty political donation from Trump.",
    "Anderson god bless you are so cute...I dont care you are gay, congratulations",
    "long live the kennedys! an honor to have met them and become friend of members of this transcendental family!",
    "Homie turned gay as hell quick look at that hand",
    "Where is Trump or Obama the corporate slaves?\\n\\nIn what\\'s being called the first \"Trump deal,\" Sunoco Logistics Partners has announced a nearly $20 billion merger with Energy Transfer Partners, the Dallas-based company that\\'s building the Dakota Access Pipeline (DAPL). \\n\\n\\nhttp://www.motherjones.com/environment/2016/11/dakota-access-pipeline-etp-sunoco-merger",
    "Put rainbow colours on the confederate flag have gay pride stamped on it \\nAnd give it a new meaning ",
    "There is a difference between becoming gay and realizing basically everyone is bi, at some level.",
    "If the US wants to destroy terrorists DO NOT STRIKE Syria. Those busses are transporting Terrorists and their families out of the area. If Trump orders those strikes against Russia, it will look like the US is defending terrorists and will most like start another war.",
    "Fine, I will buy you a couple drinks. Now, pay me back my tax money that went to Welfare, Food Stamps, HUD, Obama Phones, Medicaid, Obama Care, Housing Projects, Government Cheese, Public Transportation, Abortions, ........",
    "I guess Trump forgot he passed the tax bill to benefit a company like Amazon..... And by the way, if he fixed the transportation infrastructure so people can go to stores more, maybe they would survive better.....",
    "I'm surprised this Texas Taliban dickhead isn't blaming Harvey on transgender bathroom issues.",
    "There should be an entire brigade of transexuals, transvestites and crossdressers charging against ISIS. Imagine how demoralized the forces of Allah would be getting their asses kicked by a bunch of freaks. Haha.\\nSidenote to some of you posters:\\nThere ain't no God, you morons.\\nF U Butt Puckerson.",
    "Another good ol False Flag graciously offered by your gov. \\nhttp://www.njtransit.com/tm/tm_servlet.srv?hdnPageAction=PressReleaseTo&PRESS_RELEASE_ID=3063",
    "Why don't they take questions..?.... hmm transparency..... where is it?",
    "Homophobia strayed from the original meaning... It was originally the fear of becoming gay.",
    "Release ur transcripts hillary ..and no we dont even care bout bernie hes paid by the American people ....not by wall street like you...she wont release sheit ...shes gonna say they were stolen or some bs lol",
    "Her statement is simply not believable, period. She's lying and it's transparent and embarrassing, she should be ashamed.",
    "Most famous feminists are transexuals males dressed up as females Wake up sheeple!..Are you sure that she is a real female ? How this person dare to talk on behalf of women ?",
    "Bannon\\'s \"eloquence\"? What the hell is a \"jumo\"? Either the transcription was wrong or Bannon (like Trump has more than once) used a malapropism...or else it\\'s just another \"covfefe\"-style mystery. SMH",
    "omg dying 😂 I want him to release a get ready with me and a transformation video 😂 I want to see his diys of him faking being black I'm deeeaaaaad",
    "People getting outraged about western civilization imposing its ideologies upon African countries although gay is not a western concept, it’s a global one and this interview isn’t about putting Kenyan people under the pressure of changing their constitution it’s about to what extent LGBTQ rights are respected globally",
    "its funny to me to see these politicos argue and want to do it privately, they want concessions and give backs, and they HATE transparency.... what I see is they just dont want Trump to win or appear to win ANYTHING",
    "''Alpha Male '' = the new american codename for gay people . . So yes, ''Trump is Alpha as fuck, expecially with all that orange girly make-up!  Main atraction in every gay bar ! ''",
    "2:24 when a twitch streamer receives a donation and google translate spams the message",
    "Some people don't have the money to evacuate . It is hard to get away when your income don't allow you to move out and you don't have transportation and no one\\xa0 wants to help you. So what do you?",
    "Very very thankful that Kavanaugh, representing Republican conservative views, was confirmed... As this whole circus was fueled by democrats against morality... who want the evil murder of abortion and the abhorrence of the transgender and LGBT movement to continue. May God, in his Mercy, not take his Blessing off America.",
    "I had to watch twice I thought the kid was trans and it didn’t say or something",
    "CNN  WANTS  US  ALL  U.N.\\n CONNECTED  GAY AND OPEN UP TO FAIL...OH WITHOUT GUNS,,",
    "fake and gay. you can totally see the cgi coming out of his stungun.\\nnice try Wolf Blitzer",
    "there is a problem with the translation, she didn't say they were going to sue Fox News, she said they were CONSIDERING (from the verb envisager in french) to sue Fox News",
    "maybe im a liberal...old fashioned liberal. i dont like gays all that much but hell live your life. just dont try forcing that shit to others and  government for sure should not force citizens to as well.",
    "XX chromosomes = Female\\nXY chromosomes = male\\n\\nWhy is thos so hard for some people to understand? this \"trans\" stuff doesn\\'t change anything. Unless science finds a way to change your chromosomes and change the private parts you have then you aren\\'t trans. just a weird science experiment.",
    "I wonder what he would think when his kid goes in with someone who thinks they are transgender --- just another Zionist who wants to change the world --- ass hat",
    "She didn't try to order a cake for a gay wedding, did she?",
    "Where is the Transcript to Wayne's Full Speech? Where is it readily available?",
    "Does anyone else notice that Gays are all Jews and Blacks?... Just sayin",
    "I still don't get it, if trump is so successful how can he completely blow what should be the easiest of transitions, and just hire people who are competent, he has just killed his honeymoon, at the door.",
    "1st off. Oh boy gay. 2nd off that's what happen when you hang out with all those white folks",
    "Normally, US soldiers don't go to sea, unless they're on an Army boat, like this...\\nhttp://archive.defense.gov/transformation/images/photos/2004-11/Hi-Res/041103-F-2760K-017.jpg",
    "This Cruz guy is totally gay. Joe Rogan was right. GAYYYYYYYY!!!",
    "Wow that was a great interview ! did CNN forget to disrupt the transmission ?",
    "Well the motive for 'them' pushing transgender (mostly onto white boys) is clearly sterility. As for tne parents I am convinced this is an expression of Munchausen by Proxy. The parents are craving attention. The children need to be removed!",
    "Michelle is a transgender and is a man..vote for trump people. .",
    "Is it possible for a transgender to make it through MEPS? Highly dought it.",
    "I would have to ask leftists:\\nDo you believe that Churches should be forced by law to perform 'gay weddings'?",
    "This is bs I rather here what this young lesbian have to say for real",
    "It's hilarious watching some of these right wingers struggling between their hate for gay people and their hate for muslims.If it was a white christian that did this they'd be secretly applauding it lol.Shitty cunts through and through.",
    "Fake and He's Gay!\\nWhere are all the gargled out uhhhhh's?!",
    "Sadly, Trump has lied to the people that supported him throughout his candidacy. He promised to give his support to the LGBT citizens of this Country. Instead, his real self is showing once again. He's a total hypocrite. It's obvious that his brain & his tongue do not work together.",
    "cool she called him out on the taco bowl but I can't get over her saying black men needed to be brought to a heal & being against gay marriage & working for Walmart 😂",
    "Somewhat agree with this, but can someone explain me what is going on here  1:47 ?  did someone change the translation?   is funny  how media take everything out of context ;) God Bless America!  let's keep media wash  our brain.",
    "When one learns the facts, Trump ALWAYS  turns out to be right. We do it much better in Minnesota, much more open, fair and transparent. This is ridiculous, and no way to pick a leader. If I were Cruz, I would disavow the entire process.",
    "I watched this interview and listened attentively to her opinion on the gay issue, if you as a Nigerian could support homosexualism, I can't appreciate anything you do again. This world is surely coming to an end",
    "rachel maddow is such a lesbian icon and she is so well spoken and talented. i feel blessed every time i watch her broadcasts. also i would love to r*w her 10/10",
    "Pence and his religious right cheerleaders are well known anti gay bigots, they want to see LGBT eliminated from society. To suggest otherwise is the real fake news. They don't care about bullying ruined lives and suicide. Sick evil bigots trying to cover it by a veneer of religion. Sick.",
    "I agree with the president of Kenya      there are more important issues than LGBT rights. The entire continent of Africa has not developed to the stage were this way of reasoning is culturally accepted. An overwhelming number of Africans are homophobic.",
    "as a gay man I must say that transgenderism is NOT a gay identity at all .. It's something quite different . Yet we welcome them into the fight as a sexual minority",
    "\"Free media access to a transparent government\" LMAO So the Obama administration was completely transparent? I think not...",
    "DONAld DUMB is a gay and masterpiece OF SHIT hahaha LOL !!",
    "The wall is about \"big contracts\" and \"transfer of wealth,\" period.",
    "As a bisexual i don’t want to be included in lggbdtttiqqaapp",
    "If you think being gay is a choice, you are bisexual or gay because if you say you can choose to be gay and have sex with the same gender with no problem whatsoever then you were born either bisexual or gay.",
    "CNN is fool of gay and lesbian  amanpoor we need technology not sexual orientation.",
    "I don't care if your trans. But answer the dang questions and stop talking about your book....",
    "GAY FOR SURE GO TO HELL ALONG WITH POPEIE BOY",
    "LOLLLL She can\\'t even explain how \"gay\" he was. Such BS",
    "China should follow international law, China provoke all the world not only Sea of South East Asia (Its is not South China Sea) But India and so far invest for N Korea and others so on and trans spread toxic food to the world",
    "Ignore transportation specific punishment dawn sense essay test decision face.",
    "Guys quit bashing the queer this video is not about that it’s about accepting everyone for who they are and really buzz feed uploaded the video so it’s gonna be stupid  (yes, I am straight)",
    "This is proof that the U.S. needs to put more money into public transportation and infrastructure. :/",
    "Actually the black boxes (flight data recorder) transmits signals if the airplane crashed so that searches can locate the blackboxes easier if it is oversea. However this signal can only be detected by a special instrument near by.",
    "\"I\\'d like to help the hungry and the homeless, but it\\'s such a big problem, you need Federal Government assistance.\" Translation: that\\'s not my job. That\\'s the gov\\'t\\'s. (and yet, taxes must be lowered).",
    "Anderson Cooper is also crying because he is actually gay himself,look it up\\nR.I.P Orlando Victims\\n😫😫😫😫😫😫😫😫😫😫😫😫😫😫😫😫😫😫😔😔😔😔😔😔😔😔😔🌹🌹🌹🌹🌹🌹🌹🌹🌹",
    "Your so gay for that the snake was trying to eat",
    "His name is Paris .Only in America ,gay black republican wtf.",
    "You know, if I were to make a guess. I would bet\\xa0the people who attacked that one girl for being racist for having box curls, but would defend this women using\\xa0an ethnicity not her own,\\xa0because she\\'s \"trans-black\" now.",
    "Wow If we Come down It's Not Straight down\\n\\nIt's Gay Down💯😢",
    "If you think being gay is a choice, you are bisexual or gay because if you say you can choose to be gay and have sex with the same gender with no problem whatsoever then you were born either bisexual or gay.",
    "uh you sure she's transgendered? I thought she was mom.",
    "The only thing I find disturbing about this is the transphobic comments from individuals that obviously are self centred and very lonely that’s why the world is in shit because we have to live among these dickheads please don’t reproduce ffs 😂",
    "I don't understand.  What does LGBQT have against Trump. I'm a gay man and I don't recall him attacking, threatening to repeal any law or build a wall around our communities.  Can someone explain?",
    "Fak brp  lk goc English translation fake bro like God",
    "If you are having a financial situation, contact LordRoy for credit card top up, bank wire, PayPal transfer, email hacking, social media hacking, spy emails, hack bank accounts(WB), bank transfer, money gram and western union ETC\\r\\n\\r\\nContact me: Redlordroy@gmail.com",
    "Trump should release his tax returns for the past eight years and every year he's President for transparency and for public peace of mind.  I'll hold every President to this standard regardless of party affiliation.",
    "I remember seeing this same guy in cringey trans rant videos",
    "So many homophobes but ya'll still probably beat your meat to some lesbian porn",
    "I got sum to say to the gay couple. Quit whining and bitching about a cake quit fucking crying it's a damn cake.  Y'all act like a 2 year old who dropped his lollipop",
    "The question is ,are there gay people in Kenya or Africa ?",
    "the Pope is right, the translation in English is wrong , the prayer in English is wrong",
    "To be honest this looks like mass karma our hate has a face. \\nMen hating women vice versa \\nwhites Hate blacks \\npeople hating Latinos and Jews Heterosexual men hating Gay Men\\nBefore people throw stones they need to look at what groups they hate on their own hearts",
    "If there is transparency there is no need for leaks.  Where is the transparency that we were promised?",
    "Wow this was unexpected of CNN, truth for ones! The only thing, is when he started translating the young man, the first phrase he actually said was - \"We were not paid to do this.\" Meaning, that it\\'s citizens\\' own will to unite with Russia.",
    "Release all the memos, so that the American People can see all the criminality that was used against Trump. Obama and his appointed flunkies are Guilty Guilty Guilty. Indictments Forethcoming for all of these Treasonous TRAITORS. \\n #Full Transparency \\n#Treasounous Traitors Targeting  TRUMP",
    "When I think that Obama could be married to a Transgender, I laugh so much thinking of the millions who were fooled. To pull such a stunt would be amazing. Would the world recover from it...i'm not sure!",
    "BREAKING NEWS: TRUMP TAKES A SHIT, FAILS TO INFORM MEDIA - LACK OF TRANSPARENCY IN TRUMP ADMINISTRATION",
    "If you want to make gay parades, can you at least make an exception to this holy city????",
    "For all, comparing this to the gay cakes incident, these guys didn't ask the driver to play trump speeches during driving, and praise trump with them, they just wore some clothes! It's like the gays wore rainbow clothes, and the baker would've denied service!",
    "I'm a post-op trans woman, can't stand the liberal PC culture, and voted for Trump.  Of course, I don't advertise my life.  Not even the people I work with, and many younger members of my extended family don't know that part of my life.  Go Trump!",
    "Kein Witz, der kerl, der geschlagan wurde, sah aus wie kim jong-un (TRANSLATION IN ENGLISH CAUSE IM GERMAN but my vids are in english cause google translate AND I HAD TO USE GOOGLE TRANSLATE: No Joke that guy who was beaten looked like kim jong-un",
    "Devil in the detail here. Janet wasn't a man, because she didn't identify as one. As simple as that. It's also not for him to decide what is offensive for trans people.",
    "Wow this is the only time I agree with Fox News, wtf is that?!\\n\\n\\nAnd isn’t demisexual bisexual oml...",
    "Africa has finally come of age. Lets agree to disagree, LGBT issues wont be pushed down our throats. Lets discuss environment, technology transfer, Food security, National Security, Education, Health, wealth creation and so on. Personal preference on matters bedroom is just that PERSONAL. Lets move on.",
    "There is always a delay in audio being transferred to the person being interviewed, with that being said he is not thinking about what to say before he says it, he is just finishing listening to the question.",
    "lmao fox released it?  fake as fuck.  they released a fuckin g flare but indoctrinated  people think its real cuz their tv told them haha fuck u fox ya bunch of gay freemasons",
    "Why can't CNN put subtitles the translator is putting me to sleep",
    "Wish I being a transgender with hiv and who's unemployed wish I could find a fucking JOB / Slave trade where I didn't have to do my JOB and keep it. Kim Davis needs to be fucking fired !!",
    "In the same scene where it says \"Homeland is a joke and we aren\\'t laughing,\" it also says: [translation]\\n\\n\"Against:\\n\\nthe devil\\n\\nred\\n\\nblue\\npurple\"\\nI find it so funny that no one seemed to say anything about that because maybe it\\'s not an important issue but it got me to laugh. LOL",
    "that really sad to all those death that happened I know I don't like gay but that doesn't mean u don't like gay u van come out of nowhere killing gay and ppl that u hate 😭😭😢😢💌💔👬",
    "FUCK all the churches gay couples can simply go to the courthouse to get married",
    "Trump steps out of white house*\\n*breathes into microphone\\n\\n*youR\"e MoM and daD gAY toGeTHeR*",
    "These two just absorbed a TON of radiation from the transmitters.\\xa0",
    "if you think about it, the pope would go to hell because he's technically marrying god and gods a male, so he would go to hell for being gay. Too many flaws in this religion. hahaha",
    "I feel if she wants to be black let her, if she wants to be purple or white let her.\\nits all about what you feel not what you look like. e.g transgender.\\n #justmyopinion",
    "WELL I'M CALLING HER OUT! SHE'S A LESBIAN AND SHE'S NOT IN THE GAME!! IN JESUS NAME!",
    "Kim Kardashian looking like a Transexual, I’m so distracted by this!",
    "My boy Donald is killing it. He cares about our LGBT community and everyone else! He is a very flexible GOP that attracts both the left and right. I love how much he cares about this country",
    "Israel schould  occupied Egypt's and made a big country in middle East and transfer to Syria all muslim population those who are living in Israel and occupied Egypt  and do rule no islam entree in this country jai Israel i love israel",
    "Trust me if being gay is a choice I wouldn't have tried to commit suicided a dozen times !",
    "Oh, it's the Skinhead Lesbian who bullied the shooter. \\n\\nShe's responsible.",
    "Also I thought LGBT+ with the \"+\" being a short hand for more then just LGBT was adequate... no one is gonna take a 20 letter acronym seriously. \\n\\nSaying this as someone who supports LGBT.",
    "It came from Craigslist .... Marlan Bundo might be gay",
    "Im back after this joke became viral.\\nLook at Trump on 9 11 2001? \\nhttp://www.elitereaders.com/wp-content/uploads/2015/07/head-transplant-1.png",
    "The ELT should be transmitting it's location. What the hell?",
    "round them up,feed them  and transport them back home.",
    "Using the LGBTQ community to push a Gun Control agenda that would have done nothing to stop the attack is shameful. It is just a distraction from the fact that their foreign policy has been a complete failure. The Democrooks never let a good crisis go to waste.",
    "asked about the transcript her answer will be did I mentioned I have a vagina",
    "For sake of transparency: Miller asserts that Bannon\\'s remarks were \"vindictive\" due to his ousting in August 2017, but as a matter of fact, those specific remarks were from March 2017, five months prior to Bannon being fired. FYI",
    "i believe every individual should be their own person, this whole mentality that blacks, gays and women can't think for themselves, that they need to be lumped together in a party that hates each other is ridiculous...",
    "gay rights? humans have rights to live naturally not perversely",
    "Gee...a lesbian liberal hates Trump??? Nooooo, in no way could she be slanted. \\nSounds like finger envy to me.",
    "isis member speaking his language:  \"yea i havent seen my kid in a couple of months and it makes me sad\".\\n\\nAmerican News translation : i like killing people and bombing people",
    "\"But can the other Hilary Clinton do this?\" *TRANSFORMS INTO SWASTIKA*",
    "she has nothing to worry about because he is gay.",
    "Wow, disgusting. Shame on the gay community for embracing this man, or any transgender, as real men or woman based on attire. Keep in mind that, this man still has a penis.",
    "sorry, but you're deluded if you think that christians are being persecuted in the us. christians however are being persecuted in some third world countries like africa and the middle east. with that said gays also get persecuted as well over there.",
    "Why is it that Joan Rivers can call Obama a gay and Michelle Obama a transexual, but when someone ask her something she gets mad? What if someone calls her a cat and not human?",
    "Honestly fuck CNN and their bullshit what a gay little video they made",
    "Protect the LGBTQ community from \"the hateful foreign ideology\", what about the hateful domestic ideologies?\\xa0 I think most of the applause was the thought of opposing Muslims more than helping LGBTQ.",
    "Super bowl haha you yanks realise no 1else plays that gay egg ball but you guys.",
    "Omg so many black gay lesbian  feminist and illegal democrats on the comment section tonight",
    "lol, is this guy gay. Your not good at lying.",
    "Schlock\\nOpening up his time to run for prez....first gay prez.....or not",
    "I'd just like to say I loved the transitions. White/Blue/Red in a horizontal format. I died watching. 😉",
    "Translation of “I want a better life and a job”:  \\n\\nThe translation is “I want a job that belongs to a LEGAL US Citizen, free welfare, and the US government to educate my children for free.”",
    "I’m gay and I’m so embarrassed. I want gay people to be separated from the acronym entirely please (of which I don’t really want to associate with anyway as I don’t feel like I’m part of a ‘community’).\\n\\nThis is so nonsensical to me.",
    "As a lesbian, I don\\'t need a note for skipping dates. I just need to say \"come on over! Rachel Maddow\\'s gonna get salty!\" and suddenly it\\'s a date at home :D <3",
    "Hey Jazz +Jazz Jennings. how do I tell my parents im transgender",
    "The military is not paying for these transgender surgery's so I see no reason why transgenders can't be in the military. Why does everyone care when they are protecting your country?",
    "Why do gay people have to always shove their beliefs down other people's throat?",
    "Justin Bieber is gay!!!!!!!!!  I hate him so yes he should be  deported!!!!!!!!!!",
    "This got super gay when they try to put blame on Edward Snowden",
    "Confused.. Before he died he was a boy and is now a girl.. Is the kid transgender?",
    "Jesus Christ the left is so retarded they don’t let any right commercials in tv and if you’re on the right like me you’re automatically wrong according to the gay left",
    "I thought she would say \"I\\'m a lesbian\" but she just said \"I\\'m a non binary\" which is a stupid internet thing that makes no sense. She\\'s a woman and that\\'s all. I mean, go live your fucking life.",
    "Follow us to know the transport mobility in Rome for this great event",
    "Make gay ppl free for apple products and services. U r not doing any help just coming out",
    "This is such a sad story I am formally discussed by the man no this killer has made a dent in our choices of sexuality this is so disturbing because....he was one of the lgbtq+",
    "Yo okay kids can totally dress how they want but medically transitioning is a whole other thing, this is okay, as long as they’re not forcing it on them, and they have the choice to go back to being a boy or w/e.",
    "I’m in support of gun laws if it wasn’t a skinhead lesbian on my side",
    "fuck , these transcenders are scary as hell...they will win the war just by showing whats under their skirt",
    "God bless the gays and lesbians and I feel bad for the country for those idiots people and ignorant woman that are out there hugging and smiling ....and the cnn disaster chanel",
    "The only way you would know that is if you were gay. Checkmate.",
    "Republicans want Joy Reid fire is so funny to me because republicans is anti lgbt. Joy apologized because that was 10 years ago and grew from it. Republicans are still racists and homophobic still living in 1950’s.",
    "Hey, haters -- Our President Obama, PBUH, employed this lady, and he has the most transparent administration in history, so put two and two together and you'll know that there's nothing to this smear campaign.!",
    "That's the only last gay hug that I will be seen!",
    "You bigoted people said the same shit about blacks, women & gays. What was it that Churchill said... \"You can always count on Americans to do the right thing - after they\\'ve tried everything else.\"",
    "Well he needs a job that pays a living wage ... perhaps he needs job training and affordable housing ...Maybe a deal on some  reliable transportation....Kindness could go along ways here .",
    "First they want to be gay, now they want same sex marriage, what's next their gonna want to raise up a whole generation of gay kids. Man this is screwed up",
    "This is what happens when you empower the unpopular kids from high school ( safe spaces, lgbt rights, political correctness, trans bathrooms, etc etc ). Once you unlock pandora's box, this is the evil you get.",
    "Wow this translating lady has a cool accent lol. It's like a mix of North American and Mexican.",
    "To TrumpleThinSkin's apologizers twisting the meaning of consent during your mansplaining,  please read the transcript of  Summer Zervo's experience and then imagine Hiliary doing that to a Senate page.  Dealing With a Hostile Work Environment? Who is going to  Advocate for Workplace Rights?",
    "people who don't like fox news sound gay as fuck",
    "The inauguration is about a celebration of the peaceful transfer of power.\\nAlthough agenda based fucktards tend to forget facts",
    "Translation :  omg people... I wasn\\'t warned about this potential disaster when those nice people in the hooded robes said I was \"The Man\"! Please help me refund my soul... I want it back now, this is scary.",
    "God, imagine if that girl came out as trans\\nThat mom would be pissed hah",
    "Lesbian, Gay, Genderqueer, Bisexual, Demisexual, Transgender, Transsexual, Twospirit, Intersex, Queer, Questioning, Asexual, Allies, Pansexual, and Polyamorous.",
    "Usually the ones shouting the loudest get ignored. And nobody even understands that fool. How did security let her slip back in and take so long to kick her out. And yes shes dressed like a vegan lesbian 😂. No hate replies she just lived up to a stereotype",
    "MSNBC please do more research. It;s not only Duterte who used fake news but the Aquino administration as well. You guys should put more transparency on your posts. And not blatant one sided news like this.",
    "Everyone shut up about kayne west he is a genius!!!! ......\\n\\n\\n\\n......and a gay fish lol",
    "look at this puny halfgayazzed dweeb...he never wanted a woman himself he likes manazz and sheeit",
    "I don't like gays but, I fuckin hate ISLAM. ISIS = ISlam Is Shit !!",
    "The hypocrisie from the left is ASTONISHING!  Funny now they are requesting more paper work and transparency yet they themselves refuse to release documents requested by Judicial Watch and other senators regarding Mueller's investigation.  HYPOCRITES!!!!!!!!!",
    "There is no competition in Wall Street. It's a handful of well-established banks. But even if it were equal competition, I do not believe that speculation is good for any economy. We need a higher emphasis on long-term investment than some quick, short-term transactions enacted by mutual fund operators.",
    "Gays/trans just butthurt because deep down they know they’ll never be normal. Enjoy your twisted existence you weirdos",
    "Let's see the good faith and transparency from our congress and senate members and have them release their tax filings for the public to see . The legislature is responsible to the public and represent the people when they vote to create laws and state statues .",
    "Now this is an open proof how CNN covers up... no mention of Gay pride..",
    "If I knew a bakery had discriminated against gay people, I would definitely shop at a different bakery.\\xa0 If I knew a restaurant had discriminated against a person for their political beliefs, I would eat at a different restaurant.\\xa0 We don't need any\\xa0new laws, just common sense.",
    "Didn't see shit....great clip in your news report, CNN - you suck.  Gay bar?  Where's their shirts?",
    "Why is he in a gay night club if he had a girlfriend?",
    "I hate his arrogant ass. He doesn't care about the poor. He tried to take away medicade. And he constantly writes executive orders to hurt the LGBT community especially the trans community. This President needs to go!",
    "The technology of the state department is not the issue here.  It is about Clinton's lack of integrity, ethics, transparency and willingness to cooperate with the internal review.  Rachel, no matter what, you cannot spin this issue and make light of Clinton's deficiency as a presidential candidate.",
    "Petition the White House to declare MS-13 Mara Salvatruch a terrorist organization at:    https://petitions.whitehouse.gov/petition/declare-ms-13-mara-salvatrucha-transnational-terrorist-organization",
    "What was that at the end some nazi shit? Or a gay pose?",
    "These comments are disgusting. If any trans-identifying individuals are reading this, I am so sorry you have to deal with people who are this ignorant and this afraid. Honestly any LGTBQ+ person is more than welcome in the ladies room in my eyes.",
    "Come on! All of a sudden they get so moralist... haha There are tons of videos about Hillary, about her gay lovers, even a  woman saying that she raped her, Yoko Ono said they had a \"fling\".  Hillary supports abortion, eww",
    "Really?! How about you save some of that talk on LGBT rights for Saudi Arabia? Go back in your rat hole! No one wants to see you or hear your bloody voice!",
    "Now let's here clooney explain how the money was transferred from the states to the Clinton funds........",
    "Janet could have corrected Piers and/or whomever tweeted that she was \"formerly a man\" in a much less abrasive way, especially when she knows that Piers is an unwavering supporter of transgender rights.",
    "Have you got that transcript from Clinton news Network or from Hillary herself ?",
    "Okay, I’m gay and even I side with the baker. Like really? He doesn’t owe y’all shit. He built that business. He has the right to serve whoever the hell he wants. Double standards. Double standards, everywhere!🙄Glad he won the case.",
    "But the prison inmates are gay because they have to be. I guarantee that you take someone in prison who displays homosexual behaviors in prison that was straight and put them in a room with ANY woman.\\xa0",
    "Imagine if everything they had say was wrong thanks to their translators...\\nThey should be the trolls of the century!!!",
    "He can't be a witch, witches are women. He is a gay warlock.",
    "I don't have a problem with regular gay people but I'm  sorry a can't stand transgender people",
    "Gay at 2? And dont call them woman clothes! Boys can wear dresses doesnt mean theyre gay! Girls can wear pants! Your clothes dont show what you personality is! If you think boys shouldnt wear dresses, STOP BEING SEXIST!",
    "Why people keep saying homophobic? I mean who afraid of gay people?",
    "Calling the gay jew that has been with more black guys than the Kardashians a fascist? lol",
    "When she agrees with your points but y'all still want to be POS transphobes hahaha.",
    "LeBron dribbles a round ball earning a pile of cash ... how does this translate into him knowing Jack about politics?  Perhaps he should run for office or learn to quiet down.",
    "the People of Alabama think that gays are bad but they fuck there sisters.... 🤔",
    "Mad how many transphobic comments there are. It's sad really these people inspiring af",
    "He has never said that he would over turn gay marriage. He has not targeted minority groups in any way. Fear mongering idiots. I think now that things are going well they don't get the attention anymore and they miss it.",
    "Who cares if he is gay! HE is gay stop giving him ALOT of attention let him go play football if you don't like him then I don't know I guess don't watch football then Let him be HIMSELF I See No Difference We Are all human beings here ",
    "We hat your big foot commit, we thought you left the gay agenda with red eye crap.",
    "I love Hillary. She'd be a thousand times better than any joke from the Republican\\xa0 Party. However, BERNIE could transform America.\\xa0 He far outweighs what Hillary Clinton could get done as she is trapped within the government machine.",
    "I laugh my ass off when people say Americas going to burn and go down hill after gay marriage has been legalized. Canada legalized it 10 years ago and there completely stable.",
    "I just came by to say.....\\n\\n\\n\\n\\n\\n€ en n   $ůc]{$     transfluid.",
    "But.... But.... We don't need a Gay Fish for President. we just don't.",
    "Ask the Translators if they were left alone to talk. Putin speaks English!",
    "What abt the business owners who  are gay, doctor can get turned away. Let's see that in the news",
    "transparency is the entitlement of the day!....maintaining dialog was paydirt!",
    "Now you know how gays, Mexicans, Arabs, and blacks feel under your administration. Sucks doesn’t it?",
    "#AndersonCooper is a fraud #transgender who lies to everyone . no way anyone should be taking him serious.",
    "At first I was thinking that they should have won, but after hearing they came from MA to CO for A CAKE makes me think otherwise...\\nI am in full support of lgbt 🏳️\\u200d🌈 but they honestly could have gone to another place.",
    "Is Kellyanne going to be translating for Trump for the next four years?",
    "Honestly the transgenders should be grateful.  When the next draft comes they're gonna be the only ones not dying.",
    "It's hard not to like trump I am all for transgender's not being in the army now let's stop them from having relationships with straight people and not telling i think they should be jailed for that",
    "These motherfuckers are weak. He can call black women broke and stand by it without apologizing. He also said he doesn't mind embarrassing black women but he will never do it to the LGBT. Weak.... Can only stand on making jokes about blacks but not the LGBT. That's his ass.",
    "We are independent woman ,if we dint raise an issue about gay rights,who are you to ?",
    "What's wrong with you people? Sixteen people died and you're talking about the anchor being gay!! Very sad!!",
    "Well said Dad. They must respect African values. We are not gays",
    "I can hardly watch this as it so biased. This deals with free speech the freedom of religion. ROT IN HELL, CNN and MSM! Your vilification of Christians and your bending over for the very powerful and corrupt gay lobby.",
    "CNN lying again. He didn't call Trump 'bright'. He called Trump 'colourful'. Яркий is the word he used, Яркий translated says bright, yes, but it means bright as in *light*, not intelligence. Colourful. Drawing brightful colours. Not ordinary. Attracting attention.",
    "Nilangaw na kasi Page ng Rappler kaya Ganyan nalang ang paingay nila wala ng naniniwala sa inyoww!",
    "Anderson why don't you move to IRAN,,,YOU'LL BE HANGED FOR BEING GAY,,YOU HATE OUR COUNTRY",
    "Fake and gay, they bought in an actor to sugarcoat the situation. Nothing new from the US tho",
    "Republicans applaud a bakery who refuses to serve someone gay but cry when they get denied service 🤔😂",
    "Laura Ingraham is a MTF illuminati New World Order transsexual.",
    "Bernie who was ripped off by Hillary and the DNC, then \"sold-out\" his loyal followers and then was paid-off nicely by the crooked DNC.....\\nWhy do liberals and the news media love this murdering-neanderthal religion that kills gays, oppresses women and condones child rape?",
    "tiny tom ivanaj:\\nno you smoke the pipe in gay book stores away from your city.",
    "Welp to all you lgbt people that voted for him....I must ask....how dumb do y’all feel now?? give me a rating from 1-10 1 being really dumb and 10 being really really reeeeeally dumb don’t be shy now 😂😂",
    "for all the fucktards in the comments saying \"fake\" and \"propaganda\",would you care to explain to me, why would a slaughter like this need a propaganda? And also that video, i suppose they transvered it to the phone...cus he obviously wasnt there.",
    "#FakeAndGay\\n\\nYou all be questioned and retribution foe your lies and deceptions will come!",
    "His dad killed him in a very gay way.  He has those fkd up genes. Watch that kid",
    "Wow what a speech \"West & US might have lost change to transformed Russia\". And you guys are crying about Russian meddling in US election. When you got your  own medicine then you start crying foule and unfair.",
    "When I first heard \"Blurred Lines,\" I knew right off the bat it was a sample from Marvin Gaye\\'s song.  I didn\\'t have to listen to the bass or the high hats.",
    "This Guy Harper is upset because they (Trump n Billy Bush) were not talking Gay stuff.",
    "How many suns we get until we have two different shadows. If hollywood can produce transformers that looks real, this video is just a piece of cake. Don't put your whole trust in this video,  you might want to think more than twice.",
    "Big deal he\\'s afraid of Vladimir who cares? It\\'s not like he gave him a suitcase of cash or whispers \"tell Vladimir I can do more for him after my election\" like our 1st mixed and gay president did.",
    "Staged and fake news ! No body cares about innocent lives there ! Syria is an important location to transport oil from Iran or Qatar to Western Europe and that is the price its innocent people are paying.",
    "Why did the translater dip right after my mans said he was going to cut his head off?😂😂😂",
    "Gay or not. Doesn't matter. I still love him. If he un-gay himself one day.....i will be one of the girls fighting to get him. I love him. Love his voice. Soothing.",
    "Trump isn’t worried about gay marriage right now there are seriously many other things to be worried and y’all not losing marriage. Also please don’t get another Democrat in office things seriously get fucked over slowly over time.",
    "as a gay man how dare you saying who cares about trans issues...",
    "I don't know who she is but she comes across as just another fat, bitter, old lesbian.",
    "Guys in life just be yourself don't be something your not. I can understand if your gay but transgender really? if your a guy your a guy that's all there is to it. If your gay at least u admit your a guy",
    "Hello is it Dominos,ok I want to order a pizza\\nYour address sir?\\n#23 4 the street Loanvirepoollguingillgogeruquerrd.....\\nSorry sir we don't have accessility to Mars we are cooperating with NASA we have transportation only on Earth",
    "Gaytanyahoo before you speak you should check what's happening between you and Arab states first.",
    "Stop pushing the western agenda on third world countries who don't have time for this bullshit. It took the US 200+ years to legalize gay marriage, and now you want to push this agenda on countries who's only focus is to develop. STOP PUSHING YOUR SHITTY IMPERIALISTIC AGENDA!",
    "I'm on disability due to the negligence of a surgeon during a kidney transplant. I just had to file for bankruptcy last week as my medical insurance doubled. We need to DUMP Obamacare people! It's killing the people that need coverage. We need to trash Obamacare and start over.",
    "There were a lot of shotted down airplanes for the last two months, but all of them were ukrainian planes, cargo transporters, reconnaissance aircrafts. Now the russians have made a horrible mistake.\\nMy condolences to those who lose their relatives.",
    "Trump would bring about much more peace than Hillary. Because he is transparent and Hillary is not, of course I think we can all agree that Sanders would be the best by a country mile, but that doesn't look likely anymore",
    "What a moron. He doesn\\'t know what it means but he\\'s all for it. I am homosexual and no way am I part of the \"LGBTQ Community\". I don\\'t join a group when I don\\'t know what its agenda is.",
    "It's great that this briefing is being covered, getting the info out there, but for those who are deaf, I'm sorry. Camera needs to pan out just a little bit to let the deaf see the translator on the left side...",
    "how ironic that the man who avoided being recruited because his feet hurt won’t let trans people serve",
    "transponders turned off, plane turned around, plane taken to 45,000 feet, everyone in cabin dies from hypoxia, plane continues to be flow by someone, to where , why, suicide, i dont think so, but they are the facts.",
    "character attacking instead of arguing a point, seeing the absolute worst in people, entitled and demeaning tones, hypocrisy, and some other stuff I'm probably forgetting. *sigh* .......any other guy here happy they're gay or bisexual? I am.",
    "Mr President its not an issue we need to remain straight no gay laws in Africa please we are not the west we walking with Jesus Christ out here thank you.",
    "Such bullshit. I can't believe she sold out like this. So white nationalists are just being political? That doesn't translate to racist? You can't use being Jewish as a shield. Pretending to be a victim with this guy??",
    "Mayor Nutter tells it like it is. The Times wouldn't even name the engineer because he was gay.",
    "Maybe Hillary should ask her old man about making things in China, he's the one that passed that WTO cluster-fuck. And Hillary was all in on that Trans-Pacific Partnership until confronted about it.",
    "aqui no Brasil os gays querem mandar no senado.. nesses países eles Andam pianinho...",
    "LOL as if Ksenia (or Alexey Navalny) is the very first \"pro-Western, pro-LGBT etc\" candidate allowed to run against Putin/United Russia. Yabloko has been around for a while (even having a few members elected to the Duma in the 90s & early 2000s).",
    "America is not like a state that’s doesn’t have drinking water? Unless you’re black and from Flint Michigan.\\nAmerica is not like a state that stones gays? Unless you’re at the pulse night club.",
    "Grassley is the worse chairman! Its unbelievable and disgusting. Complete negligence of fairness and undermines transparency! . This is a one sided hearing. Shamed on you for pushing this and hiding your real agenda. Just really gross!",
    "pasenxa ka trump hindi mo mauuto si duterte.. mayaman ang america pero makapangyarihan ngayon ang pilipinas..",
    "I'm not normally a Piers advocate, but as hard as I tried to look for flaws in his presentation of this sensitive issue, I could not find one. I'm in total agreement with the man. I don't know what this transgender woman was remotely upset about.",
    "That gay black guy looks like his brain exploded in his head.... 😂😂",
    "Yes, take my guns crying 16 year old Mexican lesbian.",
    "No one cares about this anti trump nonsense. Keep your gay propaganda to yourself.",
    "I kno snoop a lesbian and she looks like a guy to some ppl. But real shit when she got all dressed up like a girl she looked pretty damn fine to me",
    "As a trans boy with DDD breasts... I know exactly what this is like.",
    "Cnn is like buzzfeed fake and gay as a man fuckin another man in the ass",
    "Please Texas I'm a proud lesbian Texan we are in desperate need to make this state blue we have to show the rest of our nation we're not all Republicans we're not all idiots with no sense vote beto!",
    "gays and racists are doing anything in their power to stop Carson and its not working",
    "\"GAY serial killer\" Would you guys do the same if he was a heterosexual?\\nWould you put \"Heterosexual serial killer\" as title? Of course not!\\nCan\\'t you understand that this is why everyone thinks gay people are sick?\\nThis is not the example you should be giving, I\\'m truly offended and disgusted.",
    "If I could stop my son from becoming gay I would,,,,I don't see the wrong in that statement,,,",
    "Fuck you Reza,  get new translators or something...  You Fraud.",
    "SOS Trump, help us, are transforming our country into a Venezuela",
    "I translated that to\\n\"Bring me solo and the wookie\"\\nSo is that jabba the hut?",
    "Today's passenger ships charge $3,000+ to cross the Atlantic one way, because of all the luxurious food, gala floor shows, spas, etc.  These prices are outrageous.  I hope Titanic II will offer 3rd class passage like Titanic did.  Transportation rather than a super expensive luxury vacation.",
    "They are all so afraid of their own gayness .",
    "Idk that the name Cody could be transformed  into another race that's  awesome some people are creative and some are just ordinary nice way to transform a white name into a Hispanic-white name",
    "An Isis guy walks into a gay bar and says:\"Shots for everyone!\"",
    "Very fake and really gay news! Enjoy oblivion CNN you wont be missed!",
    "This is not the same as being a transgender. This to me is weird, we should all feel comfortable in our skin. Why can't see be a white woman that does what she does.",
    "Is that a gay coffee cup. Get that gay pride going.",
    "The tax cut sound bite is hilarious. You essentially have people applauding a wealth transfer to the most wealthy.",
    "Discrimination against gays?\\nLol come down ❄️ \\nI see more discrimination against hard working Americans and Conservatives",
    "This seems like damage control.. the Marxists, feminists and trans have fkd up the dems so they need level minded celebrities like Dave to bring back normalcy to this circus. but its too late that ship has sailed",
    "Poor taxi driver, but, who tf was he gonna transport in the middle of ISIS territory",
    "Joe Biden is guilty of sexually assaulting children like the pedophile he is.  There is plenty of video evidence for this right here on YouTube.  That\\'s why he supports the \"gay rights\" movement which in fact was founded by communist NAMBLA pedophiles. #FACT",
    "cubano anchor baby .. nothing like being busted in a gay porn drama to help out a politicians career.\\nmebbe' he & anderson cooper can smoke some sausage together .. eh  ??",
    "People who have no real facts, numbers, or evidence to support their claims always hate debating. Sometimes even going as far to say \"it\\'s been settled and is no longer up for debate\". Such transparent cowardice is disgusting.",
    "So is it about trans people or not about trans people?\\n\"This is not to be discriminatory against transgender people.\"\\nOR is it\\n\"We cannot let gender itentitied or boys go into the girls bathroom.\"\\n\\nI\\'m sorry I\\'m just confused.",
    "I feel bad, but did anyone else think the sign language translator was dancing for a split second?",
    "Well Bern, Trump is in fact supporting rebuilding of America's transportation infrastructure.",
    "Deflection.\\nIt\\'s a tried and true tactic-that usually works on those who tow the party line.\\nSame as Obozo, she\\'ll run on \"transparency\" as part of her platform, and dipshit Democrats will swallow it up. All the while never remembering her previous years in office.",
    "Gay black male..... Who do you think he's voting for?",
    "Please do not legalise  homosexuality or gay or lesbian rights,please",
    "Thank u my President for making it very clear to everyone. Gay rights is like an abomination to us Kenyans coz we hv more important things to discuss such as the big four agenda rather than stupid gaysm",
    "She isn't at all concerned about RACIAL DISCRIMINATION. Not one bit ! But she seems INCENSED over this one issue, gays rights ! They should ban her from NC ! She surely doesn't mind comparing the gay rights with Black rights. There is NO comparison !",
    "I am Trans. I life as a woman. I have Genderdisphoria. My gender is not Transgender !",
    "The guy wasnt a fucking idiot. Nor was he a stamped out product of society. So dont honor him like he was a dumbass with ur gay as music and stupid typical words. Fuck off cooper",
    "piece of lying shxx. get rid of this down-low gay political whore.",
    "We had a neighbor put up a Beto sign in their front yard in SETX.  The neighborhood responded by over 50 people putting up Cruz signs.  The Beto sign holder?  Transplants from Chicago.",
    "More like mental issues masquerading as \"transracial\". What a joke 😂",
    "Male female straight gay lesbian that's all there is not all that other shit",
    "So, I saw literally none positive comments, and I’m so sad. This lady, Zoey, goes on TV and talks about being transgender. Imagine how good a closeted trans kid seeing this and being really happy. Like wtf can’t you just let trans people live their lives?",
    "For people who are so anti gay, these right wingers love to use the phrase \"ram down our throats\".",
    "To my fellow LGBT folks, Honduras is one of the most anti-gay peoples in this hemisphere.  To advocate letting these people in, is letting more and more people in that hate you and will vote against you!  Wake Up!!!!",
    "Is that my lesbian softball coach on FOX NEWS?! WE’VE COME SO FAR 😢",
    "The president of Kenya Said \"LGBT story is a none issue in Kenya\" Infront of the then President Of United States of America Barrack Obama, so who is Christina?  She is forcing it because of the Cameras trying make The President look bad haha,Uhuru Kenyatta You are the Man",
    "This N.C. law is not anti-gay or transgender, it's anti-perv.",
    "the only good thing about Islam is it is against Gays !!  God is also!!",
    "Napolitano is wrong.\\nHE puts politics ABOVE his \"faith\" (i.e. he supports gay marriage\\nbut claims to be a staunch Catholic Christian -- total contradiction).\\nThe Pope NEVER MENTIONED TRUMP btw\\n(and even if he did -- why wouldn\\'t he be entitled to\\nan opinion -- just like everybody else in the world????)",
    "serious?everybody loves you??i am not gay,i won't love you. i am just a chinese who is practicing english here",
    "if i wod be gay u wod be my dream",
    "Speaking of gay, those two men at the end arm just beaming at each other in affection.",
    "Technically, being gay doesn’t take just anyone. Scientists have a theory that gay people inherit their sexuality from their parent of the opposite sex. Kinda like a mutation that is neither good or bad.",
    "Somebody state what about his analysis was incorrect: A lot of men that are straight and go to prison, come out gay.\\xa0 Unless you're stating that this is incorrect, you're just emotionally rejecting the fact.",
    "I searched T Gay and i found this at the top search",
    "Lmao! Yeah why not make it the douche pope’s prayer huh? Bad translation my ass!",
    "I didn't know there were any pole dancing positions open at the gay strip club.",
    "press 8 every half second on your keyboard to hear bandaid face to say \"in gay\"",
    "I am pro LGBT, but I’m quite sure businesses have the right to deny service. Besides, why’d you want a cake from someone who you have to FORCE to make it? That doesn’t sound smart.",
    "Seems as though he\\'s making a \"nature vs. nurture\" argument whereby one\\'s environment plays a critical role in their choice in engaging in homosexual activity. Presumably, said prisoners weren\\'t \"born this way\" as so many gay advocates declare.",
    "I'm fine with same sex marriage, do what you want. But being gay IS a choice. You are not forced to be gay. Just like I am not forced to be overweight, but I am. His prison analogy is spot on.",
    "Fox News are a bunch of biased little shits. Should be taken off the air. This is not news, this is religious propaganda.\\n\"Do I hate gay couples, no, but they\\'re going to hell\"\\nGimme a break",
    "Will Sharpton  refuse blood transfusion when he needs it? Or, he prefer to die waiting for blood from a back skin humanity. Will someone confront him and ask him what colors are his blood and fresh? Why people wear black to attend funeral??",
    "I send emojis just to transfer a emotion with a text. Because with texting sometimes you lose the emotion you give with your tone of voice and face. So adding a face with a text sends a lot of information",
    "The gay, Muslim, coke-addict, war criminal occupant of the Oval Office should go to his Dubai mansion ASAP and see how long the authorities are going to put up with his moral depravity",
    "Ahh Brazil HIV capital of the world as well as transvestites. \\xa0Stepped in poverty and crime they cheat at soccer and still get their asses kicked. Time for a churrascaria I suppose.",
    "What a fucking gay law tho 😂😂 you can't block a car from the front 😂😂",
    "petition to just ban piers morgan from ever rearing his repulsive transphobic head on television ever again",
    "I'm really happy with Trumps decision. HavingTransgenders in the military would cost a lot which is a big waste of time when you're main purpose is to serve that money should go to more important supplies.",
    "Good on this man! I'm disgusted in this whole thing. Screw this gay marriage crap.",
    "What did pres know ?? You was gay ..  when immediately",
    "I'm opening a restaurant there for all gays and not for religious people of Indiana",
    "najib is not answering the question of 'not revealing the interim report'. najib merely states about 'being transparent...\\n\\nanother thing, he mentioned 'advanced country' instead of 'developed country' (negara maju)... what an idiot PM we got here!!!!!!!!!!",
    "you do not need to know what both parties said to know that the conversation was about sanctions. for example, if you only saw the transcripts of one party...the russian official...and he was talking about sanctions...without general Flynns comments transcribed....you would still know that the discussion was about sanctions",
    "Go Africa no gays . sin sin sin in \\nGods eye",
    "ABC can do what they want to! This has nothing to do with what OTHERS think! That’s not the issue here.  And these women forget that Trump called out a sitting president on his citizenship.., and his college transcripts when they talk about dissing a sitting president!! REALLY??",
    "Empire Fox Network/News Propaganda  Gay Agenda Targeting the American American Community. ..Fox Fox ",
    "Im surprised Gay Boy isn't blaming the Hurricane on Trump! What a loser he is and Cnn has become!\\nHe knows the difference between kneeling down and bending over, he just doesn't care !",
    "gay right and transgenderism is the same....cock in arse.....arse on cock both ways",
    "You should’ve of done it by week but still the transformation was amazing and the video was still good",
    "This is a MAN!!! not a woman. \\nWake up people!!\\nTransgender in your face",
    "half are gay the other half are  lesbiance must be George Sorros people.",
    "\"I\\'ve been as transparent as *I know how to be*\"\\n\\nExplains it all....",
    "\"Drain the swamp\"....hahaha, and then \"special interest and transparency\"...bahaha. Flip the coin Nancy, Two face would be proud. Hilarious",
    "If your son or daughter wants to be gay or bi or whatever you can't control that or there/anybody emotions and you get mad at it then they might want to do it more",
    "Nona Gaye is never mentioned he was with her for 3 years pre mayte and during mayte as well",
    "Lesbian, Gay, Genderqueer, Bisexual, Demisexual, Transgender, Transsexual, Twospirit, Intersex, Queer, Questioning, Asexual, Allies, Pansexual, and Polyamorous.",
    "MSNBC I don't see the transcript for this in ALL IN. Can that be made available?",
    "How could all these people associated with Trump forget being in a meeting with someone that has a Russian accent or a meeting that required a Russian translator? \\xa0I need someone to explain that to me.",
    "Just here to say anthropogenic climate change is happening, evolution is a fact, free healthcare is a human right, abortion and gay marriage should be legal, the republican candidates are insane and Israel needs to GTFO of Palestine. Come at me!",
    "How about let's create new Law called Rica act? \\nThis is for the women who like to break the law of transportation to and from other countries smuggling (human trafficking) ect. To inact add insurance fraud.",
    "Donald Trump, Jr. needs to run for Senator of NY. Oust Chucky Schumer, end his reign. This country needs a fundamental transformation back to the principles of freedom- for all American citizens.",
    "Dear Americans! I really suprised that this time your media show full version of Putin interview without cuts and censorship. Even translation was fair enough. Why have the Western media ignored this style of reporting many times in the past?\\nP.S. Your reporter - rude man.",
    "Crosby is a dick and I hear more ted Nugent music than I ever hear Crosby music on the radio if ever only nice thing Crosby did was donate sperm to a lesbian MELISSA ETHERIDGE so she could have a kid",
    "So my dad said Obama didn't do much or anything good. Ok so you think legalizing gay marriage and helping the LGBTQIA isn't good? Obama restored peace with Cuba after years of banned trade is a step backward? You think making Heathcare easier for everyone isn't good? Yeah explain that",
    "He's gay? Didn't know... Rip to your sis tho bro",
    "can't believe newsroom who interview a president employ this shitty kind of translator..\\nstuttering, even including wrong translate!!",
    "These parents are terrible and I still haven’t told my parents I’m gay and I’m scared but I think it be okay because there very nice and my real mom is gay",
    "They are still looking for the perfect black, lesbian, disabled, transgendered, Islamic candidate for 2020.",
    "To everyone making a Pokemon go joke, ur mom gay.",
    "WOW, this guy is Trump\\'s \"anger translater\" like Obama\\'s Key and Peele.",
    "We need to bad automatic transmissions. Everyone must drive stick shifts.",
    "I am so confused so saying I understanding your struggle is wrong. And who the fuck is assigning this gender?!! Listen not every trans has the same way of looking at things.",
    "Did u know that one cares that ur gay or trans or whatever everyone’s trippin that they get a whole month to them selves when we should focus on world hunger or some shit but other than that shit cause some attention seekin",
    "What the hell has this world come to,first gay pride now this 😩",
    "all jealous straight people are commenting bad about gay.\\nwe are gay , we are happy 😊😊😊",
    "I feel that because he's the one deciding what she should find offensive and what he finds right/wrong is exactly what he's doing wrong. Janet Mock is the transgender woman, he is not. She decides what offends her, not Piers Morgan.",
    "Boom Booom gays ,btw why you guys care much isn't the world better without them come on !!",
    "What does he think gay people/supporters are? People that want to see every religious person dead? We're not hitler.",
    "Mexico will end up paying for the wall, Through tariffs and money transfers.",
    "I hope you are wrong about \"most Americans not being interested\"  in the fate of our government and democracy and our rights and freedoms! I worry night and day about the potential fate of our country to transform into an autocratic state such as what occurred in Turkey....",
    "dont be gay... and you will not be persecuted... very easy...",
    "Femenazi lesbians trying to oppress women and men alike. This reporter is also a twat.",
    "I have a question a male is gay and like girls does that make him gay or straight?",
    "Hugging and Shaking Hands is Not Considered as Gay in India. It's Normal we receive our guests that way.",
    "Dems full of it, women, illegals, gays, feminists., its obvious , the agenda that is..",
    "IF YOUR NOT GAY WELL YOUR A LUCKY MAN YOU WONT BE THROWN OF A BUILDING AND NOW YOU BEING SHOT TO THE HEAD GOOD WAY TO DIE MY FRIENDS *ISIS IS HELPING JESUS FOR SOME REASON*",
    "Well this is fox news so I'm just going to assume they twisted the story around and this kid said something transphobic! And I love how they keep saying the teachers full legal name knowing damb well she will be attacked by narrow minded idiots.",
    "Actually, people in these videos - pedophiles who offer children meet to have sex. why not a single word about it? or may be a CNN support pedophiles?\\n\\n1:33 This man was seized because of personal animosity. he did not apply to gays.\\xa0 but CNN somehow continues to lie.",
    "\"A father marry a daughter or two men marry one women.\" Real from make gay marriage legal. Okay dude whatever. If your God punish a person for love an other person how is the same sex that fine but that is not my god.",
    "sorry but i just have to say...this is getting old. shes gay, who cares. why is this news.",
    "2saal guzar Gay magar shaheedo ko koi bhula na paya",
    "Proud on the plume of Nagasaki - hm - if I as a german would be proud on the plume which rose from Auschwitz, would it be pc? - What the hack, lets make america great again and keep Enola proud and gay,!",
    "This from a person who secretly recorded Gay Meetings at Dartmouth and outed people without their consent ...",
    "CNN and all you idiots got played big time!  Use Google translate and put in Cov fe'fe as an Arabic word.  Gee Didn't Trump just come back from Saudi Arabia just before that tweet. CNN...  Maybe do some research before you make idiots of yourself!",
    "That's not the point!  Taxpayers should not PAY for a Transgender operation.  That should be the individual's responsibility.",
    "They also dropped from both the transcript and the video, the most telling half of the question from the reporter to Putin. Russia dropped the entire question from the video. Criminal changing of the WH historical documenting. Who will remember? How long will we remember?",
    "No liver transplants for ghandi... they all belong to trump.",
    "The democrats haven't transformed they've just showed their true colors",
    "this is the absolute WORST translation I have EVER heard in my entire life. Just saying...",
    "So maltreating gay people and women is okay because it's their culture? I've heard this excuse a lot from African leaders when it comes to LGBT+ and women, and it's sad.",
    "Saying planes were first developed for transport and later for war is a bit misleading, substantial progress in aviation was made prior and during the two world wars.. before that, transporting by plane was definitely not what it is today..",
    "This is why I always always avoid transit via the US or ever purchase US airlines tickets. Your country is pathetic, racist, overtly afraid of anybody not white and consciously prejudiced to other beliefs/thoughts of people not reflecting your views. Have fun with Donald Trump, you deserve him!",
    "that hand shake is weird enough but what make it even worse was when the japanese leader tried translating what the photographers said. Trump misinterpret that and started staring at the Japanese PM. Lol.",
    "If anybody has a translation as to what Dennis just said please let me know.",
    "Thei know, you can not be gay in Iran, so... what you expect?",
    "Mr. president what do you have to hide having such  unusual lack of transparency at the G20 meeting",
    "but your the president and house and Senate are Republican gay bathhouses",
    "transition means NO health coverage! wake up, the conservatives just want to do away with ANY health care",
    "So what, Piers is being bullied. Trans people are being killed all over the world. Get over yourself",
    "\"Look at these guys....look at these guys....\" LOL.....I\\'m looking at those guys and I\\'m not impressed!!!!! And by the way, can anybody translate Rodman\\'s \"ghetto speak\" for me??? Also, his voice sounds like he gargled with razor blades before his interview....Dennis Rodman,\\xa0what an articulate speaker and ambassador for USA.....NOT!!!!!!!!!!!",
    "My friend is a transgender man. He was born female. He’s 6’1, over 200 pounds, and is absolutely huge. He’s jacked. He’s also heterosexual. \\nDo these wackos really want him in the female washroom?!",
    "why you under go sex change operation. cont you live as you are without knowing transgender.",
    "I would support Neymar even if he was playing for the devil's team,Neymar's transfer new proved that he is the best player and is loved by millions.who cares about Barcelona fans.tired of a league between two teams Barcelona and real Madrid",
    "What is amazing is how they have footage inside the airport but not of the Orlando attack on Gays.",
    "SE Cupp is in favor of gay rights? I thought she was a right-wing nut.",
    "Damn between this and that gay marriage video, I freaking love this dude.",
    "In 1992 I was working as  Road Supervisor for the largest ground transportation company in Southern California when a MS13\\nGang prospect shot and killed one of our drivers during evening rush hour. It was still daylight. Made no\\ndifference to the shooter. Sad.",
    "It's official now people! Gay people rules the world now!",
    "Here's a novel idea: the line is legal consent between human adults.\\n\\nWhat the hell is wrong with group marriage? Or incestuous marriage between consenting adults? The problems with incestuous offspring is a different issue, and a non-issue for gay-incestuous consenting adults.",
    "The boys at this school must be gay if they don't listen to her fine ass 🤤😍",
    "They may be all trans already as a way to condition the public into accepting this.",
    "Do you not believe that the fact that McConnell\"s wife, Elaine Chao, was chosen by Trump to be his Secretary Transportation has anything to do with ole Mitch protecting Trump ?? \\nDraining the Swamp ... lol",
    "Only aliens can be transgender this young. These parents are failing big time. I'm starting my own club, GUN MAN scouts. Men only, and no turd liberals raising their boys to be little girls.",
    "this is exactly why your not gonna catch my ass on a train, rollercoaster, or any other railed transport.",
    "Is heard this obama president is gay, is that true?",
    "How to stop Mueller from expanding the Trump-Russia investigation - become transparent with all the finances and meetings...give Mueller nowhere to go....of course, if all is not above board then there is danger in this...",
    "Donal trump is making the country racist  again he is starting with mexicans then maybe gay community... because he doesn't like gay people and then what's next.. will se if he becomes president ",
    "Why should I care what he said? I'm a gay woman and I still make these remarks and jokes. Id rather have Trump than a woman who, in fact, let a rapist fled free knowing he was guilty. Good thing we are getting Trump.",
    "yeh nah. the letter salad pisses me off as a gay guy as well. I prefer to use queer instead of the lgbti blah blah list. \\nBasically the !(cis ^ straight)",
    "How the fuck do these men get caught for being gay?",
    "Is that Kimberly a transgender......? she looks like a man and that one asshole is gay and I would smack the shit out of his frutty ass if I ever catch his punk ass on the street. Fake ass news......!",
    "As long as Democunts keep giving leadership positions to clueless, corrupt, sexist bitches like Pelosi, Weinstein, Schultz (Debbie), and the rest of the twatty political cult of misandry, they can forget EVER regaining this gay man's vote.",
    "WTF trump. What did trans do to you. If they wanna help the country they can. This is what's wrong with the world today. I understand the military is not a social experiment but neither is somebody's life. They can be who they wanna be. JESUS CHRIST.",
    "could I put the Chinese translation on it and upload to youtube?",
    "CNN is fool of gay and lesbian  amanpoor we need technology not sexual orientation.",
    "Maddow is a transgender. Are you kidding me or what?",
    "yeah. To kill an unarmed taxi driver, loses all transport, to kill another unarmed man on a motorcycle, give isis a weapon and transport. Reporter it is very worry about your self ass - we see the whole fucking America in one clip.",
    "Did someone say \"oh shit\" when it transitioned to the interview? Listen carefully",
    "She's full of hatred , that\\xa0\\xa0 lesbian bitch Maddow !!",
    "Islam is not a religion. It is an evil, fascist political system. It \\ndivides the world into believers and non-believers and legitimizes \\ndeadly violence against gays, Jews and all non-muslims. People who \\ndefend islam and call themselfes liberal are INSANE.",
    "How delusional. Asking for acceptance from something (God) that doesnt exist from a person who shouldnt be in his power (Pope). Gay people are better off without God. End of story.",
    "If he need translater then what tha he'll he (trump)was saying while shaking hand😂😂😂🤔🤔",
    "I am sick of seeing this bald lesbian and the bullshit propaganda that comes out of thease narrow minded scripted kids guns don't kill people people kill people arm teachers more counseling for troubled individuals in schools",
    "Piers doesn't give a fuck about trans issues, he just wants to clean his name",
    "To understand why Rachel is not worth listening to:\\nhttps://theintercept.com/2017/07/12/intercepted-podcast-dumb-dumber-and-don-jr/\\nYou may need to skip ahead to hear Rachel eviscerated by The Intercept for tactics frankly just like FOX news often employs, in her touting of a \"big leak to us\" which she transformed into \"Fake NSA docs, a plot?\"\\nhttps://theintercept.com/2017/07/07/rachel-maddows-exclusive-scoop-about-a-fake-nsa-document-raises-several-key-questions/",
    "Rachel mandow seems to be an angry lesbian.....or is she married to a man?  I know she likes kool-aid",
    "To my fellow LGBT folks, Honduras is one of the most anti-gay peoples in this hemisphere.  To advocate letting these people in, is letting more and more people in that hate you and will vote against you!  Wake Up!!!!",
    "This man is so stupid if he Doesn’t understand that some people are just born gay.",
    "dammit joe donald isnt gay we all know what you ment by take him behind the gym you idiot",
    "All the gays muslims nee be change their religion like me, before i am muslim now i am christian",
    "if that's your reason for changing the Lord's prayer...then through the whole book away in your eyes because many can look at so much in there and say it's terrible translation ..change this change that 🤔",
    "its propaganda bullshit. CNN all time lies.\\non 1:24 guy named Maxim Martsinkevich (also called Tesak) beat rusophobe Eduard Bagirov. Bagirov is not gay, he is a Muslim Azerbaijanis, who live in Russia and offended Russian people on  television and in his books.",
    "Why is that white lady in another country trying to force the gay agenda upon them?",
    "could a translation of \"immersed in religion\" be immersed in delusion?",
    "Wonder if Travolta is still getting those gay massages. (Not that there's anything wrong with that!!)😄",
    "gay porn site owner = murder . Thank you CNN.",
    "What surprises me always is that gay actors never get asked how they managed to play straight guys.",
    "Poor little illegal lesbian,while your at it ICE ,take Shep with ya.....",
    "Haha another shawshank redemption setup. I wonder how much it cost him for the \"transfer\"",
    "IMO, It could only have been the pilot (captain) who made the controlled turns, switched off ACARS and transponder! I don't think it was some terrorist, only the pilot would know how!",
    "i get very annoyed people conpartmentalising him down to just been gay and totally dismissing his amazing talent. (i think his one of the most vocally gifted singers ever) & his huge kindness giving millions to charity and good causes thought out his life.",
    "That’s cool that your gay and all but let us fix our own computers. Lol",
    "Hmm i am russian and lesbian, i have kissed girlfrend in public recently there was no hate for us. I love russia but fuck these homophobes yes? Russia does not need them",
    "Hart got what he deserved for being a leftist puppet. On another note, Why are we playing by the rules of the minority (gays)? We, the majority, need to get rid of them because we have had it with their PC lifestyle. They need to be snuffed out!",
    "he is gay as per latest report \\nislam has nothing to do with his crime",
    "Pueblos sin fronteras translates to people without borders?\\n\\nI thought it means “HOMES” without borders!!!  THIS IS NOT GOOD",
    "Every trans am on the road lost a few horsepower yesterday",
    "I don't have a problem with regular gay people but I'm  sorry a can't stand transgender people",
    "this is the way of CNN to say that Joan Rivers was a trans, lol,,,,,a boarding pass with the wring name, means, JOAN RIVERS does not match her passport, dudh, people ar dumb, and yes, mike is mike",
    "What? I thought flying was the safest form of transport!!",
    "I can say that, CNN fell victim, who leaked the news to the channel and facilitated their entry and transfer, is the one who sold them the story, and fabricated it for money, the other Africans in the camp they ready to say anything to go to Europe.",
    "If he stops money transfer to Mexico they will have to pay for the wall or risk losing 10's of billions of dollars. The things he are preposing  are very do-able. Next POTUS Donald J. Trump!",
    "to everyone gay bashing in the name of god and jesus this and jesus that and aids this and aids that and punishment. here is a news flash- god doesnt exsist. and to the hateful, Id rather live with a thhousand george michaels than one of you.",
    "Gays hate Trans people so the right and them should get along just fine. Which strikes me very odd that a gay man would want to side with the people who don’t agree with him marrying another man.",
    "creepy porn lawyer actually tried setting Tucker up by paying a gay immigrant along with a team of 3 including 2 foreign leftists by cornering and insulting his daughter. he knew the reaction wasn't enough to release pre election now hes desperate and released it anyway. what a nutcase.",
    "STFU.  nobody cares what you think beouncy and gay z.",
    "Rip anthony! Tôi đã xem nhiều video của ông về ẩm thực và con người ông gần gũi ngay cả khi đến Việt nam chúng tôi.ông là một người tôi rất ngưỡng mộ!",
    "America is CURSED for sure....people are starving   and u r not helping then u crack heads use all the resources to support gays ... really?!\\nU don treat nice black people in ya country and still talk about rights in our continent...f*ck you imbeciles",
    "The fact that you dont HAVE to be gay means its a choice",
    "Hmm, designed to be non-lethal, though sometimes are, inconvenient and probably won't see much use because of the transition time... Call me crazy but I think we already have something that does a better job of being a shitty projectile, rubber bullets anybody?",
    "So they're ganging up on the gay guy. Who are the real Nazis?",
    "I thought he said he wasn't going to discriminate against transgenders? ( Hypocritical Swine!!!!!!!!!)",
    "Cummings: release the transcript\\n\\nGowdy: Why just that one of 50+?\\n\\nCummings: Release them all!\\n\\nGowdy: Even the ones with survivors names? \\n\\nMe: Didn\\'t he just say ALL???????\\n\\n.... if you don\\'t get the art of \"deflection\" in a debate then go lick a lollipop 🍭",
    "he looks kinda gay as well. Probably he played homosexual card as well",
    "di uubra ang people power dito di gaya nun sa edsa.. wala si Mama Mary dito..",
    "Shep's gay.  I don't want to hear how he wants his 'cone of uncertainty.'",
    "its sad that so much shame was attached to his identifying as a gay man,,, i think people would love him either way,, it must have been from growing up with a father who wouldnt have approved,, rest in peace sweet george",
    "How is this guy allowed to speak on tv...oh that's  right... This is the Faux news, I mean fox news network.  To deny climate change is like denying that cigs cause cancer or you std's are transmitted thru sex. This reporter is an idiot. Please stop",
    "So CNN just postulate that pedophils are the same as gay ppl? You guys are just bunch of homofobes!",
    "Because naturally in 2017 people leave keys in the truck, and as lady luck has it, 1st truck u saw had what you were looking for, & OFF TO TRANSPORT 30 VICTIMS HAHA BULLLSHIIIIITTTTT LIIEES💩💩💩💩💩💩💩💩",
    "Such a hypocrite. Obama was more opposed to gay marriage at the beginning of his presidency than Trump is you colossal fucking idiot. He's against ILLEGAL immigration so he's racist? I can't take the stupidity.",
    "Left or right are full of crap and look after their own interest. But I vote republican the fact that they are anti Gays. I didn't find a one good reason to vote democrat. Will edit this comment when I find it.",
    "Deaths of Americans would be dramatically reduced if the CDC were eliminated. The CDC is an enforcement arm of the pharmaceutical industry and both are run by globalist, depopulationist, transhumanist elites.",
    "Sorry to hear about Sarah....(NOT)!!!!! Just like the gay couple  who went to a baker to do their wedding cake and the owner refused. Baker ended up winning.  IDK..guess the couple should just boycott the baker and move on.",
    "This wrong translation this video is wrong I speak Arabic interview fake 😠",
    "wtf didnt mccain bash obama for including transgenders in the military",
    "What exactly are those \"western values\"? Are they Christian zealousness, racism, sexism, conservatism, tax breaks for the top 1%, power to those with wealth, removal of lgbt rights, ect. Right now thats what it seems. Oh well... \\nConservative Republican Straight White American Christian Male master race!",
    "Confirmed the boys became transgender to use the girls bathroom",
    "Look at Liberals  eyes when they argue. They all have this weird gay thing going.",
    "That football player is clearly gay tho................ Am I the only one who sees it?",
    "yeh nah. the letter salad pisses me off as a gay guy as well. I prefer to use queer instead of the lgbti blah blah list. \\nBasically the !(cis ^ straight)",
    "Thumbs up if you were baffled at the gay dude cheering for Putin @ 0:41",
    "I think anyone can join the army. Because they are willing to die for our country. Trump is just stupid. If   transgenders want to protect this country they can if he bans them it just means a smaller military. God bless America 🇺🇸",
    "Let's give kim jong un a new name. I got one Kimmy the Gay Fatass Un",
    "why does putins translator just sound like himself speaking in english...i mean we know he speaks english",
    "So it's not ok for transgender people to be in the military but it is ok to let a cop who has a past record of shooting innocent people stay on active duty?",
    "Amazing that a teen Lesbian would wear a Cuban flag on her jacket. Not only is she a Communist anti American but she would not be excepted in Cuba. Were gays were imprisoned or murdered. This girl is a Propaganda tool and Nothing more. So sad",
    "IF BAKERS DON'T HAVE TO COOK FOR GAY PEOPLE, THESE PEOPLE DON'T HAVE TO COOK FOR BIGOTS.",
    "The transgenders are not losing any rights by this. Period.",
    "i hope people know there is not women s rights,black rights, gay rights, and all these rights.\\nthere are only the rights that the constitution state saying all men are created equal  and so all groups of people are to be treated the same way",
    "So is CNN going to post the videos of Killary in the past saying she doesn't believe in gay marriage? Give me a fucking break. All CNN is now is Anti-trump propaganda. If it doesn't fit their liberal agenda, they don't report about it.",
    "I missed this guy(The Mooch!) . He's soo transparently full of shit it's funny.",
    "This guy is an idiot. He doesn't even know what being gay is.\\xa0",
    "damn thats one transgender u don't wanna talk shit to.",
    "why is this shocking. I'm sure no people or weapons were transported through there.",
    "Bunch of Idiots, gay wads & flouridated dumb shits. Thank heaven I bailed Cali & moved to Europe, but we have all the so called \"refugee\\'s \" here. Like a bazaar now! 😦",
    "It would have been nice if this news channel MSNBC translated both recordings. Kelly's conversation was much longer.",
    "I find it difficult to listen to Mr Trump, however when you read the transcript he sounds like a uneducated teenager it’s horrifying and embarrassing and the same time. Please vote.",
    "This is just heartbreaking!!! I pray Corey didn't die in vain and justice and transparency will be revealed!!!!",
    "Fats are good for you. Dont go fat free food. obviously avoid trans fat. but saturated is fine. youre just trading fats which the body needs to make hormones and low insulin response, for sugar.",
    "Great news, now that he's out they get a bisexual governor what a weird fucking state Oregon is.",
    "I'm bisexual, I'm not part of that community.  Whatever the hell that is.",
    "How can anyone take this loud-mouth and his trump derangement sydrome seriously wearing that gay ass tie?",
    "He just banned trans people in the military.......that man is pure evil.....",
    "He didn't say he grabs girls against their will. He just implied they spread like butter for awesome dudes like him. Sorry bitch ass america girls like strong men not bisexual androgynous progressives.",
    "This British American can't mind her business gayness practice is not allowed in Kenya and thats the law.",
    "This case should be pursued to a higher court. The judge in this case made a wrong decision and I believe that if this was taken higher up the ladder, they would win their case against the lesbian plaintiffs.",
    "Gay people have a right not to be discriminated against\\n\\nReligious people have the right to uphold their beliefs\\n\\nThe supreme court's ruling had to be a neutral one. \\n\\nThis ruling actually makes me proud of our judicial system. It protected religious freedom without setting a legal precedent for discrimination.",
    "I'm gay and I lol to colbert. the real homophobes are most people on Fox news",
    "WTF.... So transgender, then it's witch, not warlock, or wizard...I'm confused.. Don't we have better battles",
    "You fucking fools, I have transcended mankind now, I am now a wizard and no longer have human desires.\\nIt's too late to stop me, why didn't you stop me?\\nYou will never discover that I am 4chan.",
    "Obama/Soetoro is gay so the story can only be about somebody that didn't know. His wife Michael is male.",
    "Tbh biologically speaking there is only 2 genders male or female then theres the in between that are medically written as a problem disorder or function. This is just biologically speaking but i support the LGBT community for using their voice",
    "Christians can never admit that you are born gay, no matter how convincing nor voluminous the evidence. They know that if they should ever come to acknowledge that the scientific evidence is valid, now they have a much bigger problem.\\xa0 If god condemns homosexuality, why then create someone that way?",
    "Wow did not expect that from Rachel Maddow, does she not see what has transpired in this democratic primary? This is why I watch TYT, this is corporate journalism if I have ever seen it at it's best!",
    "YEAAA GAY PEOPLE AND BLACK PEOPLE ARE AWESOME HAHA FUCK YOU BILL",
    "trump is gay😂😂 he's just gonna die from assasination. lol😛\\nHaters come comment",
    "israel is like an incompatible organ transplantation ,the body(the middle east) will reject it.",
    "Gays/trans just butthurt because deep down they know they’ll never be normal. Enjoy your twisted existence you weirdos",
    "I am a gay lesbian transgender robot and I'm a offended",
    "Ana is a pig with a filthy mouth she says its an American right to refuse to take a picture with Paul Ryan so it's a bakers right not to bake a cake for gays....CNN SUCKS!!!",
    "I'm Transspecies. I'm a Porcupine. If you look at my hair, you can't deny I'm a Porcupine.",
    "What about sedatives, oxygen supply/masks for the kids? Then divers could transfer them swimming!",
    "If they are against all of this. They should not be a gay couple.Or is it convenient?",
    "He doesn't know what he's saying. Other people don't understand your situation being gay if other people themselves become also gays. You don't choose to be gay. It is something that you feel about yourself.",
    "praise the Lord😘 chief  police using common sense   without any discretion conscious compassion and nurturing to make our society better all across United States🤔 showed a lot of transparency through his eyes 😱 there is a problem with \\n😁corruption",
    "lol at all the bros saying \"it\\'s a compliment just accept it!\" shut your bitchass up we aaaaaaaaaaaaaaaaaaaaaaaaaaallllll know the second you get hit on by a gay man you\\'re crying and shitting yourselves and claiming assault lololol sit down.\\xa0",
    "this is not about culture, gay people in kenya deserves to be live and not killed. this is why kenya one of the worst countries of the world. east and africa are suck about human rights.",
    "Incredible! I've somehow transcended into a parallel universe where an honest and unbiased conversation can take place on CNN!",
    "he don't love gay saying he love gay that just dumb don't bs yourself frankin graham",
    "Because they all have been in collusion for decades , thank God they are opening it all up for transparency , then the people can decide who what and when with real documented information , but I think the facts went to the bleach-bit party unfortunately",
    "I thinks she has been murdered! do you think?!\\nshe called Michelle Obama a transsexual man! Hmm the policy is dirty!\\nFinally, she took the same drug that caused death for Michael Jackson!\\nIs there any related links?!",
    "Christ almighty! These comments! It doesn't matter if you're trans, you can use the male or female bathroom. I support you know matter what, just remember that you have a least one person who cares about you!",
    "Literally every mainstream news agency is a piece of trash one way or the other. Let’s all just start our own news agency that just states facts and the whole transcript of what Ye said.",
    "Petula Dvorak\\'s satirical op-ed in the Washington Post today (7 Nov.) concerning this guy\\'s 7-hour testimony before the House Intel Ctte. is HILARIOUS. What\\'s scary is that, for all its Dave Barry-like craziness,\\xa0her fake \"condensed transcript\" of Page\\'s presentation makes use of\\xa0big sections of Page\\'s own, quoted\\xa0testimony for comedic effect.",
    "How is it offensive if he says  if he can stop his son from being gay he will? Hmmmn straight people have a choice to grow their kids straight what the hell",
    "RIP Reynolds, you'll be missed.  May you drive your Trans Am straight to Heaven.",
    "It's about time that we elect a gay president.  Sanders 2016!",
    "They forgot to add Appolonia , Nona Gaye, & Sheena Easton",
    "Total hit piece by CNN. Bondi should have known it was coming. If Anderson has some much gay pride, why did he spend a majority of his time in the closet? I'm not sure why Cooper is trying to turn this into a fight for gay rights.",
    "What is gonna stop them from burning those transcripts\\xa0a la Russian Embassy?",
    "WARNING.  THE JEHOVAH'S WITNESSES ORGANIZATION IS A HOMOSEXUAL TURN AROUND ALL THE WAY GAY. LBGT",
    "So says the biggest gay crybaby of them all. Except for maybe Jimmy Kimmel.",
    "I identify as a wolf and polar bear please respect the transWOLF/POLAR BEAR community.",
    "why can't we just be lgbt+???\\nI'm trans and pan but I'm still confused??",
    "😂Being gay may not be a choice. Acting on ur feelings is. I'm a married man and I don't have a choice about wanting to have sex with many women. I don't do it because it's WRONG. Got it!?",
    "Hilarious reading people comment here on how Megyn Kelly is a \"bitch\" because she rightly challenged Cruz on his hypocrisy. \\nTranslation: \"I don\\'t have an argument against what she said but it makes me angry.\" You people are pathetic.",
    "Did this bitch really compared transgendered people joining the military to black people back in the day joining?",
    "I am a gay lesbian transgender robot and I'm a offended",
    "Wow, disgusting. Shame on the gay community for embracing this man, or any transgender, as real men or woman based on attire. Keep in mind that, this man still has a penis.",
    "he a nobody who will not accomplish anything just because he gay doesn't mean this is ground breaking moment",
    "Is he or she a trans? He or she looks confused about his gender. A typical leftist.",
    "ABC, NBC, CBS and CNN are all disinformation, corporate tool networks....guess what?  You guys suck too.  Your controlled opposition in transparent.  Fox just sells a different B.S. for the establishment(give it a name, you know who your masters are) You guys are a joke...",
    "Why does this \"gurl\" have an Adam\\'s apple, man\\'s long neck, square jaw line and everything else being male.\\nPortraying itself as a sexually offended female.\\nAnd the news CNN people are all a transgendered race of freaks.\\n\\nI do not accept a liar from the start.",
    "How is this gay man a supporter of trump/pence... weird...",
    "Los cristianos son los que persiguen a los gays y no al revés, tomen nota de eso \\n",
    "Its Sad To Think That We Still Have Someone Who Worships Gaydolf\\xa0Hitler",
    "Wait SE cup is for gay marriage? But doesn't believe in final warming. WTF that's strange",
    "ok we get it ! YOUR GAY. now start respecting  other peoples preferences",
    "that's all right Manny if you lost the Nike endorsement, anyway the Gays used high heels and sandals, lol",
    "As I knew by my friend the movie is not matching the reality.. this friend is Libyan and he was working with US embassy stuff as translator and he was there during the attack. By the way I'm Libyan from Benghazi.",
    "TO the gay community get over it! you all are to over sensitive,  everyone is not going to like you all.\\nwhat you all do is entirely up to you. stop looking for attention.",
    "I’m russian\\nI’m an atheist\\nI support gays\\nMy country now hates me\\nidc",
    "Im gay im 13 this littarly makes me wanna kill myself",
    "Do people not understand that there is a difference between being gay, and having sex with the same sex?",
    "Most important thing is that there were 2 translators there today...",
    "that's why some places like this shouldn't have transparency policy to their organization.I don't believe that these meds are there.If they are, they must be on the black market there,sold underground for profit.\\xa0",
    "Wow this would be totally epic if CNN weren’t a bunch of libtard atheist gays ok bi like cnn",
    "Funds being transferred to ICE from FEMA is resulting in a PUBLIC PUSH of crowdfunding through various organizations, some of which are religious.  So, the government is asking citizens to take up the cause of funding this FEMA recovery, because of the transfer of monies to ICE.",
    "I'm never using public transportation ever again...fuck buses taxis planes trains",
    "Joan needs to learn that CNN is ran by political correct gays and black racist now!",
    "Put all the pdperwork out. Personal and top secret. Let us figure it out seems they cant. This is a joke. This is about right and wrong and the benidit of the people. True transerancy would be great",
    "The constitution says there is a clear separation between state and church. So the people who uses religion to discriminate against LGBT people are not following the law of the land.",
    "Wtf is happening in this world.\\n\\nRespect the minorities.\\nRespect the LGBT's \\nBelieve in feminism.\\nKeep your masculinity in check because it's toxic.\\nRespect single mums.\\nDon't slut shame women.\\nScrap patriarchy because it's against equality.\\n\\nIt's really hard to breathe nowadays.",
    "There are parent support groups for parents to better handle when their child is \"coming out\" or express being transgender. Kevin Hart saying he wants to prevent his son from being gay is not homophobic, insensitive, sure, but not homophobic!!",
    "Am a lesbian not by choice but just because I was raped by my step daddy",
    "blablala and re-blablabla... thou will notice the transparent five points downward in the active-background ... blablabla blablablalala...",
    "What is the problem? In spanish it\\'s \"no nos dejes caer en tentación\" wich means \"do not let us fall into temptation\". And all this people calling the Holy Father an antichrist, suck it he\\'s not changing the Bible he just want to better up a crappy translation.",
    "The Media and press has a long history of corruption and ethical transgressions. I'm tired of hearing folks on CNN and other bias media outlets describe themselves as noble purveyors of truth and justice.",
    "What does it matter with being gay or not, I get to decide who i fall in love with, give people their rights and mind your own business. If something does not affect you, why deny others rights that they deserve??? This is not at all cool........",
    "It saddens me that they equate gay rights with blacks civil rights",
    "I agree with Tom, that \"child abuse\" is deciding to ILLEGALLY transport your child. Why shouldn\\'t we make the parents accountable? Their fault, not ours. But yet, WE have to deal with that.",
    "Gay or not you're a great reporter.  Idiot Trump Jr. for posting fake news.",
    "Looks like a sellout to me... why not John Allison...  Why Mitch McConnell\\'s wife as Transportation Secretary... will Donald at least return our campaign contributions for the deception. Looking like \"Make America Same Again\"",
    "is that the same sick\\xa0 pope that allows gay marriage ?!!",
    "Bravo to the baker .as for the gay u have that  ass hole go work on it dude",
    "Don’t change the laws or we will have transgenders on the girls basketball teams and in other sports!!",
    "I hate cnn more than just about anything else. Including microtransactions, mulan 2, and fortnite",
    "So, in English people ask God not to lead them to temptation??? WTF ! That's the worst translation!",
    "I could hit a deer at 300yds  with a .308 rifle at 6 years old and these fucktards  think it's cool for a  year old to know how to shoot a gun. Da fuq  is wrong with these gaywads",
    "Please do not legalise  homosexuality or gay or lesbian rights,please",
    "Just let the LGBTQ take over everything! The Academy can find someone from the LGBTQ community to host the Awards. I’m not watching anyway! Good for you Kevin Hart. God bless you for stepping down. 👍",
    "I am a gay Boy Scouts leader (closeted). Ask me anything!",
    "She\\'s standing there thinking \"phew...managed to shift the convo away from my transcripts\"",
    "Translation .....I’m really sorry my legal team couldn’t stop this coming out 🤔😂",
    "It is a hearttransplation of The brothers heart to The man? I dont get it please help me.",
    "Trump said he was a friend to the LGBT community... I don\\'t think he knows what the \"T\" means in LGBT. What\\'s next he\\'s gonna say that LGBTQ+ has to leave America",
    "Hello Tucker. Oestrogen was put in baby milk! I will have to find the report I saw that in. It's part of the depopulation program. It has also led to an increase in gay mem! Thank you and much love.❤️",
    "They need to change the law where it states that if someone takes steroids for a medical condition, they can compete; hormones for transgenders shouldn't fall into that category since is a choice, not a need .",
    "The issue of LGBT isn't something to care about in our great country of Kenya. Infact stating publicly that you are among them can make you be stoned to death!!!\\nwe have enough performing men and ladies.",
    "I'm going to say the best thing ever...Being gay is a choice *hits a dab*",
    "You can be gay or lesbian at that age, but I believe 8 years old is too young to decide what gender you are. At least let the kid choose when he/she's a teenager. Other than that, it's not normal.",
    "This guy hasn't gpt a clue!! Value added tax or VAT as we know it in Europe must be paid on all purchases, irrelevant from the origin. Is a tax on transactions!! I can't believe the level of ignorance.",
    "Taxes in Europe fund universal healthcare, universal education & highly advanced, affordable mass transit.\\xa0\\n\\nTaxes in America fund corporate welfare for defense contractors, Wall Street, subsidies for Big Oil, military imperialism in over 200 countries & crumbling infrastructure. Just like the founders intended. FREEDUMB!",
    "Translation from Bill's words: We just cannot accept Obama's next term with Hillary being the next POTUS. The Reupublican party needs to win, although unfortunately we are stuck under a reality superstar. Yes, America, YOU (conservstives) voted for this moron and we gotta fix this mess.",
    "Elesbian Warren pops kids' balls when they land in her yard. ",
    "This is BS. I'm not a trump supporter but what happened to a peaceful transition of power?",
    "What a bunch of conspiracy nuts in this comment section. This information is not even hidden from us, Google is super transparent with this, you can look up all this info in your normal account without the need of a MITM device.... How about reading your FAQS and TOS.",
    "Why don't all these christians against gay marriage spend an equal amount of time on divorce???  divorce is also illegal in the bible,  so why don't they spend as much time fighting against divorce???",
    "What a joke, this woman is a shill, a puppet  for her cabal, pushing gay rights as a global crisis when the man repeatedly told u, the will of the people he serves and currently represents sees this a non issue. Well done sir",
    "The funniest person in the UNIVERSE!. \\xa0He was so out of this world crazy, yet he could transition into a serious actor. Very few comedians can live up to his body of work. I think everyone liked something about him. RIP your struggles are over Robin",
    "I had no problem with the joke but its so funny that people who criticize comedians for LGBT or immigrant jokes are using the same excuse they criticize. “Its comedy its not suppose to he taken seriously” i believe that quote but you cant be selective",
    "Hey, I'm not gay and I love Bruno especially for such an act of kindness. He is one guy who, with all the fame he has gained with his career, still remains humble. Gotta admire that.",
    "CNN your bias is showing you won't even say Bernie Sander's name you refer to him as he when his polls came up but said everybody else's name 10 times each come on your games are getting too transparent lmao guys can do better",
    "The dude looks like the gay guy from Mad Men",
    "We don't have to make cake for the gays but it's horrible to not serve Sarah!",
    "Gays hate Trans people so the right and them should get along just fine. Which strikes me very odd that a gay man would want to side with the people who don’t agree with him marrying another man.",
    "He trained for hours on a video game.... I DONT THINK THE DATA TRANSFERS IDIOT",
    "Effective communication in 2018 has come to this... politician and translator.",
    "stop stap uber is ilegale  transport ilegale no good stop",
    "All I know is former president Obama was gay and his wife Michelle is really a transvestite. Yuck!",
    "pleases tell me why or what does BUYING BANANA'S  n FRUIT SNACKS have to do with...👉 2 SUICIDLE  GAY BITCHES  DRIVING AN SUV FULL OF THEIR AFRO  AMERICAN ADOPTED KIDS OFF A BIG ASS CLIFF AT 90MPH!!!???",
    "CNN doesn't even try to see any positive. They're getting desperate in their news sourcing. How about looking into Obama's past in Chicago gay bathes and his drug use which was witnessed by many a fling he had.",
    "Its crazy to me that months earlier, Republicans were freaking out about the possibility of a TransWoman molesting their wives, friends, daughters, sisters in a women's bathroom.....and now they have no problem with Donald Trump admitting to sexually assaulting women? Like .... logic please?",
    "People can be gay all they want, but it becomes a problem when they shuv it on everyone else.",
    "When I meet people, am I compelled to mentally register whether they're White, Black, Latino, Asian, Semitic, Muslim, Protestant, Catholic, or LGBTQ, etc., etc., and affirm their identity before I talk to them?  Or can I just look them in the eye and shake their hand?",
    "This is minimum security prison ppl can get to at the end of their sentence, with perfect behavior prior and after transfer. If you break any rules you will be sent back to \"normal\" prison with possible extended sentence.",
    "How can dis nigga be a trans woman when he was clearly flooded with tonnes of hormones",
    "he wasent gay he was looking to see the club and scout it before he did that horrible thing",
    "That big fat guy seems absolutely obsessed with gay men??!",
    "Leave this country alone America.. you don’t know their country. You don’t know their culture. You don’t know their people. If he says 99% of Kenya don’t give a fuck about gay rights, so be it. That’s how democracy works.",
    "She just described sharia law, stoning gays is exclusively a muslim activity in this day and age. I bet if you point that out you're racist though. America is nowhere near what she's describing, what is wrong with people?",
    "How did he enroll in a Master's Degree program if he only attended a semester of college? Did he even have a transcript? Oh wait, it was a Master's in Theology. What an oxymoron.",
    "Totally agree with transferring the power to the women of the world. It’s time to let women have their perspectives have a go, across the board. I date back from the days of Golda Meir, Margaret Thatcher, Indira Gandhi and Benazir Bhutto. Firmly believe we need their new versions back.",
    "we watch gay basketball while we get pickpocketed by the Jew.S A.",
    "How can he talk about honesty and transparency when he's knows nothing about either, just ask him about the money he pulls in tax free by the way , how it is used and where it goes then prepare yourself for a real Bullshit reply if you get one.",
    "its bullshit he would say something like this, this is staged and or wrongly translated. Aghori are non-violent cannibals and merely eat the people who have already died. They are more or less peacefull people how akward it may sound",
    "It's not only white anglo gay men\\nIt's anybody\\nSo please stop arguing nonsense\\nAnd worry more about yourself",
    "Boo, Hillary. Just release the transcripts. No one else has ties to Wall Street that raise so many concerns, so we don't care about their speeches. It's your bed. Sleep in it.",
    "We as Africans we are community of Rights we dont tolerate thr dumbass shits of Western, there was nothing like LGBT in the history of Africa, so u Westerners better stay awwy from Mama Africa!",
    "Man I liked his music a lot, but sucks that he was gay",
    "Pence and his religious right cheerleaders are well known anti gay bigots, they want to see LGBT eliminated from society. To suggest otherwise is the real fake news. They don't care about bullying ruined lives and suicide. Sick evil bigots trying to cover it by a veneer of religion. Sick.",
    "I'm gonna put this in blunt terms, if you are gay then you have a medical condition that caused you to be like this from birth. Do i think it is possible for a person to choose to be gay yes.\\xa0",
    "I hate Putin but cnn is bullshit and propaganda. They deliberately incorrectly translated all the answers of Russians.",
    "I\\'m a conservative in Ohio and I hate K-sick.  He hides behind the SCOTUS and says they\\'ve decided gay marriage and it\\'s set in stone?  Has K-sick never heard of impeaching judicial activists for \"bad behavior\"?",
    "So maltreating gay people and women is okay because it's their culture? I've heard this excuse a lot from African leaders when it comes to LGBT+ and women, and it's sad.",
    "They censored son of bitch on movie, it apeared not the case here.Translation was not enough",
    "Lets see the rest of the transaction.  You have shown a young man walk out with a rifle.  We didn't see a sale of any kind.  Oh wait, I will take your word for it.  You have to legit!",
    "I am a gay lesbian transgender robot and I'm a offended",
    "RACHEL MADDAW IS THE LESBIAN OF THE YEAR FOR 2018",
    "Mutton and Junior, \\n\\n#NoTHANG! #ChristiansREFUSEtoJUDGE 👈 This works on Facebook   ✌😵💩\\n\\nhttps://www.jewsnews.co.il/2017/10/10/id-fck-christ-in-a-gay-seattle-coffee-shop-owner-causes-outrage-after-kicking-christian-activists-out-of-his-coffee-shop-in-the-most-lewd-way-imaginable.html",
    "I’m black and gay so I can speak \\nOn tv",
    "this comment section is making me sick . what did lgbtq people ever do to you ? LOVE is not a fucking sin , it’s a blessing . get a life .",
    "James Lambert Otis pleaded no contest to one felony count of vandalism, according to the Los Angeles County District Attorney's office. 3 years of formal probation, 20 days of Caltrans work and ordered to pay $3,700 to Hollywood Historic Trust and $700 to the Hollywood Chamber of Commerce.",
    "that CNN guy does too much make up..its soo gay...nice debate though",
    "He's gay but knows nothing of one of the gayest cities in Germany besides Berlin.",
    "Malaysia PM promised President Donald Trump that he will help to make America Great Again.... and that is why USA now owns the MegaYacht, Picasso paintings, penthouses, mansions, 3 Hollywood movies - free of charge!",
    "all transphobic ppl give it a few years and it will be normal",
    "It would be funny if her “daughter” is transgender and he identifies as male",
    "And why oh why is she and several on her staff not in jail.. You can not transfer data from a secure computer and put on a non-secure computer. That's called espionage, any one else doing this would already be in jail...",
    "COMMENTS FROM A LIAR OF A MUSLIM..................LOOK AT HIS PAST A GAY MUSLIM",
    "A gay jewish Nazi? Can't the leftist hive mind think before it opens its moronic mouth?",
    "Don't even need this much transparency to know how rotten things have gotten up there, no matter how much they try to hide it, but this is of course another welcome step towards a better future.",
    "Wow! And suddenly we where transported to a FAUX News studio?!\\nI work as a journalist and understand the need for \"playing a bit daft\" in order to get the answers that the viewers can relate to and understand but this... this is like a meeting in the oval office. :)",
    "The MSNBC hosts ask \"How would Trump react? He would counter punch.\"\\nWhat they fail to do, is have this conversation: \"How would Bernie react? He wouldn\\'t have to, because he is very transparent, open and honest. There are no Bernie scandals.\".",
    "why the fuck would someone choose to be gay? is like saying someone would chose to be poor instead of rich given the chance. not that being poor is bad and your deserve less respect, i hope u fellas get what i mean.",
    "Obama is nothing but a puppet with different colored skin.\\nHe is a CIA creation, knows nothing, gay gay gay, was a regular fixture on the Chicago bath house scene, on the down low.\\nPuppet who says he works for main street but really works for Wall street.",
    "It had to be an act of terrorism because the transponders stopped abruptly.",
    "Watched Brokeback for the first time ever in my life last night - refuse to watch anything with gays in it because my brother was Gay and a dead set dickhead (R.I.P) But it was a great movie and I am so in love with Michelle Williams.",
    "If she was a hot blonde it's no way this would have transpired",
    "These white folks are trying to globally push this gay agenda on us. Big ups to this brotha. They know a feminised black man isn't a threat, especially if he isn't going to procreate with a black woman to sustain his race.",
    "Bitch wants to be trans,dude already looks like a guy",
    "Its sad that Buhari is the only 'credible' opposition candidate in a nation that boasts of tens of thousands of educated and knowledgeable individuals. We pray for a peaceful transition whoever wins",
    "Why do people always compare gay marriage to polygamy or worse, beastiality? Gay marriage is two CONSENTING adults coming together just like hetero marriage. It's that simple. Gay marriage doesn't change marriage it only expands it. Polygamy on the other hand changes it completely.",
    "It would be nice if there was more transparency in the American Whiskey making business, such as finding out on the label, who actually produced the spirit. In Scotland, it's the law that the process/distilling of Scotch has to be produced by a single distiller,.",
    "I'm surprised that trans people are even allowed to protest let alone leave their own home.",
    "Now Iran's financing North Korean chemical weapons to be deployed in Syria.\\n\\nThat's gotta be some really strong chlorine.\\n\\nThis, from the world's most outspoken and transparent war hawk, offered without a shred of evidence.\\n\\nTypical fu*king Zionist shitbag.",
    "This russian word can be translated in context also as \"Colorful\" Putin basically said that Trump is colorful person or person who stands up from crowd. \\nOK - now I see she already mentioned same thing.",
    "To everyone here showing hate for trans people: you'll all be subject of ridicule in a couple more decades and will probably regret what you said - if you're still alive.",
    "Ok so most gay people, like me, surround then selves with girls and according to this \" \\'go in to jail straight come out gay\\' theory\" most gay people should \"become\" straight so... bitch where???",
    "What is wrong with preventing my son from becoming gay! He's my son for crying out loud. OMG",
    "Oh my god we have a freedom of religion so if your religion doesn't like LGBTQ+ community, fine. Whatever. But, religion shouldn't influence government. If they feel like they're a boy, it's none of your business. They just want to piss.",
    "Wait even gay penguins...I need to see this and see them stealing eggs 😂😂😂",
    "This guys is not normal. I don't know how he is leading the country. He speak like a 10 years old kid.  He got no reasoning at all. He cannot even answer the questions in a transparent and systemetic way.",
    "1:47 lmao the translator was like why tf did I agree to this in the first place 😂",
    "CNN your gay as fuck. That's not news you guys suck duck",
    "Megyn Kelly, Laura Ingraham, Michelle Obama, Melania Trump, Taylor Swift are some of the New World Order MTF transsexuals found at the elite level. Adhering to the Baphomet contract.\\nmtf = male to female",
    "He is gay so?It wouldnt make any difference if he was straight.Absolutely no difference...",
    "I can't find this chick on twitter I find this interesting and bitter at same time. What about the latin gay boys who know the struggle of racism but act this way ISTHIS JUST TOWARD WHITE GAYS ? It's fine line of racism ",
    "Hey, let's get the most transgender, lesbian, shaved head to imply cancer looking kid we can find to speak so the public is afraid to say anything in opposition to her.",
    "5:06 \"Fully transitioned people must be unhappy\".. Hi, trans-person here. You have no clue what you\\'re talking about, Ja Du, and you do NOT represent the majority of trans people. You need help. Of course, Fox News chooses THIS individual to go on television.",
    "That Portland video is exactly why I fled from that city. Can't read conservative news sources on public transit without getting dirty looks, getting called foul names, and even being spat upon by the tolerant, loving leftists.",
    "\"Allahu Akbar\" translates directly to, \"To God be the Glory\"",
    "Very very thankful that Kavanaugh, representing Republican conservative views, was confirmed... As this whole circus was fueled by democrats against morality... who want the evil murder of abortion and the abhorrence of the transgender and LGBT movement to continue. May God, in his Mercy, not take his Blessing off America.",
    "people may be mad that he will vote for Hillary but don't forget he will still fight for us and try to transform the Democratic party but we still can't vote for Hillary",
    "CNN is a gay liberal network you bunch of fat cunts",
    "Stupid. If my kid did that I'd punch him for acting gay.",
    "They had to remove his content because it was turning the frickin frogs gay",
    "Enjoy it while it's here because in a decade or two the Muslims and the atheists and lgbtqedfrtgc mafias will make sure it's torn down . Or will vandalize it or burn it down legal or not in not to long it will be destroyed.",
    "I can't believe this...Gays have been and will be discriminated against 100x more than Christians.  Are kids beating up Christians at school for being Christian? No. Are they beating up gay kids for being gay? Yes.",
    "Gays are not being bashed in Russia they are being corrected",
    "Good for you Kevin!!! Be your own man but why apologize again?  It’s sad to see how men compromise their truth for they gay community but newsflash Oscars.  Blacks don’t watch the Oscars anyway.  Why aren’t the gay/transgender community apologizing to Black community",
    "Rachel Maddow who used to be a man. embarrasses transgender men to female.",
    "Lol Arizona is so gay... 8 and up lol in Texas its born and up",
    "I'm a trans female and I'm happy Mr. Trump got this one right!",
    "Roy thank God you did not win ...... he hates gays and he loves teenage girls f*** him",
    "Why are people so against gays? what did they do?",
    "lol all these fucking cis people dictating how much a trans woman should feel humility\\nlol all these fucking cis people acting like being misgendered isn't a big deal\\nwow guys way to be fucking open minded lmao",
    "And of course, not a single channel will report this in the media. Fuck this gay Earth.",
    "Why don't you use your POWERFUL Masculine voice to tell everyone that you're a transgender.",
    "How will he get married if he hates girls?\\nWill he turn gay and marry a boy?",
    "Ahh CNN. Just like Fox. The cunts dribble more shit than a gay man with diarrhea.",
    "I wonder if gays were gods way of seeing if they would follow his words... LOVE ONE ANOTHER!",
    "guys in prison who have gay sex aren't gay, they're just looking to get off",
    "LOL, the translation is kinda bad, im german and I understood the think Merkel said.",
    "If LGBTQABCDEFGHIJKLMNOP have issues with this. they should read into it, he's not stopping you from identifying as whatever you want. Just finally putting the argument to bed. Just not your bed.",
    "well well well cnn...i suppose the Texas Walmart Muslim that took hostages was gay too or?..whats the excuse now? when are you going to wake up call it for what it is.",
    "Soooo, Flynn gave a heads up to the transition team that he was under investigation and we are supposed to believe that not one person let Pence (the person in charge of the transition) know this??? Yeah okay. 🙄",
    "Wish people would stop saying that sodom was about gays no it wasn't it was about pride the tradition way people interpret the the bible is wrong everybody please look up Matthew Vines interpretation",
    "i agree with boss.  My ? is is this dude for or against gays?",
    "Trump needs to go all \"Lock her Up!\" \"MAGA\" and Build that Wall! That\\'s what gets the hillbillys excited. Whatever he\\'s doing with regulations and the rich corporations is not translating to popular support.",
    "FUCK ALL CNN GAY MOTHERFUCKERS AND LIBERALS......TRUMP WILL WIN IN 2020",
    "Just got chills hearing the transcripts. Cold bloodied murder. Sickening.",
    "Why are you pushing your gay agenda to Africa? Its Satanic, period!",
    "This is a transphobic and sexist ad and it's disguting that it is being produced and that you are celebrating it with even more transphobic humor in 2016. Snickers and the Mars candy company ought to be ashamed of themselves.",
    "at 1:13 wrong translate! This is stupid anti-russian propaganda. People dont belive these lying CNN.",
    "He’s a gay Jew married to a black man the exact opposite of a Nazi",
    "This man is a complete idiot. Start your own troop then if you don't agree with things the way they are. Stop bullying for all troops to have gay leaders, not everyone wants you.",
    "yall are gay lets ban cars because a drunk driver killed someone",
    "Did anyone ever tell these fools this is public transportation, not a school bus.",
    "Republicans better start supporting gays and illegals or they won't win the next presidential election. ",
    "If there are some transgender people who are professional, strong, brave and smart to serve then why not right? i think its because most transgender in america are too dramatic, taking things personally thats why they have that decision. military needs self descipline.",
    "Whilst I don't agree with the President, i really respect that he answered the question and didn't why away or change his answer. I'm sure in Kenya there are far more important things in the Government's agenda so why did Amanpour focus on gay rights?",
    "\"Non-binary\" transgender seems to be more of a spiritual feeling from what I observed.",
    "Im all for gay rights, but it shouldn't be allowed to force people to work against their own morals in their own business doing their own craft. It sucks to be denied service and be discriminated against, but... Just go to another shop!",
    "'I understand' 'I understand' roughly translates to 'shut up, shut up.'",
    "dont hunt!!!! killing animals is stupid... if you kill animals for pleasure ur gay!!! stop hunting!!",
    "For the gay bashers out there: \\xa0The lady doth protest too much, methinks. \\xa0Gee... \\xa0I wonder why there is so much emotion wrapped up in how \"other people\" live \"their\" lives. \\xa0Hmmmm.",
    "It's funny how the only people who attest that being gay is a choice are straight people.",
    "what is a non-binary transgender? sorry I'm not aware of these things I just kindve accepted there were only two genders... but recently there are more?? which I'm open too... I just don't know what they are??",
    "So we going from micro transactions in video games to micro transactions in real life",
    "He literally said dificl which means hard and you translated to easy",
    "To everyone that supports chick fill a, I am very pro LGBTQ, and even i am not offended by this restaurants existence. I just choose not to eat here, because i just don't agree with their moral values.",
    "It does not fit! The Assad regime was winning. They had no reason to provoke the  USA with a chemical attack. It’s a bs pretext and it transparent to everyone except the Mainstream media. Fake news!",
    "Where the FUCK is the video? I want to hear him, not your bullshit translation.",
    "Why the fuck is this on when I typed in T GAY",
    "i though this was the onion at first... Fuck this gay planet",
    "Can anybody who knows Spanish get a translation of what the mother and son are saying? Been hearing a lot of mixed thoughts on this video and their dialogue may shed some light on the credibility of this scenario.",
    "Slap the hands and move forward. Trump 2020!!! Fuck Democrat scum. If any luck VP takes over and puts gay rights and abortion back 20 years. Be careful what you wish for.",
    "he came there next day so what is wrong about it? Muricans are rly wierd people. You are nation of commies, kkk, neonazis, transgenders, gender fluids and other disgrace of humanity. Only patriots make better view of US...",
    "Remember the owner did this because her GAY employees didn’t feel comfortable and pressured her to do it. So much for tolerating from gay folks who want others to tolerate them and their twisted sexual views.",
    "He sounds like a robot with a neurological disorder. Maybe we should treat him like \"truthers\" did to Obama-lets see his educational transcripts-I can\\'t believe this inarticulate man has a medical degree",
    "pity obama can,t leave us in peace i hope he gets impeached after he has left office for lying to the voters and lining his pockets. ASHOLE that he is, gays are right up CNN,s fake news ashole, they are both major liars.",
    "I don't know whether or not being gay is a choice but I do know that engaging in same sex sexual activities is a choice and morally wrong. A kleptomaniac doesn't have the right to steal.",
    "How pathetic these US \"journalists\". The lies are so transparent buy yet they are caught up in their propaganda web. If these people are as indignant as they appear, they are truly in a parallel universe.",
    "Junior is \\'the gift that keeps on giving\\'! Thanks so much for confirming what many already know: That this memo is personal, written to please your father, and is not about real \"transparency\".",
    "How embarrassing!  This is just another example of how sincerely ignorant most Americans are.  Please expand YOUR vocabulary.  Her comment translated to American speech simply says Ivanka was irresponsible, lazy and stupid (in accordance with the oxford english dictionary).",
    "Better at what?being trans and black not a good look",
    "Why not just say \"LGBT+\"? It\\'s better than trying to say that long acronym whenever you see someone who\\'s part of the LGBT+ community. I\\'m not hating on it or anything, I totally support the LGBT+ community, but I just think that acronym is a little ridiculous.",
    "Supporting gay marriages is totally bizarre as it could never be equated to a hetrosexual marriage !!!  Why call it marraige?? If too dickheads want to live together just do it as a union!!",
    "Kim Davis discriminated the gay group. If the law is against her belief, she could quit. It's not right that she earns more than 80,000 a year on her position and refuse to do the job!",
    "Why does that shill talk out of the side of her face? I suppose it's better than listening to her Arse! If she lost her hands, she'd be a mute. A transgender one, to boot. And she's got smothered facial hair roots. Definitely very butch mannerisms",
    "Maybe change the title a bit it\\'s as if we \"attacked\" Canada but they\\'ve actually said some not great things about Canada. As a news channel I\\'d think you\\'d want to be a bit more transparent in the way you word things.",
    "I think we all agree that we should wage war on ISIS. Same goes with gay marriage.",
    "Just a few months ago republicans were afraid of transgenders using the bathroom cause they \"might\" grope their wives, sisters, mothers or daughters. Today they want a pervert who openly brags about assaulting women to be their president..... Can\\'t make this shit up. Pure comedy gold!",
    "so sad....that a Luciferian pedo can find love in his heart for his own...yet, could not transfer that into empathy for the children and countless innocents he harmed. God is just and merciful but, I do not envy this man in his current destination.",
    "Unfortunately, you Americans know about Russia much less than we Russians about America. Your knowledge is full of stereotypes and myths. The translation is done by Google. Sorry for possible errors.",
    "uh oh trans people make  straight people angry. that's always a fun thing to do lmao",
    "The Clintons hate Black People.. The Clintons championed laws that led to mass incarceration. Plus they hate Gays and women. Passed don't ask don't tell and accept money from countries that oppress women",
    "Can a Korean translate what they're saying please, something seems fishy lol, who smiles when expressing their hatred 😂😅",
    "this school should be shut down  .fuck u gay school",
    "how did he not know she was from Russia...she needed a translator because she spoke Russian",
    "Michael Cohen preparing another 130k$ transfer? those guys around trump are so desperate and totally nuts...",
    "Anh Phong than men,\\nToi nghe noi: sau ngay 30/4/ 75. Nguoi ta gap Nhac Si Van Vi di chay xe om!\\nKhong biet bay gio dan minh da Sáng mat ra chua.\\nNguoi ti nan Gia,",
    "Can anyone confirm that what the reporter read and heard and translated is correct?",
    "Oh LardAss, I'm helping Gary Johnson to beat LesbianPantsuit and Dawnie CuntFrumples...",
    "I'm a come out to Obama as a rpg transformed to a human and to take us seriously",
    "VICKY AND FOX NEWS TREASON ! With a Gay flaming \\nCHRIS 's bum HURTS ! LIARS",
    "are yall facking serious? if he doesn't want his son to be gay, so what",
    "HEY LOOK AT ME I'M BISEXUAL! I'M CHRISTIAN BUT I'M APPARENTLY A SINNER SO I'M GOING TO HELL!",
    "Come on...how gay is this guy lol.  He hates himself for it and it shows.  Seriously too funny.",
    "Unfurtanely you see most Jews are atheist and gays parades \\nAnd treating Orthodox Jews like second hand citizen",
    "Uhhm, excuse me. What comedian has never made a joke about gay people? Can't seem to think of one. The same way white comedians make jokes about blacks, and black comedians make jokes about white folk. Try listening to some Steve Harvey.",
    "Pacquiao's comment was taken waaaaaaaay out of context. If someone can just translate that interview...",
    "0:43-0:45 - ha ha, They did not translate the part where he swears about aghori fucking mother or something like that,  0:45-0:47 is when he talks about cutting off his head.",
    "HES A SONE OF A BITCH\\nFUCK TRUMP\\nHES A NOOB \\nHES GAY\\nFUCKED UP\\n😬😬😎😬😬😬😬😬😬😬",
    "Think there is some play on words going here by the lawyer. Saying ‘I don’t want to bake a cake for a gay couple’ is drastically different than saying ‘I don’t want to bake a gay themed cake’. You can say the latter to both gay and straight couples equally.",
    "I wonder how many bitches were sitting in their little tiedoff room thinking of clever ways to tie the door shut and how many bitches were like just sitting, waitng, on Facebook like what goinon? Making statues nshit waitnfor itto be over..fucingay ameria",
    "She never said Extremist, she said Jihad in every time they translated to extremist, CNN CENSORING FOR YOU. BUT WHAT ABOUT THE PEOPLE WHO KNOW A LITTLE ARABIC!? YOU BITCHES LOOK LIKE FOOLS! LONG LIVE SADDAM!",
    "These survivors will never be the same it's a devastating tragedy and a horrible loss of human life's just because of some guy that was all messed up didn't know if he wanted be gay he was ashamed by it and then his beliefs made him go insane",
    "\"..undergone a very public transgender... Uh, uh, public transformation\" \\n* Mass media, politically correct coward can\\'t tell it like it is. Who gives a dam if the guy wants to wear a skirt? Just tell it like it is!",
    "America is so shit rn, gender this transgender tractor that. kms",
    "Gayfrogger insurgency.... Look out for pink helms and dildo wielding Warlocks. 👌",
    "Damn cameras, I can’t hear the English translator AT ALL",
    "Ben Carson is nuts!  Crazy coo-coo in the head and it's ironic that he's a brain surgeon! \\nAny college educated person who thinks people go into jail straight and come out as gay is fucking nuts!",
    "Abe mistranslated what the cameramen were saying. They were saying \"please look at the camera\" but Abe translated it as \"please look at me\" which made the handshaking awkward. He actually tried to make Trump aware of it with gestures but he didn\\'t notice...",
    "Nobody wants this gay appeared at any media. But CNN did it, oh well.\\n Let's blame him for everything.",
    "You guys get this straight. Michael Sam got drafted because he came out Gay! He bombed the combine. Extremely poor athleticism, his horrible 40time, very poor vertical leap, bench press piss poor. His combine was atrocious. No I e else would have gotten drafted.    ",
    "\"every child is a precious gift from god\" unless they\\'re black, Hispanic, poor, a woman, gay, etc..",
    "9 PUERTO RICANS CONFIRMED DEAD - The Military's C-130 cargo plane that crashed today in Savannah, GA was on it's way to be decommissioned after 60 years in service. The plane was used in September 2017 to transport victims of Hurricanes Irma and Maria.",
    "Just because someone doesn't support gay marriage, it doesn't make them a homophobe. Disagreement is not hate, stop using it as an excuse. I love God and ALL of His people, but I cannot support something that He says is wrong",
    "#trumpisgay , if we continue hating on trump he will lose",
    "For Republicans to be anti gay they sure are riding a lot of trump dick",
    "what i find funny is that the past elections have had politicians that are really nothing more than \"corrupt businessmen\" disguised as \"politicians\"\\n\\nfor once, a degree of transparency!\\n\\na businessman whom is actually known for being such that is delving into politics.",
    "This is how American tax pay for... hahahaha blame IRAN for American being gay... If yellowstone national park blown up who is he gonna blame next time?... go back to the hole that you came from, you are not Senator you are not American origin...",
    "What you deserve for playing thoccer in the first place. USGay! USGay! USGay!",
    "Very nice of Tim Cook to show kids that it’s ok to be gay. Good job Mr. Cook. #TeamApple",
    "that guy is a gay! and ISIS will gladly have him a IED in his ass",
    "4:09 Persian Gulf, there is not any Arabian Gulf in geography of the globe!\\nWhy is he thinking JCPOA is one side transaction!\\n15:57  Internet or intercontinental Which one is really important ?! He think he is so smart by pausing and saying \"This is very important!\"\\n17:21 !",
    "Most of these so called women are transgender, This is a another play to make real men hate real women.These so called elites are playing games with our minds.Open your eyes and see with your mind.",
    "We have bigger issues in Kenya.. let’s force in the bigger issues of how my ppl will get jobs, fix the roads, school and help the poor people not this issue.. gay issue.. thanks this European people what’s to make it an issue for us..",
    "Trump is truly a terrible human being. Trump is anti gay, racist, and anti lgbtq+. He is scary and he needs to be stopped. I hope to god he gets sent away far away",
    "What's true and what's not? Was not Hillary Clinton against gays, lesbians etc? Then she changed her mind. Guess she need their votes. Was not Hillary Clinton for the re-segregation of the USA? Then she changed her mind. Guess she need their votes too.",
    "It's interesting to see how straight men react to gay men catcalling them. Straight men don't like it.",
    "Fake and gay. This is as real as the U.S landing on the moon.",
    "Why does Mike Pence need a lawyer if he did nothing wrong?  I mean other than standing by silently and allowing trump to ruin america,  implementing policy that effects the lgbt community negatively, and choosing Devos to be the education secretary?",
    "Stan Lee has not simply died to me and millions of people. He has transitioned and at present telling the cosmos his amazing stories. Thanks for all of your tales and rest in PARADISE MR. LEE.",
    "1. We're certain that this isn't a Navy transport ship with soldiers on board who, you know, have to eat too?\\n2. The so-called military experts on this board have no idea who KT McFarland is, lol.",
    "Offt...her face looks like it hurts. Poor lady has no gays around to keep her up after botox. Just look at brow...looking suspect. But seriously. Her twisting of lies is showing on her face. Its twisting her face.",
    "All this coming from a man who won't even admit he's gay, yeah he's real progressive, Ha?",
    "Piers Morgan, what a F&%king idiot, with his Gay insinuation to George. May the fleas of a thousand camels infest you! This man will be greater that your entire Gene Pool.",
    "yeh nah. the letter salad pisses me off as a gay guy as well. I prefer to use queer instead of the lgbti blah blah list. \\nBasically the !(cis ^ straight)",
    "Didn't notice he was gay until now.  Pry  why he did himself in. Couldn't handle it",
    "Shouting \"nazi scum, get out\", at a gay Englishman, while appropriating his culture.\\n\\nDo these people have no self awareness?",
    "why dont they be detailed,  like say vision will be covered but prescriptions won't,  transportation is out of pocket, its like damn, just keep it simple, send a cute newsletter and call it a day.",
    "'You're a Republican though'. Translation: 'You are an enemy of the state'.",
    "By the same logic, God can use Hillary, too... right? Oh wait, He only forgives Trump for his transgressions, not $hillary because she\\'s a woman and 1 Timothy 2:12 clearly states \"I do not permit a woman to teach or to assume authority over a man; she must be quiet\"",
    "That cretin has never read a transcript in his life!!! #FakePres",
    "I\\'m gay but even I find this moronic. Can\\'t we just say \"sexuality\" and if people have further questions on your sexuality. Then the individual can simply explain their attraction and life style then instead of trying to hit the random button on a letter generator.",
    "I think he stole her acount  only\\nI do not expect that the phone was transferred to Yemen",
    "Hannity please Trump admit it himself please we no you getting up the ass by Trump on a delay base and we no you are gay no matter what Trump dose you don't believe it . we no you need Trump dick delay L o.L",
    "Hi gays who read comments I wish you all have a good day.😊",
    "gay men (black or white) like talkin like that.. they can not even be into black culture or people or style or whatever all that much and still be like that\\ntrust me I know some to know this",
    "Mad cow maddow is a corporate narcissistic phony money hungry  pig. MSNBC is a Comcast right winged corrupt greedy corporation. I bought a mad cow book once, read it and thought it was pretty good. Since her transformation I use the book pages for kindling.",
    "I have a transgender kid in my school. He just uses the nurses bathroom.",
    "I thought I'd come into the comment section and see all the hate about how awful this is... I guess not... you people are sick. For any LGBT person/ally scrolling through the comments know that you are loved and supported <3",
    "God also handpicked a Gay man to do his bidding I don't hear to many Christians defending the gays.",
    "Just send a plane load of gay porn materials to Syria and Iraq and ISIS will cease to exist.",
    "His Neck was broke before he got in that transport van that cop broke his neck with his knee.",
    "If Joy was a white male. She would be in jail for hate crimes. But she’s not, so will probably get a promotion and a award for advocating for the LGBT community.",
    "Omg that girl is so gay I can’t stand that pig",
    "Of course a gay Anderson leftist doesn't like trump along with CNN that's a joke.",
    "So my dad said Obama didn't do much or anything good. Ok so you think legalizing gay marriage and helping the LGBTQIA isn't good? Obama restored peace with Cuba after years of banned trade is a step backward? You think making Heathcare easier for everyone isn't good? Yeah explain that",
    "\"We have very good intelligence on Russia\"\\nTranslation:\\n\"We made it look like the Russians did it.\"",
    "Hillary was one of the great unwashed, militant gay feminists, popular at that time, when her family and Bill's family (same family) forced marriage upon them. She has never had any sympathy for any woman willing to have,  or even unwillingly had sex with a man..",
    "He looks like a gay version of dark night joker. Lol No disrespect to the great heath Ledger",
    "Woah. Crazy ramblings of a crazy man. Imagine having to translate this into other languages",
    "Why can't people understand that Democrats are only for illegal immigration and gay marriage because it get them votes.",
    "is anyone here older than 18 years old, or have your edgy high school days transcended adulthood",
    "All these 3rd countries should prioritize their gay communities before anything else lmao how arrogant sounding you dumb fuckn CNN reporters sound honestly try and fight for morals but have incredibly disgusting ones",
    "I am South Korean I'm surprised to hear what other countries have to say about our talks I am not good at English Please understand me😂😂 I wonder if my translation went well",
    "🐸  I identify as a gay frog  🐸",
    "A lot of inmates are gay through necessity because of rape experiences",
    "Scalia is a curmudgeon! Voted against gay marriage.Old bastard. He will be there for years, unfortunately.",
    "Embarrassingly transparent how the republican party would rather have Hillary  elected than Trump.",
    "Lesbian, Gay, Genderqueer, Bisexual, Demisexual, Transgender, Transsexual, Twospirit, Intersex, Queer, Questioning, Asexual, Allies, Pansexual, and Polyamorous.",
    "The segment about gay rights and The Stonewall Rebellion of June 1969 was very good ! However, it was only 8 minutes long and at the very end of the broadcast. Why is that ?....I demand equality and equal coverage time from CNN !",
    "Ngayon lang nangyari to sa term ni Digong. Totolly destroyed even the engine and walang kinahoy ultimo  mags o headlamps, bago sinira.Dati naaareglo yan sa BOC. Padulasan mo lang yung mga nasa loob ng Custom. Lalabas na oto mo na may escort pang Highway Patrol o Hagad.",
    "The thing is we don't know who we mingle with each day at work, taking public transit or even at the shopping mall. All of this bullshit is coming from politics. I don't like politics and the government hiding a lot of info from the citizens.",
    "Maybe if straight people didn't get divorced at a rate of about 50%, gay marriage would never have happened. You destroyed the sanctity of marriage much more than any gay person ever did.",
    "Stfu gay ass network hahaa funny meme take a laugh dumbasses",
    "firm President ,we are not American let them practice gayism in their soil",
    "And Steele is really Shocked?!? Pleeze... the only word they didnt say was token. And to tell him show grace!?!? Translation...'bow down boy' Michael Steele pride should have made him stand up, and walk OUT!",
    "Tbh being trans is a form of disrespect humans just like any animal are made to live life like an animal species. So if u were to so said become a trans gender, ure basically saying I’m useless to forwarding of humanity. Stating the facts here",
    "Doesn't it cost like $20 per transaction in fees? How's that better than credit card fees",
    "What the Pope is saying  actually makes sense...the translation is bad.",
    "My sincerest apologies for those ignorant Americans, Canafians, Europeans and other nationalities who ha ve joined these commentaries only to show their uninformed points of view.  It just goes to show that stupidily transcended nationality.",
    "Please may anyone translate thios speach for me to spanish?? is very important\\nI love America and I love Obama\\nThanks!!!!",
    "I really do have a lot of respect for Dave Chapelle. Even with the jokes he made of transgender people he does have a good heart.\\nThe title is terrible and incredibly misleading. It should be titled \"Ben Jealous and Dave Chapelle discuss Trump administration\"?",
    "Every thing else is fine but whats up with gay ass back ground music",
    "I just want to say, and don't miss quote me, but the sheer amount of favoritism this reporter showed was repulsive. It was plain to me that he was definitely not as willing to hear the gay side of this argument as the black side.",
    "Dr Carson is right. Being gay is a choice. It's not biological nor anything else. ",
    "Is transgender a gender? I think some people consider it a gender but i think if your transgender you're still just male or female. And hermaphrodotic people are hermaphrodotic people. But that's pretty rare, so.. 2 genders. With the rare exception of hermaphrodites.\\n\\n_biologieieieieiieiekeiyyy_",
    "There weren't any problems before being lesbian, being gay , being bi . Except the fact that we always thought we were better , and now it led to these things . It has to stop, we need to take a stand that we are all equal.",
    "Africa has finally come of age. Lets agree to disagree, LGBT issues wont be pushed down our throats. Lets discuss environment, technology transfer, Food security, National Security, Education, Health, wealth creation and so on. Personal preference on matters bedroom is just that PERSONAL. Lets move on.",
    "Why do transfers make people sound like idiots with no expression..",
    "Dana is clearly a plant by the corrupt transgendered Democrats. Its so obvious that Dana is a girls name and that picture is of a man. How dumb do you think we are Rachel?",
    "The best face transplant I have seen. He actually looks handsome.",
    "My friend is a lesbian, and she's never been to prison! Explain plz I am so confuzeled??????",
    "I just came up with an antecedent to this situation. Maybe Ted Cruz is a cross dresser. Just an idea, I have nothing against Ted Cruz or anyone with identity issues or that are transgender.",
    "Don't be fooled by the fancy name. This organization is politically motivated not scientifically. They only have about 500 members, as opposed to the American Academy of Pediatrics, who do support trans children. That organization has over 64,000 members.",
    "Stop using the gay card LGBT, people have their own principles, deal with it",
    "The core of Drumpf's base is angry because the country is getting browner, gayer, and a lot less christian. I am ok with that as people are people and religion is a cancer on society.",
    "There is this huge need to put all the data on the blockchain ... that s how we can ensure that the data is encrypted , distributed and used transparently ....  WEB 3.0 IS THE FUTURE !!!",
    "If things matter what was said 10+ years ago. Maybe people need to start googling Hillary's name and she what she's said. It's all over you tube. Search her stance on gay marriage and black teens in videoed interviews lol I don't support Trump but I'll never vote for Hillary.",
    "this black guy is gay too. It's so obvious. He talks like a white valley chick",
    "Yeah but hes not totally innocent. Hes guilty of being kinda gay.",
    "Who is the gay nigga. Cry in jail u get stabbed nigga.",
    "Haddad would transform Brazil into another Venezuela, just corruption, making Brazil worse than ever. I don't agree with everything that Bolsonaro says but, it is what we need right now, no more corruption no more PT, we need to reborn as a country. Stay together and may God bless Brazil.",
    "the only political science march should be to get transgenders mental help instead of sex operations",
    "If you love gays and mexicans and africans who sell drugs in every city and you also love muslims then vote for a democrat BUT IF you like the white race and the 1980s era than Please vote for TRUMP> bottom line....",
    "ok so umm... that translation was shit wtf. I only seen this now",
    "ima sound like a queer for saying this..\\nBut Zoo's are wrong. I just can't see the fun in visiting Animals locked up in cages or water tanks. Tbh, it disgusts me.",
    "Guys chill tf out I think most people would walk out so they can get away from school like on it’s own I wouldn’t cause that’s gay but if everyone did then I’d have an excuse to leave school for a bit.",
    "What's the fuss is about with the other interview?? He doesn't insult her, he's asking her very good questions that lets her talk about her life and transformation in ways the public will understand.",
    "ALL MSM are propaganda fraud. cnn, fox, abc, nbc, cbs, msn. we need to look at news and decide for ourselves, we don't need all these lying reporters translating news for us! wake up already!",
    "Fuck all  haters of gay wow im a gay teen   u guys ur just little shits",
    "Respect to him for being honest and up front. Like people have commented countries like Kenya where food and water is an issue in places have more to worry about than gay rights. Media always trying to make a witch hunt using vunrable subjects.",
    "Black people garvey warned us about hanging around Europeans now look at us promoting their gay agenda",
    "character attacking instead of arguing a point, seeing the absolute worst in people, entitled and demeaning tones, hypocrisy, and some other stuff I'm probably forgetting. *sigh* .......any other guy here happy they're gay or bisexual? I am.",
    "I'm sorry that I might be ignorant, as I don't know how the patients are selected to get transplants, do they pay for it or how!? Cause this man is old, and I'm sure there could have been a much younger patient who hasn't enjoyed most of the life yet",
    "as a gay man how dare you saying who cares about trans issues...",
    "Justice has a way of making those  who have something to hide very nervous. It's very transparent here at fox. Those who make comments here cannot do it with any class, just fowl mouth uneducated rhetoric.",
    "Islam is the evil. If you are faithful to the Root of Islam. Then you are worshipping hate. \\nIsis and any other Muslim group is in need of transformation or extermination.\\n\\n",
    "He's so transparent about when he's on prompter it hurts.",
    "I'm not trolling, but I always thought AF1 was public transportation for the president?",
    "What is the purpose of even asking if Gay sex is a perversion? This is a political hearing for the Secretary of State; seems more like an attack on his personal values than anything else.",
    "If anyone can find & retrieve sheriff scott Israels own gun ownership on what type of weapons he has in his personal transportation. His home. . .  \\nThat would be iceing on the cake. 🎂",
    "A famous case was of a woman with a successful face transplant that lost her face when her dog ate it off when she fell unconscious. She later died from the long term effects of the transplant.",
    "It's been proven over and over again that Planned Parenthood wasn't selling body parts for profit - they were charging fees that covered the transportation costs.  Ted Cruz knows this, so he is blatantly lying here.  I guess it's no surprise that he would lie though.",
    "This N.C. law is not anti-gay or transgender, it's anti-perv.",
    "well clearly she is gay and wears a nose ring for a reason... to be a bitch",
    "Anderson denied family members Bondi's critical information about charity fraud by grandstanding over a political agenda.  What a sleaze Anderson Cooper is.  He victimized the LGBT community because of his personal hatred.",
    "Your not alone....Dont worry we got you Sean....... Enough is enough and their lies are transparent...We know the truth and the left cant hide it anymore. Their voting pool is EXPOSED!!!!!!! EXPOSED EXPOSED EXPOSED!!!!!! PLEASE Watch HILLARY'S AMERICA!!!!!!!!!!!!!NOW!!!!!!!!!",
    "CNN?!?!?!?!?!?!?!?! What kind of people get off on making money to promote porn? Thanks CNN every kid, teen, man, lesbian and whatever, will be googling her photos........ WOW!!!! Anderson Cooper if you want to be better than everyone, how about not reporting \"PROMOTING\" a porn star......",
    "Nah she/he is far to ugly to be VP..But I guess Transgenders are the new rage these days.",
    "Liar & Chief And Head Of The Republician Mafia Party was hell bent on getting this gay guy on the Courts by any Means Necessary, He had his lawyers read how Lucky Luciano & His Gang Murder Inc, got rid of his competition ..",
    "well they are gay people how care about them? 😄😄😄",
    "Lol the translator is so bad.... He doesn\\'t even tries to say what the pope is saying. For example in minute 1.05 \"dales lo que más necesitan\" (which means: \"he them what they need most\"), he translates \"bless them all\". And he this this many times...",
    "Nearly 500 gay injured by fireball at Taiwan water park..they missed one word on the tittle",
    "they do look alike,glad he's not gay always knew it",
    "Is this a guy or a woman?  Transgender?  It has a female name of Rachael but it sure seems to be a man.  Oh well, Friday America starts to become Great Again.\\n\\nPRESIDENT TRUMP     PRESIDENT TRUMP     PRESIDENT TRUMP",
    "Rand Paul is against drone strikes, common core, surveillance, mandatory sentences, civil forfeiture, the patriot act, endless wars, government bailouts, higher taxes, indefinite detention of Americans and for decriminalizing marijuana...\\n\\nI disagree with him on gay rights and GMO labeling, but no one's perfect.\\xa0 I give him a 9/10",
    "Over 90% of gays have been abused... where is that statistic?",
    "\"Trump\\'s Candi(stutter)dacy, it has exposed not just that tragic, the ramifications of that betrayal of a transformation of our country, but too, he has exposed the complicity on both sides of the aisle that has enabled it, ok?\\nCan someone please help me understand what the FUCK she is saying here?",
    "There are too many women for men...a lot of gays and les....",
    "\"ls being gay a perversion?\"   \\nCOME ON CNN!!!!  YOU SUPPORT ISLAM,  AND ISLAM KILL HOMOSEXUALS DAILY!!!... IN SAUDI ARABIA, IRAN, ETC ETC!!!  THEY KILL THEM!!!!!!!!!!!!!!!!!!!!!!!!! BUT U SUPPORT ISLAM~!!!!!!!!!!!!  THEY THINK IT\\'S PERVERSE!!  HELLO>??? \\nU FKNG HYPOCRITES",
    "that gay liberal fucker always got a smerk on his fucking face",
    "WTF, can't pin the car at 3mph? What kind of gay policy is that?",
    "Reversed fascism is emerging in Canada by western civilization haters. Lgbtw2ails+ takes revenge on people not agree with them. Idiot of century justin Trudeau is ruining country.  Canada's economy is sinking with huge  wasteful spending.  Liberals are punishing hardworking taxpayer canadians and rewarding losers",
    "Fuck transgender! This shit wasn't even an issue 5 or even 10 years ago! We are the way we are for a reason...unless this is natural selection not allowing these people to reproduce because they are a bright to humanity haha seriously fat people and transgender need to go.",
    "*Transsexuals. Gender isn't a real thing you shits. \\n\\nAnyways, being in the military isn't exactly a standard job, you kind of have to be fit for the position, and i don't think the military is losing any tactical advantage by not taking in trans people.",
    "as a gay man I must say that transgenderism is NOT a gay identity at all .. It's something quite different . Yet we welcome them into the fight as a sexual minority",
    "The deanne Reid his ex girlfrnd was a transgender..he was lucky to have hot looking jodi😊",
    "i swe to god...this man looks too homosexual !\\nmost of saudis are gay anyways",
    "Holy Crap.PP does do abortions,they merely transport the debris for research.",
    "Fucking hypocrites. They say liberals are too P.C., yet they get outraged whenever someone says anything that they disagree with. They say Stephen Colbert is a homophobe, yet they are against gay marriage.",
    "That's sickening! fucking sound like two Love birds fucken arguing!!! stupid! that Caucasian male must've been GAY!!!! Nasty f**k!",
    "I am not American but I feel that Americans are butthurt cute bitches whinning about blacks,gays and propaganda stuff of liberals \\nI am a non American Muslim but I'm happy for Americans that Trump won.",
    "Lets all vote for her because we never had a woman president. Last year we voted for Obama because he was the first black president. After herThe next president should be the first trans gender president. It dosnt matter if they know how to make the country better.",
    "Cleaned up Cohen Tape w/ transcript:\\n\\nhttps://soundcloud.com/daniilkharms/cleaner-cohen-tape\\n\\n1. Bring it to me and no one else.\\n\\n2. So where we aren't paying \\n\\n3. Listen, what financing - OR - wait a sec - what financing?\\n\\n4. Cohen: Well, I have to pay an/in instalment(s)\\n\\n5. So I'll pay with cash",
    "The law is BS. In a trial they as you to put the hand on the Bible and tell the truth and after that they make you to ignore the words in the bible that tell you to be against gay mariage.",
    "Global Warming, now renamed climate change, is full of holes. It's definitely not science, more like religion, resembling nazism. See this video, very logical and transparent, it will totally change your mind.\\nhttps://youtu.be/ICGal_8qI8c",
    "SO THE GAY MAN HAS MORE TESTOSTERONE THAN THE POLICE?!!",
    "Did u know that one cares that ur gay or trans or whatever everyone’s trippin that they get a whole month to them selves when we should focus on world hunger or some shit but other than that shit cause some attention seekin",
    "Alright lads.\\nTwo genders\\nIf your trans there are still two genders\\nThought I would just clarify that\\nEdit: oh my God this got popular fast\\nAnother edit: oh god this is my most famous comment",
    "It ok to be a person. Gay is not a virtue, neither to be heterosexual.",
    "Here are some words that should be banned:\\xa0 racist, sexist, misogynist, xenophobic, homophobic, transphobic, bully, among others.\\xa0 Why?\\xa0 Because they are overused, primarily with the intent to paint people in absolute terms as evil, stupid, hateful, and intolerant, in order to\\xa0render them defenseless, marginalized, and silent.\\xa0 Talk about hate speech!",
    "He is a fucking idiot fake hair fake colour fake cock bahahaha his gay",
    "B-2's with nuclear bunker busters, B-1's with cruise missiles, fully loaded B-52's doing what those old war wagons do( yippie-kay-yay mo-fo), full load out Apaches and Abrams, all the billions of rounds DHS stockpiled transferred to our people there.....yeah, it could be an interesting event. Pugsly needs to go.",
    "removing the headphone jack was a gay move done by a gay ceo / now that make sense",
    "I was eating pan dulce in my kitchen and when I heard the gentleman say he liked his abuse because he is gay.. i started choking on my bread  badly!! I can’t believe my ears! I’m so sorry 😐",
    "Someone how nows korean please translate as much as you can please; the translation is bull right?",
    "yes lets return that to the states but oh no we can let the states decide if gay people can marry or if women can decide what to do with their own fucking bodies these people are un fucking believable",
    "Im sorry nobody wants to be gay with you ben",
    "17 year old brown bald lesbian wants me to give up my guns.....sorry, not happening Miss.",
    "Plot twist: Christians still persecute gays and are in fact not the ones persecuted",
    "THERE ARE HUNDREDS OF JOURNALISTS KILLED IN DIFFERENT PARTS OF THE WORLD..WHAT THE HELLL HAS FALLEN ON GAY AMERICANS THAT THEY AND THEIR PET DOGS ARE WORRIED SO MUCH??AMERICANS AND THIS HYPOCRITES MEDIA DID NOT SEE KILLING OF JOURNALIST IN INDIA OCCUPIED KASHMIR??",
    "Why so many ass-kissers of USA here? All of them leaving dumb comments like \"OMG COMMUNIZMUS STILL EXISTSS, ONLY WE HAZZ DEMOkRAZY!!! \"\\nI piss on their NATO standards for democracy!\\nTransnistria is better then many other European states that ARE recognized.",
    "Amazing that a teen Lesbian would wear a Cuban flag on her jacket. Not only is she a Communist anti American but she would not be excepted in Cuba. Were gays were imprisoned or murdered. This girl is a Propaganda tool and Nothing more. So sad",
    "One solution, transgender people should go back to their mother's womb and be reborn to the gender they like.",
    "Red silver j , what do you think about this Rachel and her trans race b.s?",
    "I don't buy this. There looks like a black man there yet no one is asking him questions and out of the blue the white kid who did not salute is gay. Nope sorry. Keep it moving folks this is all propaganda",
    "Wait, hold up!?!?..so he's transgender but his fiance is a female???.. I'm confused.",
    "Bad movie. Contrived. Hackneyed. I like Joss Whedon, but it just seems like too many corporate cooks in the kitchen...I mean, really...castrating the Hulk and turning his story arc into a lesbian romance is unacceptable.",
    "half are gay the other half are  lesbiance must be George Sorros people.",
    "Why is there no mention anywhere about James Howell from Indiana the 'white extremist' who apparently planned a similar massacre at Gay pride on the very same day??\\nHe wasn't a Muslim",
    "There you go, leave the transgender issue to the states.  The federal govt is responsible for protecting this country.",
    "Wow.. how many fraudulent transactions did she just do.. when the irs catches up there will be millions to be payed and loss of w.e license the probably don't have.. lmao dumb ass..",
    "They are still looking for the perfect black, lesbian, disabled, transgendered, Islamic candidate for 2020.",
    "ugh, I hate fox now considering the support gay marriage which is so stupid of them thinking that is fine over god's rules, but yes they still are good news but this is very stupid of of fox.",
    "Transgenders are a severe minority’s we shouldn’t have to change the rules to make them feel better about themselves",
    "Honestly the worst thing Marvel did in my opinion is making Iceman gay",
    "gay right and transgenderism is the same....cock in arse.....arse on cock both ways",
    "He did not answer questions directly. Facebook is run by kids. Smart kids but kids. He is not being transparent at all. He has no idea on how to fix it because Facebook is not architected to do it. This is nothing but bobbing and weaving.",
    "If they go in straight and come out gay then they either were hiding the fact that they were gay, were unsure before, or discovered then. They didn’t just be like “Well I think I wanna become gay today”",
    "we need a butt kicker as president like trump,  not no pc correct panzy, like gay obama.",
    "I’m bisexual and I don’t want to be in the LGBT community",
    "The name \"Mother of All Bombs\" is very offensive. It may offend transgendered people.",
    "the neighborhood across the street  is section 8 ,15$ a month rent 800$ a month in food stamps and they brag about 1000$ weave and 3000$ sunglasses , oh and most dont work and there is affirmative action and public transportation....OBAMA PHONE DAYS ARE OVER",
    "what exactly are gay white men stealing from black culture",
    "Hey Jim, the script clearly said \"Donald Trump. KKK. Racist, sexist, anti-gay\". Let\\'s do this again, Take 2",
    "he's a trans Boy.  he should be able to be in scout. what your saying is the counslers have the rifht to look down little boys pants to say if they can join your all the fucking sickos in that case",
    "Well hoopdefuckindooda! Do these ass clowns actually think Putin didn't expect this? This guy's an actual World leader! Unlike gay boybama who's only concern is..........??????????????? shit I don't think the man knows or does \\xa0anything useful.",
    "Don is gay and his momma sound like a man.",
    "Tf don’t make him change the rules you guys colonised them now your gonna make us gay",
    "He said it plain as day on television. How does only 47% of America understand \"I proudly own this shutdown\"? Do we need translators? Pictures instead of words? I don\\'t understand where the confusion is coming from--he said it!! It\\'s on video tape!! Wtf???",
    "Trump owns them. That’s why they want the cameras off. He’s transparent and they can’t be. I do Business in El Paso and the word on the street is it’s damn near impossible now to get across. Thanks Trump. Shut it down if you have to.",
    "Makes me miss my SF transgender church choir: Transcendance Gospel Choir",
    "Can’t even look trump in the eye. Lol what a puss. Keep it strong sir. Proud to have you as the president. We need transparency. We need more of this. The twitter thing is good for transparency, at least we aren’t being kept in the dark. Thank you.",
    "Gender equality? A transformer playing against women is fair? She-he said ' other men' listen to the video!",
    "I adore and respect Ms. Amanpour very much, but when she asked them about how as straight guys, were they able to do the gay scences,  i wanted to shout (or Timmy should): Look at Armie, isn't he lovely, are you blind, woman?? :D",
    "*I wonder if Ingraham is an outted transgender or not*",
    "The solution to the whole gay marriage debate is simple: \\xa0Get the government completely out of defining marriage and the marriage business, end marriage licenses, and let people voluntarily associate with and enter into any consensual contract with another person no matter what they want to call it.",
    "Fox news is bullshit & Donald Gay Chump is a clown",
    "No one gives a shit about this there are far more important things then some gay persons feelings 🤷\\u200d♂️",
    "i feel a gay vibe between these two guys. sus",
    "Omg so many black gay lesbian  feminist and illegal democrats on the comment section tonight",
    "why people being transphobic, racist, and just ugly in the comments?😅😅",
    "Freedom of religion is still a thing you know? We all don't believe in the same God. My God says it's alright for gay people to get married. My God is also a black woman.",
    "Im sorry to all of the transgender people who are reading these negative comments.",
    "Im loving the digital transition of the funny pages in news paper to CNN. Brilliant! Long live comic strips",
    "The gospels say nothing at all about gays or abortion, but they sure are specific regarding divorce and adultery. These people are neither honest nor authentic in their beliefs, and are lacking all integrity. These are today's Scribes and Pharisees.",
    "Nazi salute? are you fucking blind and is your translator deaf??",
    "Alice gives the most typical, wishy-washy; Bland ass ;I give a damn but I don\\'t because it\\'s not having to me. Explanations about why she is still supporting \" Republicans\". The sister is good. Alice is transparent..",
    "Ted Stevens International is the 2nd busiest air cargo hub in the United State - and the 5th busiest in the world - because (partly) our location right along the flight paths between the U.S. and Asia. FedEx and UPS both have major transshipment facilities out at the airport.",
    "So they don't want transgender girls to compete with other girls even if they are on hormones but they don't want trans boys  to wrestle girls because they take testosterone where do they want them to compete without feeling out of place or at a disadvantage",
    "why can't the educational values of the west and east coasts transfer over to these retarded states",
    "I figured out the reason for the gay movement..they are getting everyone ready for anal probes.",
    "EVERYBODY knows that's the arrival of the Autobots.... Prob for the shooting of Transformers 5. lol",
    "Larper gays who need to grow up or go-to jail",
    "this is bullshit...she's just another lesbian/mexican taking advantage of the situation to expand left wing politics...she looks like she aspires to be another female mex looking to make it big in the UFC....my guns are here baby, and they ain't goin' no where.",
    "Bullshit rhetoric.\\xa0 He knows just who is marginalizes .... who cares about what they do to gays in Iran.\\xa0 WE DON'T LIVE IN IRAN.\\xa0 I'll buy the fucker a one way ticket to Tehran.",
    "lol\\xa0 trump 2 gay boy dnt chalange me\\xa0 bow down an suck my big1",
    "Male energy 😂😂 hopefully you are not going to have transgendered any time soon!!",
    "They look and sound gay as fuck.....or is it just me 😞",
    "Ehhhhhhh. (Care sarcasm) I  mean how uncommon to hear different languages in an airport. I mean  when I have a transit flight in China I always talk during this time in mandarin to my parents as a german.",
    "while in the bible it says, “man shall not lay with man,” it was lost in transalation. (as it was originally in greek.) what it actually meant was “man shall not lay with boy.” which regards pedo stuff.",
    "I don't get it god gives us freedom of choice then punishes our choices? God loves all of his children but not gays or lesbians? God created us and made some of us gay and now they're going to go to hell? ",
    "Let me guess all the people who bowed are fat lesbians",
    "if the baker is devout he has the right to   practice his beliefs (but respectfully) don’t stop when he goes to work. just as the gay couple have the right to get married, find another baker and leave a bad trip advisor review or whatever",
    "I don't understand, aren't transwomen former gay men who no longer like dressing in drag?\\nOr at least gay boy's who want the female role in a male/ shemale relationship?  I guess my question is: Aren't all transwomen former gay men.",
    "Every country has their own right bruhh.and LGBT no ones really alowed as a good thing .LGBT they should being rehab...now imagine how if your father is a Gay .are you  guys accept him?? i bet you guys must be feel",
    "Good day for humanity and equality, bout fuckin time (gay marriage, 10 commandments went down too)",
    "Identifier of personality ID (identity document-microcomputer) by Volodya Vashchyshyn 27 ghz, 28 ghz-is a global biometric biological processing (introducing or transmitting) information processor radar-tracking implant document-storage device of the personal data with function of e-purse-bank account-function of one general world money unit (the connection with Central bank of the Earth).\\nidentifierofpersonality27ghz",
    "I’m transgender and this acronym is ridiculous! Just keep it lgbt!! Nobody gonna remember all that bullshit! 😂😂",
    "Dabbing is shit! And it's gay! And it is horse shit! 😠 😠 😠 😠 👎",
    "The Wizardry of Wireless (1923) - radio transmission - silent film w/mus... https://youtu.be/1v3S2v8LmeE via @YouTube",
    "Children are shooting each other in America and you worried about gay rights in Kenya really",
    "Instead of worrying about his shit solve the hunger and homeless problems first. Wtf is gay marriage going to do? I swear these people only care about getting the 'people' on their side so they can vote for them..",
    "megyn Kelly looks and sounds like a transgender cant stand her",
    "Here's a mf that signed for gay rights and speaking on what's civil please .",
    "What was the point of shooting at a gay bar then? Didn't we suffer before this as well?",
    "What an idiot! Republicans must be the most stupid people on the planet! So those people who are raped in prison choose to be gay! Fucking idiot! Gayism is more complex than you think stupid surgeon!!!!",
    "If he's transgender, ftm, then why isn't he in the boys' wrestling?",
    "If all surveillance was legal..whats the concern? Maybe the concern is Nunes was captured also during incidental collection because he was part of Trump transitioning team. INDEPENDENT INVESTIGATION IS A MUST!",
    "why is people so scared of gays??? wait, I know never mind..",
    "here\\'s another thing the right has to get over, \"video games are the devil\". This bs is up there with gay marriage and abortions, stupid non issues the right clings onto.",
    "Can Saudi Arabia reveal evidence that this was a troop transport of child soldiers without exposing operatives?",
    "CNN reporters are gay look at that cock sucker he want it in his asshole",
    "Nye thinks Transexuals are a scientific reality.  nuff said.",
    "I know that iran has renewed its ruls for gays and now gays r living in iran freely,also I visited the cites of Esfehan ,Shiraz,yazd and Hamedan the people were so friendly and I enjoyed a lot,i can say iran was the safest place I have ever met.",
    "eu já disse  esse liderzinho do isis é gay, da um pinto de borracha que ele se acalma.",
    "She adopted a girl and was mad when she didn't grow up to be lesbian just like her smh",
    "The View looks like a bunch of aging angry old transvestites",
    "Ted Cruz Amit's he wants a 'gay people' genocide is senator Cruz unhinged?",
    "You guys at cnn are the most gayest thing I have ever seen",
    "gedoo gaye ka peshab pata ho ora bata hum ko kerta ho 1 putli ko poga go apna hat sa kiloona bena ka us ko poogn koi sense ha nahi keh hum kider ga reha ha",
    "Most people who say”being gay is a choice” are either in the closet or bisexual you can’t say if your sexuality is a choice if your straight cause you don’t see gay people coming up saying being straight is a choice either",
    "MARCH ON WASHINGTON. FRIDAY JUNE 22. DEMAND TRANSPARENCY OF IG REPORT! DEMAND EQUAL JUSTICE UNDER THE LAW! DEMAND NO OBSTRUCTION OF JUSTICE BY THE DOJ. DEMAND ROD ROSENSTEIN RECUSED! Q says BE LOUD! Q says FIGHT!",
    "A religion of peace, unless you are gay or Jewish.\\xa0 Wake up America, this is just wrong",
    "\" every Kenyan is protected\" stop asking for more rights than others. If someone attacks you for being gay that\\'s between you and the attacker. Press charges . Just like if a straight guy gets attacked on Saturday night by straight guys.",
    "You can be gay or lesbian at that age, but I believe 8 years old is too young to decide what gender you are. At least let the kid choose when he/she's a teenager. Other than that, it's not normal.",
    "Wow, Can't believe CNN hired this guy to translate. ",
    "poor gay his ego is bigger than his brain, and his penis",
    "wtf did I just watch... sooooo lemme get this straight so everyone has to stick to their own sterotypes? well, I'll be sure next time I see another gay man I let him know tht the black women are against us.\\xa0",
    "never seen this guy before. but 100% he is either gay, or stays on the bottom.",
    "Fox news editing in progress. Lets take the bad photo of Pelosi and put it on the cover of the video. Just like the time they got caught making a Jewish ny times reporter nose bigger in a photo. Oh fox you are so transparent.",
    "Not quite sure how SHS can support trans ban today, considering she is one herself.",
    "Lesbian, Gay, Genderqueer, Bisexual, Demisexual, Transgender, Transsexual, Twospirit, Intersex, Queer, Questioning, Asexual, Allies, Pansexual, and Polyamorous.",
    "No one talks about the millions there scared Hillary Clinton took from countries that behead gays.",
    "I doubt any transgender person would want to serve in the military anyways",
    "All Humans should have equal status. No one should disrespect how others are born, straight or gay,  we can all fall in love, no one else  should stop this. Whether children are born to the couple should be up to them.",
    "It\\'s amusing to see how the NFL lost sight of who their customers are. They seem to be catering to \"progressive\" liberals, lgbtqs, and feminized men, when their customers are no-nonsense real men, and a few women!",
    "Yes, thanks to a metric F-ton of loyal civil servants in many government agencies, Trump has not transformed the United States into a Fascist Dictatorship.  Yes the system is working, but only just.",
    "Trump just got me of the hook .if \\nI get draft I'm going gay !",
    "I love how he stumbled on \"LGBP.. LGBT\", this is just facts and it\\'s ashame the country is making this such a big deal. Deal with facts, you\\'re a boy or girl and you can\\'t change without surgery!",
    "ISIS took credit for Pulse. This means ISIS allows gay membership?",
    "since when a Christian care a bout gay marriage and abortion?",
    "Sweetheart, Christians in Egypt and Syria having their homes burned down for being Christian are experiencing PERSECUTION; people calling you out for being an anti-gay bigot funneled through your religion is NOT PERSECUTION.  #growthefuckup",
    "This people are coming here to live off our taxes, theyre demanding the people of mexico give them food, shelter and transportation, what do you think they'll be like ones they're here.",
    "Good for you Kevin!!! Be your own man but why apologize again?  It’s sad to see how men compromise their truth for they gay community but newsflash Oscars.  Blacks don’t watch the Oscars anyway.  Why aren’t the gay/transgender community apologizing to Black community",
    "their is no such thing as gay bi or les. those people are all just confused and their is no such thing as being gay. you all act like such idiots and act so fucking stupid. you all are so confused with yourself.",
    "I really support Kenyatta in that way ..Africa does not need gay rights it unethical in Africa",
    "Why adopt black and Latino kids? That alone is suspect. My grandfather is always saying we should have stay segregated. Gay ppl should not be able to adopt. You gave that up when u chose to be gay. Go have your own kids!",
    "If he’s for transparency, he should be demanding that the intel committee #releasethememo Bombshell stuff. But he won’t, because he’s party over country. Citizens have a right to know what happened with the bogus FISA warrant and who was involved.",
    "I am sorry but the simple fact that Anderson Cooper is gay. No respect!!!!!!!!!!!",
    "Trump: Openly says he could shoot his voters and still win\\nPence: Openly believes shock therapy should be used to treat gays\\nHamilton Lead: Openly calls on Pence to treat everyone fairly\\n\\nThe actor is the one harassing people...",
    "I hate his arrogant ass. He doesn't care about the poor. He tried to take away medicade. And he constantly writes executive orders to hurt the LGBT community especially the trans community. This President needs to go!",
    "a lot of idiots here. to make a choice or not is a big gray area. I know plenty of \"gay\" people who would say yeah it was a choice while others will say they liked the same sex from the get go.",
    "All the black girl is saying is that these white gay males should stop acting like a stereotypical black woman, such as Sharkeisha, just because it is funny. It paints a bad image on the black female community as a whole. ",
    "I hope he repents and may the mercy of Allah reach both him and his victims, inshallah. I believe that the indiscriminate bombing of civilians is against Allah´s commandment for Muslims not to transgress while fighting wars. Allahu a´alim.",
    "اتمني ان يكون هنالك ترجمة للعربيه\\nI hope that if there is translate to arabic",
    "Batman senses a movement to undermine North America. First they push gay rights, then gay marriage, then transgender rights. What's next pedophile rights? This shit has to stop. Russia has their shit together as far as Batman is concerned. They even outlawed microwaves.....because it causes f##ckin cancer.",
    "Who is she trying to kid. She don’t want transparency did you see the interview that was made public.",
    "Everyone type 111 if CNN is not cool and is gay asf.",
    "Absolutely ridiculous gay marriage shouldn’t be legal in the first place",
    "If Hillary supporters would just awake from their Clinton-induced stupor they would realize what an elitist ploy this is just to ensure this woman gonif will not be besmirched by anything on her way to the election.  An unbelievably transparent act of perfidy.",
    "Soooo much virtue in this lynching mob that harassed a gay.",
    "This lizard walker, soros funded gay frog can never sue me. The truth will prevail.",
    "Cnn is nothing more than A Gay liberal soap box and no one cares anymore you are done. if the states stopped giving israel foreign aid your financial backing would dry up and you would just wither on the vine !!!",
    "6th person. Not 5th. It has been widely reported that the Russian lawyer had a translator. Unless this counter intelligence officer is also the translator, he/she is the 6th person in the room. But it was still, obviously, a very forgettable and uneventful meeting.",
    "He doesn't get a pass after the transgender jokes. Fuck Dave Chappelle.",
    "CNN an arm of the Gay Gestapo!\\xa0 The Bible also condemns Homosexual acts, so must REAL Christians.\\xa0 But the Gay Gestapo will target these Christians organizations just because they can't stand some people not agreeing with their sinful lifestyle. \\xa0\\xa0\\n\\nThis Reporter is a Sophists of the lowest degree.",
    "It's not like the baker refused them service to anything else. He even said he would sell them a premade cake from his shop. He just wouldn't take a commission to make a cake. If he had just told them he wouldn't sell his products to gays, then that's discrimination.",
    "Do anyone know where I can find a transcript of this video?",
    "Why does it goes viral?\\nA police oficer helped an autistic Afro-American.\\n100% political correct!\\nIf that boy was a gay it would be 1000% correct!\\nI am not sarcastic.But that is how the media see it!",
    "He is so funny! Why wouldn't he say that the first time about charolettsville, that would have made sense. One thing I can say is I do like how transparent he is because I need to know when someone is not for you and who you are dealing with.",
    "The Clinton Foundation took money from the Saudis who punishes/Kills gays and has terrible womens rights. Women cant drive and need permission to go outside without their husbands. Wake up People, this b*tch is built on blood money. Vote Trump!!",
    "The West is always trying to push the LGBT agenda! #someonetellCNN that we are NOT INTERESTED! LGBT rights are not an issue to us as a country. We have other more pressing issues to pursue!!!",
    "Absolute fucking idiots...... NAZI? REALLY? Do they know he's gay and had a black husband? Absolute backwards lefties with not a brain cell between them. If you have a different opinion you call gay people married to a black guy a fucking NAZI!!!!",
    "Clinton News Network is fake news and Kanye West is still a gay fish.",
    "I dont care you are gay or not. All I care is that you have ruined apple",
    "What an abrasive attempt by the host to transition the conversation into reality show nonsense...",
    "This gentleman is one of the most respectful journalists I have ever seen interview anyone in the trans community. Kudos to you, sir, I will definitely watch more of your videos.",
    "Hi, friendly reminder. If you think being gay is a choice, you're gay.",
    "\" attacking woman, gays and blacks\" .... ????? Omg ... Out of context, totally",
    "Well i mean optimus prime did turn eveil in the last transformers movie...lel",
    "I am a transspecies and I consider myself as a fish... My name is peanut..",
    "A Lovely and beautiful Lady!  Donald Trump is a very lucky guy!  She is very articulate and expresses her ideas\\nquite well. I don't think there was any need to copy lines from two-faced Trans-looking Michelle Obama!  She will definitely be a better first lady than Michelle!!",
    "This kid is gay. Just wants attention. Listen to his lisp. Just grow up kid. You lied and made two stories about this shooting. Grow up and go to college already and learn about the real world",
    "He's a non binary transgender pansexual bisexual  muslim latino Hillary supporter refugee and vegan.",
    "Us Navajos have a president, a Begaye. You have a Trump. You can keep him.",
    "If I was the DNI Trumps translator would have been wearing a wire.",
    "This video proves that Canada is way better than the USA. We never allowed slavery, and related: we are not as racist on average. Gay men can donate blood here and get married. So yeah. ",
    "I don't get it god gives us freedom of choice then punishes our choices? God loves all of his children but not gays or lesbians? God created us and made some of us gay and now they're going to go to hell? ",
    "He looks so gay the second time he says 'Aleppo'.",
    "Protecting the family. That I understand, but not killing gays or life imprisonment.",
    "The western world should stop pressuring Africa into this topic. Children are schooling under trees, health care is not up to standard. I agree that the least on our Agenda as Africa is LGBT issues. Well said Mr. President",
    "There are parent support groups for parents to better handle when their child is \"coming out\" or express being transgender. Kevin Hart saying he wants to prevent his son from being gay is not homophobic, insensitive, sure, but not homophobic!!",
    "The Russians build a new bridge in the Siberia, expert said it could (insert transformer music) into a ICBM.",
    "I'm so sorry for Putin's translator because, firstly, he has to translate trump's English, and secondly, being one of the only four people in that room to have this information puts his life in danger.",
    "Hey trump true affection for each other,  that includes transgender military personnel.",
    "CNN advocates crashing peaceful transition of power with no survivors.",
    "Pence is transparent. He clearly lied in the face of evidence and timeline.,perhaps he thought it would not surface.",
    "cov fe\\'fe is Arabic for \"I will stand up\".  Source: Google Translate.",
    "Gay and butthurt by his remarks 🤔.. Who would have figured",
    "maxine water is A racist. the writing is on the wall, \"who ever can tell me what it says, I will give half my kingdom\". maxine waters is exactly like the person who asked for help in translating \"the writing is on the wall\"",
    "it would be better presented a portrait of Hitler's queen as a child, she loved him so, even ridge scam .... and no, it is its own, it can not be done\\nps..Google translation",
    "blah blah enough talking more fighting😠 coloreds, gays, women, free trade, immigration united! fuck         O'Reilly he's a fucking Nazi!",
    "I live in Florida, She is and has been very anti lgbt.She was very vocal in the fight against same sex marriage in Florida and other lgbt issues.I was feelin the same as cooper.WTF are you even doing here?",
    "All I know is former president Obama was gay and his wife Michelle is really a transvestite. Yuck!",
    "One of the sadder things I've seen is Bill Nye's transformation from a likeable goofball who taught kids some basic science into a smug scold who cluelessly delves into matters far beyond his knowledge or understanding.",
    "I hope the BRICS union can transcend economical matters and even become a bond of political loyalty",
    "Most people who say”being gay is a choice” are either in the closet or bisexual you can’t say if your sexuality is a choice if your straight cause you don’t see gay people coming up saying being straight is a choice either",
    "We should do a total Recount and stop Trump's transition until we find out if Trump is right.....",
    "Trophy wife serving as a billboard for her husband. Part of the transaction, i guess",
    "This news story is an insult to real women that have carried children in their womb.That is a very obvious\\xa0man to female transgender! There is no amount of makeup and expensive designer that can cover up the very obvious male skeletal structure."
]